
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k ucsb_152_tap_fir.v

yosys> verific -vlog2k ucsb_152_tap_fir.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'ucsb_152_tap_fir.v'

yosys> synth_rs -top ucsb_152_tap_fir -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top ucsb_152_tap_fir

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2: compiling module 'ucsb_152_tap_fir'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2290: compiling module 'Subtractor14Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2303: compiling module 'Subtractor17Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2316: compiling module 'Subtractor22Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2619: compiling module 'Negator23Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2435: compiling module 'Register23Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2078: compiling module 'Adder21Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2448: compiling module 'Register22Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2092: compiling module 'Adder22Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2461: compiling module 'Register24Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2106: compiling module 'Adder23Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2120: compiling module 'Adder17Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2342: compiling module 'Subtractor21Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2329: compiling module 'Subtractor24Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2474: compiling module 'Register25Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2134: compiling module 'Adder18Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2500: compiling module 'Register19Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2381: compiling module 'Subtractor18Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2355: compiling module 'Subtractor19Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2487: compiling module 'Register20Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2162: compiling module 'Adder19Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2658: compiling module 'Negator20Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2394: compiling module 'Subtractor20Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2513: compiling module 'Register21Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2526: compiling module 'Register27Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2671: compiling module 'Negator22Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2190: compiling module 'Adder14Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2632: compiling module 'Negator24Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2552: compiling module 'Register18Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2539: compiling module 'Register28Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2368: compiling module 'Subtractor23Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2697: compiling module 'Negator15Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2565: compiling module 'Register15Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2204: compiling module 'Adder15Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2645: compiling module 'Negator21Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2176: compiling module 'Adder20Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2407: compiling module 'Subtractor15Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2148: compiling module 'Adder24Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2684: compiling module 'Negator25Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2420: compiling module 'Subtractor16Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2578: compiling module 'Register12Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2218: compiling module 'Adder25Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2591: compiling module 'Register26Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2232: compiling module 'Adder26Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2246: compiling module 'Adder27Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2260: compiling module 'Adder28Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2604: compiling module 'Register29Bit'
VERIFIC-INFO [VERI-1018] ucsb_152_tap_fir.v:2274: compiling module 'Adder29Bit'
Importing module ucsb_152_tap_fir.
Importing module Adder14Bit.
Importing module Adder15Bit.
Importing module Adder17Bit.
Importing module Adder18Bit.
Importing module Adder19Bit.
Importing module Adder20Bit.
Importing module Adder21Bit.
Importing module Adder22Bit.
Importing module Adder23Bit.
Importing module Adder24Bit.
Importing module Adder25Bit.
Importing module Adder26Bit.
Importing module Adder27Bit.
Importing module Adder28Bit.
Importing module Adder29Bit.
Importing module Negator15Bit.
Importing module Negator20Bit.
Importing module Negator21Bit.
Importing module Negator22Bit.
Importing module Negator23Bit.
Importing module Negator24Bit.
Importing module Negator25Bit.
Importing module Register12Bit.
Importing module Register15Bit.
Importing module Register18Bit.
Importing module Register19Bit.
Importing module Register20Bit.
Importing module Register21Bit.
Importing module Register22Bit.
Importing module Register23Bit.
Importing module Register24Bit.
Importing module Register25Bit.
Importing module Register26Bit.
Importing module Register27Bit.
Importing module Register28Bit.
Importing module Register29Bit.
Importing module Subtractor14Bit.
Importing module Subtractor15Bit.
Importing module Subtractor16Bit.
Importing module Subtractor17Bit.
Importing module Subtractor18Bit.
Importing module Subtractor19Bit.
Importing module Subtractor20Bit.
Importing module Subtractor21Bit.
Importing module Subtractor22Bit.
Importing module Subtractor23Bit.
Importing module Subtractor24Bit.

3.4.1. Analyzing design hierarchy..
Top module:  \ucsb_152_tap_fir
Used module:     \Adder29Bit
Used module:     \Register29Bit
Used module:     \Adder28Bit
Used module:     \Register28Bit
Used module:     \Adder27Bit
Used module:     \Register27Bit
Used module:     \Adder26Bit
Used module:     \Register26Bit
Used module:     \Adder25Bit
Used module:     \Register21Bit
Used module:     \Register12Bit
Used module:     \Register25Bit
Used module:     \Adder24Bit
Used module:     \Register24Bit
Used module:     \Negator24Bit
Used module:     \Adder23Bit
Used module:     \Register22Bit
Used module:     \Subtractor21Bit
Used module:     \Register20Bit
Used module:     \Subtractor19Bit
Used module:     \Register23Bit
Used module:     \Negator23Bit
Used module:     \Adder22Bit
Used module:     \Adder21Bit
Used module:     \Subtractor23Bit
Used module:     \Subtractor22Bit
Used module:     \Negator20Bit
Used module:     \Subtractor16Bit
Used module:     \Negator25Bit
Used module:     \Negator21Bit
Used module:     \Adder20Bit
Used module:     \Subtractor24Bit
Used module:     \Subtractor15Bit
Used module:     \Adder19Bit
Used module:     \Subtractor20Bit
Used module:     \Adder15Bit
Used module:     \Register15Bit
Used module:     \Negator15Bit
Used module:     \Register19Bit
Used module:     \Adder18Bit
Used module:     \Register18Bit
Used module:     \Subtractor17Bit
Used module:     \Adder17Bit
Used module:     \Adder14Bit
Used module:     \Negator22Bit
Used module:     \Subtractor18Bit
Used module:     \Subtractor14Bit

3.4.2. Analyzing design hierarchy..
Top module:  \ucsb_152_tap_fir
Used module:     \Adder29Bit
Used module:     \Register29Bit
Used module:     \Adder28Bit
Used module:     \Register28Bit
Used module:     \Adder27Bit
Used module:     \Register27Bit
Used module:     \Adder26Bit
Used module:     \Register26Bit
Used module:     \Adder25Bit
Used module:     \Register21Bit
Used module:     \Register12Bit
Used module:     \Register25Bit
Used module:     \Adder24Bit
Used module:     \Register24Bit
Used module:     \Negator24Bit
Used module:     \Adder23Bit
Used module:     \Register22Bit
Used module:     \Subtractor21Bit
Used module:     \Register20Bit
Used module:     \Subtractor19Bit
Used module:     \Register23Bit
Used module:     \Negator23Bit
Used module:     \Adder22Bit
Used module:     \Adder21Bit
Used module:     \Subtractor23Bit
Used module:     \Subtractor22Bit
Used module:     \Negator20Bit
Used module:     \Subtractor16Bit
Used module:     \Negator25Bit
Used module:     \Negator21Bit
Used module:     \Adder20Bit
Used module:     \Subtractor24Bit
Used module:     \Subtractor15Bit
Used module:     \Adder19Bit
Used module:     \Subtractor20Bit
Used module:     \Adder15Bit
Used module:     \Register15Bit
Used module:     \Negator15Bit
Used module:     \Register19Bit
Used module:     \Adder18Bit
Used module:     \Register18Bit
Used module:     \Subtractor17Bit
Used module:     \Adder17Bit
Used module:     \Adder14Bit
Used module:     \Negator22Bit
Used module:     \Subtractor18Bit
Used module:     \Subtractor14Bit
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module Subtractor24Bit.
Optimizing module Subtractor23Bit.
Optimizing module Subtractor22Bit.
Optimizing module Subtractor21Bit.
Optimizing module Subtractor20Bit.
Optimizing module Subtractor19Bit.
Optimizing module Subtractor18Bit.
Optimizing module Subtractor17Bit.
Optimizing module Subtractor16Bit.
Optimizing module Subtractor15Bit.
Optimizing module Subtractor14Bit.
Optimizing module Register29Bit.
Optimizing module Register28Bit.
Optimizing module Register27Bit.
Optimizing module Register26Bit.
Optimizing module Register25Bit.
Optimizing module Register24Bit.
Optimizing module Register23Bit.
Optimizing module Register22Bit.
Optimizing module Register21Bit.
Optimizing module Register20Bit.
Optimizing module Register19Bit.
Optimizing module Register18Bit.
Optimizing module Register15Bit.
Optimizing module Register12Bit.
Optimizing module Negator25Bit.
Optimizing module Negator24Bit.
Optimizing module Negator23Bit.
Optimizing module Negator22Bit.
Optimizing module Negator21Bit.
Optimizing module Negator20Bit.
Optimizing module Negator15Bit.
Optimizing module Adder29Bit.
Optimizing module Adder28Bit.
Optimizing module Adder27Bit.
Optimizing module Adder26Bit.
Optimizing module Adder25Bit.
Optimizing module Adder24Bit.
Optimizing module Adder23Bit.
Optimizing module Adder22Bit.
Optimizing module Adder21Bit.
Optimizing module Adder20Bit.
Optimizing module Adder19Bit.
Optimizing module Adder18Bit.
Optimizing module Adder17Bit.
Optimizing module Adder15Bit.
Optimizing module Adder14Bit.
Optimizing module ucsb_152_tap_fir.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module Adder14Bit.
Deleting now unused module Adder15Bit.
Deleting now unused module Adder17Bit.
Deleting now unused module Adder18Bit.
Deleting now unused module Adder19Bit.
Deleting now unused module Adder20Bit.
Deleting now unused module Adder21Bit.
Deleting now unused module Adder22Bit.
Deleting now unused module Adder23Bit.
Deleting now unused module Adder24Bit.
Deleting now unused module Adder25Bit.
Deleting now unused module Adder26Bit.
Deleting now unused module Adder27Bit.
Deleting now unused module Adder28Bit.
Deleting now unused module Adder29Bit.
Deleting now unused module Negator15Bit.
Deleting now unused module Negator20Bit.
Deleting now unused module Negator21Bit.
Deleting now unused module Negator22Bit.
Deleting now unused module Negator23Bit.
Deleting now unused module Negator24Bit.
Deleting now unused module Negator25Bit.
Deleting now unused module Register12Bit.
Deleting now unused module Register15Bit.
Deleting now unused module Register18Bit.
Deleting now unused module Register19Bit.
Deleting now unused module Register20Bit.
Deleting now unused module Register21Bit.
Deleting now unused module Register22Bit.
Deleting now unused module Register23Bit.
Deleting now unused module Register24Bit.
Deleting now unused module Register25Bit.
Deleting now unused module Register26Bit.
Deleting now unused module Register27Bit.
Deleting now unused module Register28Bit.
Deleting now unused module Register29Bit.
Deleting now unused module Subtractor14Bit.
Deleting now unused module Subtractor15Bit.
Deleting now unused module Subtractor16Bit.
Deleting now unused module Subtractor17Bit.
Deleting now unused module Subtractor18Bit.
Deleting now unused module Subtractor19Bit.
Deleting now unused module Subtractor20Bit.
Deleting now unused module Subtractor21Bit.
Deleting now unused module Subtractor22Bit.
Deleting now unused module Subtractor23Bit.
Deleting now unused module Subtractor24Bit.
<suppressed ~788 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 0 unused cells and 47691 unused wires.
<suppressed ~791 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module ucsb_152_tap_fir...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
<suppressed ~663 debug messages>
Removed a total of 221 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$x0_reg$ucsb_152_tap_fir.v:804$8 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $verific$Out_Y_reg$ucsb_152_tap_fir.v:810$10 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub9.$verific$SubOut_reg$ucsb_152_tap_fir.v:2313$45636 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub8.$verific$SubOut_reg$ucsb_152_tap_fir.v:2391$45645 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub7.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub6.$verific$SubOut_reg$ucsb_152_tap_fir.v:2339$45699 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub5.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder19.$verific$AddOut_reg$ucsb_152_tap_fir.v:2187$45350 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder185.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder188.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub44.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub43.$verific$SubOut_reg$ucsb_152_tap_fir.v:2365$45654 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub42.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub41.$verific$SubOut_reg$ucsb_152_tap_fir.v:2378$45690 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub40.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub4.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub39.$verific$SubOut_reg$ucsb_152_tap_fir.v:2365$45654 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub38.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub37.$verific$SubOut_reg$ucsb_152_tap_fir.v:2430$45627 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub36.$verific$SubOut_reg$ucsb_152_tap_fir.v:2339$45699 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub35.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub34.$verific$SubOut_reg$ucsb_152_tap_fir.v:2365$45654 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub33.$verific$SubOut_reg$ucsb_152_tap_fir.v:2417$45618 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub32.$verific$SubOut_reg$ucsb_152_tap_fir.v:2378$45690 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub31.$verific$SubOut_reg$ucsb_152_tap_fir.v:2378$45690 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub30.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub3.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub29.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub28.$verific$SubOut_reg$ucsb_152_tap_fir.v:2365$45654 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub27.$verific$SubOut_reg$ucsb_152_tap_fir.v:2404$45663 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub26.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub25.$verific$SubOut_reg$ucsb_152_tap_fir.v:2339$45699 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub24.$verific$SubOut_reg$ucsb_152_tap_fir.v:2378$45690 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub23.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub22.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub21.$verific$SubOut_reg$ucsb_152_tap_fir.v:2404$45663 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub20.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub2.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub19.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub18.$verific$SubOut_reg$ucsb_152_tap_fir.v:2339$45699 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub17.$verific$SubOut_reg$ucsb_152_tap_fir.v:2365$45654 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub16.$verific$SubOut_reg$ucsb_152_tap_fir.v:2326$45681 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub15.$verific$SubOut_reg$ucsb_152_tap_fir.v:2313$45636 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub14.$verific$SubOut_reg$ucsb_152_tap_fir.v:2339$45699 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub13.$verific$SubOut_reg$ucsb_152_tap_fir.v:2365$45654 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub12.$verific$SubOut_reg$ucsb_152_tap_fir.v:2352$45672 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub11.$verific$SubOut_reg$ucsb_152_tap_fir.v:2404$45663 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub10.$verific$SubOut_reg$ucsb_152_tap_fir.v:2365$45654 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub1.$verific$SubOut_reg$ucsb_152_tap_fir.v:2313$45636 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Sub0.$verific$SubOut_reg$ucsb_152_tap_fir.v:2300$45609 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder184.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder183.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder182.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg94.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg93.$verific$RegOut_reg$ucsb_152_tap_fir.v:2562$45523 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg92.$verific$RegOut_reg$ucsb_152_tap_fir.v:2562$45523 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder181.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg89.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg88.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder180.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg86.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder18.$verific$AddOut_reg$ucsb_152_tap_fir.v:2215$45310 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg83.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg82.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder179.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg79.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg78.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder178.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder177.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg74.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg73.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg72.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder176.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg7.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg69.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg68.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder175.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg64.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg63.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg62.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder174.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg6.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder173.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg58.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg57.$verific$RegOut_reg$ucsb_152_tap_fir.v:2510$45530 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg56.$verific$RegOut_reg$ucsb_152_tap_fir.v:2510$45530 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder172.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg528.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg527.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg526.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg525.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg524.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg523.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg522.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg521.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg520.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg52.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg519.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg518.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg517.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg516.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg515.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg514.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg513.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg512.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg511.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg510.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg51.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg509.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg508.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg507.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg506.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg505.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg504.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg503.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg502.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg501.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg500.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg50.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder171.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg499.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg498.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg497.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg496.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg495.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg494.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg493.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg492.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg491.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg490.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg489.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg488.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg487.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg486.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg485.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg484.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg483.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg482.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg481.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg480.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder170.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg479.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg478.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg477.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg476.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg475.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg474.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg473.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg472.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg471.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg470.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg469.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg468.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg467.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg466.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg465.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg464.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg463.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg462.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg461.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg460.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg46.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg459.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg458.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg457.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg456.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg455.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg454.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg453.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg452.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg451.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg450.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg45.$verific$RegOut_reg$ucsb_152_tap_fir.v:2510$45530 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg449.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg448.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg447.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg446.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg445.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg444.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg443.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg442.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg441.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg440.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg44.$verific$RegOut_reg$ucsb_152_tap_fir.v:2510$45530 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg439.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg438.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg437.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg436.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg435.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg434.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg433.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg432.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg431.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg430.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder17.$verific$AddOut_reg$ucsb_152_tap_fir.v:2117$45380 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg429.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg428.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg427.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg426.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg425.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg424.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg423.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg422.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg421.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg420.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg42.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg419.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg418.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg417.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg416.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg415.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg414.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg413.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg412.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg411.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg410.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg409.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg408.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg407.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg406.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg405.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg404.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg403.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg402.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg401.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg400.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder169.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg399.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg398.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg397.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg396.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg395.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg394.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg393.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg392.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg391.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg390.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg39.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg389.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg388.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg387.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg386.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg385.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg384.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg383.$verific$RegOut_reg$ucsb_152_tap_fir.v:2614$45600 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg382.$verific$RegOut_reg$ucsb_152_tap_fir.v:2549$45593 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg381.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg380.$verific$RegOut_reg$ucsb_152_tap_fir.v:2601$45579 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg38.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg379.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg377.$verific$RegOut_reg$ucsb_152_tap_fir.v:2588$45509 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg376.$verific$RegOut_reg$ucsb_152_tap_fir.v:2588$45509 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder168.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder26.$verific$AddOut_reg$ucsb_152_tap_fir.v:2187$45350 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder167.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder166.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder28.$verific$AddOut_reg$ucsb_152_tap_fir.v:2089$45360 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder165.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder25.$verific$AddOut_reg$ucsb_152_tap_fir.v:2103$45370 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder164.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder24.$verific$AddOut_reg$ucsb_152_tap_fir.v:2187$45350 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg36.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder163.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder23.$verific$AddOut_reg$ucsb_152_tap_fir.v:2117$45380 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder162.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder161.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder22.$verific$AddOut_reg$ucsb_152_tap_fir.v:2187$45350 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder160.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg347.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg346.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder16.$verific$AddOut_reg$ucsb_152_tap_fir.v:2117$45380 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg343.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder159.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg340.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder158.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg339.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder157.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg336.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg335.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder156.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg332.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg331.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg33.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder155.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg328.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder154.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg325.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg324.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg323.$verific$RegOut_reg$ucsb_152_tap_fir.v:2588$45509 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg322.$verific$RegOut_reg$ucsb_152_tap_fir.v:2588$45509 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder153.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg32.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg318.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg317.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg316.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder152.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder151.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg312.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg311.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg310.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder150.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder15.$verific$AddOut_reg$ucsb_152_tap_fir.v:2089$45360 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg306.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg305.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg304.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder149.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg300.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder148.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg3.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg299.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg298.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder147.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder146.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder145.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg291.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg29.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder144.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg288.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg287.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg286.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder143.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg282.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg281.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg280.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg28.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder142.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg277.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg276.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder141.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg273.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg272.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder140.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder14.$verific$AddOut_reg$ucsb_152_tap_fir.v:2173$45340 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg268.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg267.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg266.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder139.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg263.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg262.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder138.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder137.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg258.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg257.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg256.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder136.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder135.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg252.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg251.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg250.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg25.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder134.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg247.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg246.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder133.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg243.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg242.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder132.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg24.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg239.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg238.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder131.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg234.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg233.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg232.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder130.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder13.$verific$AddOut_reg$ucsb_152_tap_fir.v:2145$45330 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg229.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg228.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder129.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg224.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg223.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg222.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder128.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder127.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg218.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg217.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg216.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder126.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder125.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg212.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg211.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg210.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg21.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder124.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg206.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg205.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg204.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder123.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg201.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg200.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg20.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg2.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder122.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder121.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg196.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg195.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg194.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder120.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg190.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder12.$verific$AddOut_reg$ucsb_152_tap_fir.v:2117$45380 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg189.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg188.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder119.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg185.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg184.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder118.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg180.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder117.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg179.$verific$RegOut_reg$ucsb_152_tap_fir.v:2575$45516 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg178.$verific$RegOut_reg$ucsb_152_tap_fir.v:2575$45516 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder116.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg175.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg174.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder115.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg171.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg170.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg17.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder114.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg167.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg166.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder113.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg163.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg162.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder112.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg16.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg159.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg158.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg156.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder111.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg153.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg152.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder110.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder11.$verific$AddOut_reg$ucsb_152_tap_fir.v:2131$45320 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg148.$verific$RegOut_reg$ucsb_152_tap_fir.v:2549$45593 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg147.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg146.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder109.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder108.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg142.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg141.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg140.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg14.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder107.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg136.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg135.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg134.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder106.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder105.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg130.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg129.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg128.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder104.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg125.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg124.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder103.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder102.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg120.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg119.$verific$RegOut_reg$ucsb_152_tap_fir.v:2510$45530 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg118.$verific$RegOut_reg$ucsb_152_tap_fir.v:2510$45530 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder101.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder100.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg114.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg113.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg112.$verific$RegOut_reg$ucsb_152_tap_fir.v:2497$45537 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder10.$verific$AddOut_reg$ucsb_152_tap_fir.v:2201$45300 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg11.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg109.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg108.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder1.$verific$AddOut_reg$ucsb_152_tap_fir.v:2103$45370 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg104.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg103.$verific$RegOut_reg$ucsb_152_tap_fir.v:2562$45523 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg102.$verific$RegOut_reg$ucsb_152_tap_fir.v:2562$45523 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg101.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg100.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg10.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder0.$verific$AddOut_reg$ucsb_152_tap_fir.v:2089$45360 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Reg0.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg9.$verific$NegOut_reg$ucsb_152_tap_fir.v:2707$45448 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg8.$verific$NegOut_reg$ucsb_152_tap_fir.v:2642$45493 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg7.$verific$NegOut_reg$ucsb_152_tap_fir.v:2668$45457 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg6.$verific$NegOut_reg$ucsb_152_tap_fir.v:2642$45493 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg5.$verific$NegOut_reg$ucsb_152_tap_fir.v:2681$45475 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg4.$verific$NegOut_reg$ucsb_152_tap_fir.v:2668$45457 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg3.$verific$NegOut_reg$ucsb_152_tap_fir.v:2629$45484 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder21.$verific$AddOut_reg$ucsb_152_tap_fir.v:2089$45360 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder27.$verific$AddOut_reg$ucsb_152_tap_fir.v:2159$45390 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg2.$verific$NegOut_reg$ucsb_152_tap_fir.v:2629$45484 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg19.$verific$NegOut_reg$ucsb_152_tap_fir.v:2629$45484 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg18.$verific$NegOut_reg$ucsb_152_tap_fir.v:2642$45493 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg17.$verific$NegOut_reg$ucsb_152_tap_fir.v:2668$45457 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg16.$verific$NegOut_reg$ucsb_152_tap_fir.v:2694$45502 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg15.$verific$NegOut_reg$ucsb_152_tap_fir.v:2655$45466 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg14.$verific$NegOut_reg$ucsb_152_tap_fir.v:2629$45484 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg13.$verific$NegOut_reg$ucsb_152_tap_fir.v:2655$45466 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg12.$verific$NegOut_reg$ucsb_152_tap_fir.v:2655$45466 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg11.$verific$NegOut_reg$ucsb_152_tap_fir.v:2655$45466 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg10.$verific$NegOut_reg$ucsb_152_tap_fir.v:2655$45466 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg1.$verific$NegOut_reg$ucsb_152_tap_fir.v:2629$45484 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Neg0.$verific$NegOut_reg$ucsb_152_tap_fir.v:2629$45484 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder99.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder98.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder97.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder96.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder95.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder94.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder93.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder92.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder91.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder90.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder9.$verific$AddOut_reg$ucsb_152_tap_fir.v:2089$45360 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder89.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder88.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder87.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder86.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder85.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder84.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder83.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder82.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder81.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder80.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder8.$verific$AddOut_reg$ucsb_152_tap_fir.v:2173$45340 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder79.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder78.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder77.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder76.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder75.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder74.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder73.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder72.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder71.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder70.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder7.$verific$AddOut_reg$ucsb_152_tap_fir.v:2103$45370 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder69.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder68.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder67.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder66.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder65.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder64.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder63.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder62.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder61.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder60.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder6.$verific$AddOut_reg$ucsb_152_tap_fir.v:2103$45370 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder59.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder58.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder57.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder56.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder55.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder54.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder53.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder52.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder51.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder50.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder5.$verific$AddOut_reg$ucsb_152_tap_fir.v:2145$45330 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder49.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder48.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder47.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder46.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder45.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder44.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder43.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder42.$verific$AddOut_reg$ucsb_152_tap_fir.v:2271$45430 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder41.$verific$AddOut_reg$ucsb_152_tap_fir.v:2257$45420 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder40.$verific$AddOut_reg$ucsb_152_tap_fir.v:2243$45410 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder4.$verific$AddOut_reg$ucsb_152_tap_fir.v:2117$45380 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder39.$verific$AddOut_reg$ucsb_152_tap_fir.v:2229$45400 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder20.$verific$AddOut_reg$ucsb_152_tap_fir.v:2173$45340 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder187.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder2.$verific$AddOut_reg$ucsb_152_tap_fir.v:2117$45380 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder186.$verific$AddOut_reg$ucsb_152_tap_fir.v:2285$45439 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder34.$verific$AddOut_reg$ucsb_152_tap_fir.v:2089$45360 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder33.$verific$AddOut_reg$ucsb_152_tap_fir.v:2103$45370 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder32.$verific$AddOut_reg$ucsb_152_tap_fir.v:2117$45380 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder31.$verific$AddOut_reg$ucsb_152_tap_fir.v:2159$45390 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder30.$verific$AddOut_reg$ucsb_152_tap_fir.v:2159$45390 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder3.$verific$AddOut_reg$ucsb_152_tap_fir.v:2131$45320 ($aldff) from module ucsb_152_tap_fir.
Removing never-active async load on $flatten\Adder29.$verific$AddOut_reg$ucsb_152_tap_fir.v:2103$45370 ($aldff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg104.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg104.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg104.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 3 on $flatten\Reg104.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg114.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg120.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg120.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg120.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg125.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg125.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg130.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg14.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg142.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg148.$verific$RegOut_reg$ucsb_152_tap_fir.v:2549$45593 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg148.$verific$RegOut_reg$ucsb_152_tap_fir.v:2549$45593 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg148.$verific$RegOut_reg$ucsb_152_tap_fir.v:2549$45593 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 3 on $flatten\Reg148.$verific$RegOut_reg$ucsb_152_tap_fir.v:2549$45593 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 4 on $flatten\Reg148.$verific$RegOut_reg$ucsb_152_tap_fir.v:2549$45593 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg153.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg180.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg180.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg180.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 3 on $flatten\Reg180.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 4 on $flatten\Reg180.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 5 on $flatten\Reg180.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg185.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg185.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg190.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg196.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg206.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg206.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg206.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg224.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg229.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg239.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg239.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg239.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg243.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg247.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg25.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg252.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg273.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg273.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg291.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg312.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg312.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg336.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg336.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg336.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 3 on $flatten\Reg336.$verific$RegOut_reg$ucsb_152_tap_fir.v:2471$45565 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg340.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg347.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 3 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 4 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 5 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 6 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 7 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 8 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 9 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 10 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 11 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 12 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 13 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 14 on $flatten\Reg378.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg46.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg46.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg46.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 3 on $flatten\Reg46.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg58.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg58.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg58.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg64.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg64.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg64.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg69.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg69.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg69.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg7.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg74.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg79.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg79.$verific$RegOut_reg$ucsb_152_tap_fir.v:2536$45586 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg83.$verific$RegOut_reg$ucsb_152_tap_fir.v:2445$45558 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg86.$verific$RegOut_reg$ucsb_152_tap_fir.v:2484$45572 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 0 on $flatten\Reg94.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 1 on $flatten\Reg94.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 2 on $flatten\Reg94.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.
Setting constant 0-bit at position 3 on $flatten\Reg94.$verific$RegOut_reg$ucsb_152_tap_fir.v:2458$45551 ($dff) from module ucsb_152_tap_fir.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.25. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.25.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.25.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.25.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.25.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> fsm_opt

3.25.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.25.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.25.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.25.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.26. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_merge -nomux

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.28. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.29. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.30. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.31. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.32. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 0-bit at position 0 on $flatten\Reg379.$verific$RegOut_reg$ucsb_152_tap_fir.v:2523$45544 ($dff) from module ucsb_152_tap_fir.

yosys> opt_clean

3.33. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> opt_expr

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.35. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 18) from port A of cell ucsb_152_tap_fir.$flatten\Sub9.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
Removed top 1 bits (of 18) from port B of cell ucsb_152_tap_fir.$flatten\Sub9.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
Removed top 1 bits (of 19) from port A of cell ucsb_152_tap_fir.$flatten\Sub8.$verific$sub_4$ucsb_152_tap_fir.v:2390$45643 ($sub).
Removed top 1 bits (of 19) from port B of cell ucsb_152_tap_fir.$flatten\Sub8.$verific$sub_4$ucsb_152_tap_fir.v:2390$45643 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub7.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub7.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 25) from port A of cell ucsb_152_tap_fir.$flatten\Sub6.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 25) from port B of cell ucsb_152_tap_fir.$flatten\Sub6.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub5.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub5.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub44.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub44.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 20) from port A of cell ucsb_152_tap_fir.$flatten\Sub43.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 20) from port B of cell ucsb_152_tap_fir.$flatten\Sub43.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub42.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub42.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 24) from port A of cell ucsb_152_tap_fir.$flatten\Sub41.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 24) from port B of cell ucsb_152_tap_fir.$flatten\Sub41.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub40.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub40.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub4.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub4.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 20) from port A of cell ucsb_152_tap_fir.$flatten\Sub39.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 20) from port B of cell ucsb_152_tap_fir.$flatten\Sub39.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub38.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub38.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 17) from port A of cell ucsb_152_tap_fir.$flatten\Sub37.$verific$sub_4$ucsb_152_tap_fir.v:2429$45625 ($sub).
Removed top 1 bits (of 17) from port B of cell ucsb_152_tap_fir.$flatten\Sub37.$verific$sub_4$ucsb_152_tap_fir.v:2429$45625 ($sub).
Removed top 1 bits (of 25) from port A of cell ucsb_152_tap_fir.$flatten\Sub36.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 25) from port B of cell ucsb_152_tap_fir.$flatten\Sub36.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub35.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub35.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 20) from port A of cell ucsb_152_tap_fir.$flatten\Sub34.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 20) from port B of cell ucsb_152_tap_fir.$flatten\Sub34.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 16) from port A of cell ucsb_152_tap_fir.$flatten\Sub33.$verific$sub_4$ucsb_152_tap_fir.v:2416$45616 ($sub).
Removed top 1 bits (of 16) from port B of cell ucsb_152_tap_fir.$flatten\Sub33.$verific$sub_4$ucsb_152_tap_fir.v:2416$45616 ($sub).
Removed top 1 bits (of 24) from port A of cell ucsb_152_tap_fir.$flatten\Sub32.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 24) from port B of cell ucsb_152_tap_fir.$flatten\Sub32.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 24) from port A of cell ucsb_152_tap_fir.$flatten\Sub31.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 24) from port B of cell ucsb_152_tap_fir.$flatten\Sub31.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub30.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub30.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub3.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub3.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub29.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub29.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 20) from port A of cell ucsb_152_tap_fir.$flatten\Sub28.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 20) from port B of cell ucsb_152_tap_fir.$flatten\Sub28.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 21) from port A of cell ucsb_152_tap_fir.$flatten\Sub27.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
Removed top 1 bits (of 21) from port B of cell ucsb_152_tap_fir.$flatten\Sub27.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub26.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub26.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 25) from port A of cell ucsb_152_tap_fir.$flatten\Sub25.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 25) from port B of cell ucsb_152_tap_fir.$flatten\Sub25.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 24) from port A of cell ucsb_152_tap_fir.$flatten\Sub24.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 24) from port B of cell ucsb_152_tap_fir.$flatten\Sub24.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub23.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub23.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub22.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub22.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 21) from port A of cell ucsb_152_tap_fir.$flatten\Sub21.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
Removed top 1 bits (of 21) from port B of cell ucsb_152_tap_fir.$flatten\Sub21.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub20.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub20.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub2.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub2.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub19.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub19.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 25) from port A of cell ucsb_152_tap_fir.$flatten\Sub18.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 25) from port B of cell ucsb_152_tap_fir.$flatten\Sub18.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 20) from port A of cell ucsb_152_tap_fir.$flatten\Sub17.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 20) from port B of cell ucsb_152_tap_fir.$flatten\Sub17.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 23) from port A of cell ucsb_152_tap_fir.$flatten\Sub16.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 23) from port B of cell ucsb_152_tap_fir.$flatten\Sub16.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
Removed top 1 bits (of 18) from port A of cell ucsb_152_tap_fir.$flatten\Sub15.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
Removed top 1 bits (of 18) from port B of cell ucsb_152_tap_fir.$flatten\Sub15.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
Removed top 1 bits (of 25) from port A of cell ucsb_152_tap_fir.$flatten\Sub14.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 25) from port B of cell ucsb_152_tap_fir.$flatten\Sub14.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
Removed top 1 bits (of 20) from port A of cell ucsb_152_tap_fir.$flatten\Sub13.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 20) from port B of cell ucsb_152_tap_fir.$flatten\Sub13.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 22) from port A of cell ucsb_152_tap_fir.$flatten\Sub12.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 22) from port B of cell ucsb_152_tap_fir.$flatten\Sub12.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
Removed top 1 bits (of 21) from port A of cell ucsb_152_tap_fir.$flatten\Sub11.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
Removed top 1 bits (of 21) from port B of cell ucsb_152_tap_fir.$flatten\Sub11.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
Removed top 1 bits (of 20) from port A of cell ucsb_152_tap_fir.$flatten\Sub10.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 20) from port B of cell ucsb_152_tap_fir.$flatten\Sub10.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
Removed top 1 bits (of 18) from port A of cell ucsb_152_tap_fir.$flatten\Sub1.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
Removed top 1 bits (of 18) from port B of cell ucsb_152_tap_fir.$flatten\Sub1.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
Removed top 1 bits (of 15) from port A of cell ucsb_152_tap_fir.$flatten\Sub0.$verific$sub_4$ucsb_152_tap_fir.v:2299$45607 ($sub).
Removed top 1 bits (of 15) from port B of cell ucsb_152_tap_fir.$flatten\Sub0.$verific$sub_4$ucsb_152_tap_fir.v:2299$45607 ($sub).

yosys> peepopt

3.36. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> bmuxmap

3.38. Executing BMUXMAP pass.

yosys> demuxmap

3.39. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.40. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module ucsb_152_tap_fir:
  creating $macc model for $flatten\Adder0.$verific$add_4$ucsb_152_tap_fir.v:2088$45358 ($add).
  creating $macc model for $flatten\Adder1.$verific$add_4$ucsb_152_tap_fir.v:2102$45368 ($add).
  creating $macc model for $flatten\Adder10.$verific$add_4$ucsb_152_tap_fir.v:2200$45298 ($add).
  creating $macc model for $flatten\Adder100.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder101.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder102.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder103.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder104.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder105.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder106.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder107.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder108.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder109.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder11.$verific$add_4$ucsb_152_tap_fir.v:2130$45318 ($add).
  creating $macc model for $flatten\Adder110.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder111.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder112.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder113.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder114.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder115.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder116.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder117.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder118.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder119.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder12.$verific$add_4$ucsb_152_tap_fir.v:2116$45378 ($add).
  creating $macc model for $flatten\Adder120.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder121.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder122.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder123.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder124.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder125.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder126.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder127.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder128.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder129.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder13.$verific$add_4$ucsb_152_tap_fir.v:2144$45328 ($add).
  creating $macc model for $flatten\Adder130.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder131.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder132.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder133.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder134.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder135.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder136.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder137.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder138.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder139.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder14.$verific$add_4$ucsb_152_tap_fir.v:2172$45338 ($add).
  creating $macc model for $flatten\Adder140.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder141.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder142.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder143.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder144.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder145.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder146.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder147.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder148.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder149.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder15.$verific$add_4$ucsb_152_tap_fir.v:2088$45358 ($add).
  creating $macc model for $flatten\Adder150.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder151.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder152.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder153.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder154.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder155.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder156.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder157.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder158.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder159.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder16.$verific$add_4$ucsb_152_tap_fir.v:2116$45378 ($add).
  creating $macc model for $flatten\Adder160.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder161.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder162.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder163.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder164.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder165.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder166.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder167.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder168.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder169.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder17.$verific$add_4$ucsb_152_tap_fir.v:2116$45378 ($add).
  creating $macc model for $flatten\Adder170.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder171.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder172.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder173.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder174.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder175.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder176.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder177.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder178.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder179.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder18.$verific$add_4$ucsb_152_tap_fir.v:2214$45308 ($add).
  creating $macc model for $flatten\Adder180.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder181.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder182.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder183.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder184.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder185.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder186.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder187.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder188.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder19.$verific$add_4$ucsb_152_tap_fir.v:2186$45348 ($add).
  creating $macc model for $flatten\Adder2.$verific$add_4$ucsb_152_tap_fir.v:2116$45378 ($add).
  creating $macc model for $flatten\Adder20.$verific$add_4$ucsb_152_tap_fir.v:2172$45338 ($add).
  creating $macc model for $flatten\Adder21.$verific$add_4$ucsb_152_tap_fir.v:2088$45358 ($add).
  creating $macc model for $flatten\Adder22.$verific$add_4$ucsb_152_tap_fir.v:2186$45348 ($add).
  creating $macc model for $flatten\Adder23.$verific$add_4$ucsb_152_tap_fir.v:2116$45378 ($add).
  creating $macc model for $flatten\Adder24.$verific$add_4$ucsb_152_tap_fir.v:2186$45348 ($add).
  creating $macc model for $flatten\Adder25.$verific$add_4$ucsb_152_tap_fir.v:2102$45368 ($add).
  creating $macc model for $flatten\Adder26.$verific$add_4$ucsb_152_tap_fir.v:2186$45348 ($add).
  creating $macc model for $flatten\Adder27.$verific$add_4$ucsb_152_tap_fir.v:2158$45388 ($add).
  creating $macc model for $flatten\Adder28.$verific$add_4$ucsb_152_tap_fir.v:2088$45358 ($add).
  creating $macc model for $flatten\Adder29.$verific$add_4$ucsb_152_tap_fir.v:2102$45368 ($add).
  creating $macc model for $flatten\Adder3.$verific$add_4$ucsb_152_tap_fir.v:2130$45318 ($add).
  creating $macc model for $flatten\Adder30.$verific$add_4$ucsb_152_tap_fir.v:2158$45388 ($add).
  creating $macc model for $flatten\Adder31.$verific$add_4$ucsb_152_tap_fir.v:2158$45388 ($add).
  creating $macc model for $flatten\Adder32.$verific$add_4$ucsb_152_tap_fir.v:2116$45378 ($add).
  creating $macc model for $flatten\Adder33.$verific$add_4$ucsb_152_tap_fir.v:2102$45368 ($add).
  creating $macc model for $flatten\Adder34.$verific$add_4$ucsb_152_tap_fir.v:2088$45358 ($add).
  creating $macc model for $flatten\Adder39.$verific$add_4$ucsb_152_tap_fir.v:2228$45398 ($add).
  creating $macc model for $flatten\Adder4.$verific$add_4$ucsb_152_tap_fir.v:2116$45378 ($add).
  creating $macc model for $flatten\Adder40.$verific$add_4$ucsb_152_tap_fir.v:2242$45408 ($add).
  creating $macc model for $flatten\Adder41.$verific$add_4$ucsb_152_tap_fir.v:2256$45418 ($add).
  creating $macc model for $flatten\Adder42.$verific$add_4$ucsb_152_tap_fir.v:2270$45428 ($add).
  creating $macc model for $flatten\Adder43.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder44.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder45.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder46.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder47.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder48.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder49.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder5.$verific$add_4$ucsb_152_tap_fir.v:2144$45328 ($add).
  creating $macc model for $flatten\Adder50.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder51.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder52.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder53.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder54.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder55.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder56.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder57.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder58.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder59.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder6.$verific$add_4$ucsb_152_tap_fir.v:2102$45368 ($add).
  creating $macc model for $flatten\Adder60.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder61.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder62.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder63.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder64.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder65.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder66.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder67.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder68.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder69.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder7.$verific$add_4$ucsb_152_tap_fir.v:2102$45368 ($add).
  creating $macc model for $flatten\Adder70.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder71.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder72.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder73.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder74.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder75.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder76.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder77.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder78.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder79.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder8.$verific$add_4$ucsb_152_tap_fir.v:2172$45338 ($add).
  creating $macc model for $flatten\Adder80.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder81.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder82.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder83.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder84.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder85.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder86.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder87.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder88.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder89.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder9.$verific$add_4$ucsb_152_tap_fir.v:2088$45358 ($add).
  creating $macc model for $flatten\Adder90.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder91.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder92.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder93.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder94.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder95.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder96.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder97.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder98.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Adder99.$verific$add_4$ucsb_152_tap_fir.v:2284$45437 ($add).
  creating $macc model for $flatten\Neg0.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482 ($neg).
  creating $macc model for $flatten\Neg1.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482 ($neg).
  creating $macc model for $flatten\Neg10.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464 ($neg).
  creating $macc model for $flatten\Neg11.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464 ($neg).
  creating $macc model for $flatten\Neg12.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464 ($neg).
  creating $macc model for $flatten\Neg13.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464 ($neg).
  creating $macc model for $flatten\Neg14.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482 ($neg).
  creating $macc model for $flatten\Neg15.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464 ($neg).
  creating $macc model for $flatten\Neg16.$verific$unary_minus_4$ucsb_152_tap_fir.v:2693$45500 ($neg).
  creating $macc model for $flatten\Neg17.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455 ($neg).
  creating $macc model for $flatten\Neg18.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491 ($neg).
  creating $macc model for $flatten\Neg19.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482 ($neg).
  creating $macc model for $flatten\Neg2.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482 ($neg).
  creating $macc model for $flatten\Neg3.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482 ($neg).
  creating $macc model for $flatten\Neg4.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455 ($neg).
  creating $macc model for $flatten\Neg5.$verific$unary_minus_4$ucsb_152_tap_fir.v:2680$45473 ($neg).
  creating $macc model for $flatten\Neg6.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491 ($neg).
  creating $macc model for $flatten\Neg7.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455 ($neg).
  creating $macc model for $flatten\Neg8.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491 ($neg).
  creating $macc model for $flatten\Neg9.$verific$unary_minus_4$ucsb_152_tap_fir.v:2706$45446 ($neg).
  creating $macc model for $flatten\Sub0.$verific$sub_4$ucsb_152_tap_fir.v:2299$45607 ($sub).
  creating $macc model for $flatten\Sub1.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
  creating $macc model for $flatten\Sub10.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
  creating $macc model for $flatten\Sub11.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
  creating $macc model for $flatten\Sub12.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub13.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
  creating $macc model for $flatten\Sub14.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
  creating $macc model for $flatten\Sub15.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
  creating $macc model for $flatten\Sub16.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub17.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
  creating $macc model for $flatten\Sub18.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
  creating $macc model for $flatten\Sub19.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub2.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub20.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub21.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
  creating $macc model for $flatten\Sub22.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub23.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub24.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
  creating $macc model for $flatten\Sub25.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
  creating $macc model for $flatten\Sub26.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub27.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661 ($sub).
  creating $macc model for $flatten\Sub28.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
  creating $macc model for $flatten\Sub29.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub3.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub30.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub31.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
  creating $macc model for $flatten\Sub32.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
  creating $macc model for $flatten\Sub33.$verific$sub_4$ucsb_152_tap_fir.v:2416$45616 ($sub).
  creating $macc model for $flatten\Sub34.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
  creating $macc model for $flatten\Sub35.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub36.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
  creating $macc model for $flatten\Sub37.$verific$sub_4$ucsb_152_tap_fir.v:2429$45625 ($sub).
  creating $macc model for $flatten\Sub38.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub39.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
  creating $macc model for $flatten\Sub4.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub40.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub41.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688 ($sub).
  creating $macc model for $flatten\Sub42.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub43.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652 ($sub).
  creating $macc model for $flatten\Sub44.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670 ($sub).
  creating $macc model for $flatten\Sub5.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub6.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697 ($sub).
  creating $macc model for $flatten\Sub7.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679 ($sub).
  creating $macc model for $flatten\Sub8.$verific$sub_4$ucsb_152_tap_fir.v:2390$45643 ($sub).
  creating $macc model for $flatten\Sub9.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634 ($sub).
  creating $alu model for $macc $flatten\Sub9.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634.
  creating $alu model for $macc $flatten\Sub8.$verific$sub_4$ucsb_152_tap_fir.v:2390$45643.
  creating $alu model for $macc $flatten\Sub7.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub6.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697.
  creating $alu model for $macc $flatten\Sub5.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub44.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub43.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652.
  creating $alu model for $macc $flatten\Sub42.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub41.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688.
  creating $alu model for $macc $flatten\Sub40.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub4.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub39.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652.
  creating $alu model for $macc $flatten\Sub38.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub37.$verific$sub_4$ucsb_152_tap_fir.v:2429$45625.
  creating $alu model for $macc $flatten\Sub36.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697.
  creating $alu model for $macc $flatten\Sub35.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub34.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652.
  creating $alu model for $macc $flatten\Sub33.$verific$sub_4$ucsb_152_tap_fir.v:2416$45616.
  creating $alu model for $macc $flatten\Sub32.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688.
  creating $alu model for $macc $flatten\Sub31.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688.
  creating $alu model for $macc $flatten\Sub30.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub3.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub29.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub28.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652.
  creating $alu model for $macc $flatten\Sub27.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661.
  creating $alu model for $macc $flatten\Sub26.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub25.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697.
  creating $alu model for $macc $flatten\Sub24.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688.
  creating $alu model for $macc $flatten\Sub23.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub22.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub21.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661.
  creating $alu model for $macc $flatten\Sub20.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub2.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub19.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub18.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697.
  creating $alu model for $macc $flatten\Sub17.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652.
  creating $alu model for $macc $flatten\Sub16.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679.
  creating $alu model for $macc $flatten\Sub15.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634.
  creating $alu model for $macc $flatten\Sub14.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697.
  creating $alu model for $macc $flatten\Sub13.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652.
  creating $alu model for $macc $flatten\Sub12.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670.
  creating $alu model for $macc $flatten\Sub11.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661.
  creating $alu model for $macc $flatten\Sub10.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652.
  creating $alu model for $macc $flatten\Sub1.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634.
  creating $alu model for $macc $flatten\Sub0.$verific$sub_4$ucsb_152_tap_fir.v:2299$45607.
  creating $alu model for $macc $flatten\Neg9.$verific$unary_minus_4$ucsb_152_tap_fir.v:2706$45446.
  creating $alu model for $macc $flatten\Neg8.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491.
  creating $alu model for $macc $flatten\Neg7.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455.
  creating $alu model for $macc $flatten\Neg6.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491.
  creating $alu model for $macc $flatten\Neg5.$verific$unary_minus_4$ucsb_152_tap_fir.v:2680$45473.
  creating $alu model for $macc $flatten\Neg4.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455.
  creating $alu model for $macc $flatten\Neg3.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482.
  creating $alu model for $macc $flatten\Neg2.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482.
  creating $alu model for $macc $flatten\Neg19.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482.
  creating $alu model for $macc $flatten\Neg18.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491.
  creating $alu model for $macc $flatten\Neg17.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455.
  creating $alu model for $macc $flatten\Neg16.$verific$unary_minus_4$ucsb_152_tap_fir.v:2693$45500.
  creating $alu model for $macc $flatten\Neg15.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464.
  creating $alu model for $macc $flatten\Neg14.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482.
  creating $alu model for $macc $flatten\Neg13.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464.
  creating $alu model for $macc $flatten\Neg12.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464.
  creating $alu model for $macc $flatten\Neg11.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464.
  creating $alu model for $macc $flatten\Neg10.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464.
  creating $alu model for $macc $flatten\Neg1.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482.
  creating $alu model for $macc $flatten\Neg0.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482.
  creating $alu model for $macc $flatten\Adder99.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder98.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder97.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder96.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder95.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder94.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder93.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder92.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder91.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder90.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder9.$verific$add_4$ucsb_152_tap_fir.v:2088$45358.
  creating $alu model for $macc $flatten\Adder89.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder88.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder87.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder86.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder85.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder84.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder83.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder82.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder81.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder80.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder8.$verific$add_4$ucsb_152_tap_fir.v:2172$45338.
  creating $alu model for $macc $flatten\Adder79.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder78.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder77.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder76.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder75.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder74.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder73.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder72.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder71.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder70.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder7.$verific$add_4$ucsb_152_tap_fir.v:2102$45368.
  creating $alu model for $macc $flatten\Adder69.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder68.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder67.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder66.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder65.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder64.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder63.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder62.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder61.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder60.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder6.$verific$add_4$ucsb_152_tap_fir.v:2102$45368.
  creating $alu model for $macc $flatten\Adder59.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder58.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder57.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder56.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder55.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder54.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder53.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder52.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder51.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder50.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder5.$verific$add_4$ucsb_152_tap_fir.v:2144$45328.
  creating $alu model for $macc $flatten\Adder49.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder48.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder47.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder46.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder45.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder44.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder43.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder42.$verific$add_4$ucsb_152_tap_fir.v:2270$45428.
  creating $alu model for $macc $flatten\Adder41.$verific$add_4$ucsb_152_tap_fir.v:2256$45418.
  creating $alu model for $macc $flatten\Adder40.$verific$add_4$ucsb_152_tap_fir.v:2242$45408.
  creating $alu model for $macc $flatten\Adder4.$verific$add_4$ucsb_152_tap_fir.v:2116$45378.
  creating $alu model for $macc $flatten\Adder39.$verific$add_4$ucsb_152_tap_fir.v:2228$45398.
  creating $alu model for $macc $flatten\Adder34.$verific$add_4$ucsb_152_tap_fir.v:2088$45358.
  creating $alu model for $macc $flatten\Adder33.$verific$add_4$ucsb_152_tap_fir.v:2102$45368.
  creating $alu model for $macc $flatten\Adder32.$verific$add_4$ucsb_152_tap_fir.v:2116$45378.
  creating $alu model for $macc $flatten\Adder31.$verific$add_4$ucsb_152_tap_fir.v:2158$45388.
  creating $alu model for $macc $flatten\Adder30.$verific$add_4$ucsb_152_tap_fir.v:2158$45388.
  creating $alu model for $macc $flatten\Adder3.$verific$add_4$ucsb_152_tap_fir.v:2130$45318.
  creating $alu model for $macc $flatten\Adder29.$verific$add_4$ucsb_152_tap_fir.v:2102$45368.
  creating $alu model for $macc $flatten\Adder28.$verific$add_4$ucsb_152_tap_fir.v:2088$45358.
  creating $alu model for $macc $flatten\Adder27.$verific$add_4$ucsb_152_tap_fir.v:2158$45388.
  creating $alu model for $macc $flatten\Adder26.$verific$add_4$ucsb_152_tap_fir.v:2186$45348.
  creating $alu model for $macc $flatten\Adder25.$verific$add_4$ucsb_152_tap_fir.v:2102$45368.
  creating $alu model for $macc $flatten\Adder24.$verific$add_4$ucsb_152_tap_fir.v:2186$45348.
  creating $alu model for $macc $flatten\Adder23.$verific$add_4$ucsb_152_tap_fir.v:2116$45378.
  creating $alu model for $macc $flatten\Adder22.$verific$add_4$ucsb_152_tap_fir.v:2186$45348.
  creating $alu model for $macc $flatten\Adder21.$verific$add_4$ucsb_152_tap_fir.v:2088$45358.
  creating $alu model for $macc $flatten\Adder20.$verific$add_4$ucsb_152_tap_fir.v:2172$45338.
  creating $alu model for $macc $flatten\Adder2.$verific$add_4$ucsb_152_tap_fir.v:2116$45378.
  creating $alu model for $macc $flatten\Adder19.$verific$add_4$ucsb_152_tap_fir.v:2186$45348.
  creating $alu model for $macc $flatten\Adder188.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder187.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder186.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder185.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder184.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder183.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder182.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder181.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder180.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder18.$verific$add_4$ucsb_152_tap_fir.v:2214$45308.
  creating $alu model for $macc $flatten\Adder179.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder178.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder177.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder176.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder175.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder174.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder173.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder172.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder171.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder170.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder17.$verific$add_4$ucsb_152_tap_fir.v:2116$45378.
  creating $alu model for $macc $flatten\Adder169.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder168.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder167.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder166.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder165.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder164.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder163.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder162.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder161.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder160.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder16.$verific$add_4$ucsb_152_tap_fir.v:2116$45378.
  creating $alu model for $macc $flatten\Adder159.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder158.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder157.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder156.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder155.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder154.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder153.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder152.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder151.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder150.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder15.$verific$add_4$ucsb_152_tap_fir.v:2088$45358.
  creating $alu model for $macc $flatten\Adder149.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder148.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder147.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder146.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder145.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder144.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder143.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder142.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder141.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder140.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder14.$verific$add_4$ucsb_152_tap_fir.v:2172$45338.
  creating $alu model for $macc $flatten\Adder139.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder138.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder137.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder136.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder135.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder134.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder133.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder132.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder131.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder130.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder13.$verific$add_4$ucsb_152_tap_fir.v:2144$45328.
  creating $alu model for $macc $flatten\Adder129.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder128.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder127.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder126.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder125.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder124.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder123.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder122.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder121.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder120.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder12.$verific$add_4$ucsb_152_tap_fir.v:2116$45378.
  creating $alu model for $macc $flatten\Adder119.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder118.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder117.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder116.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder115.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder114.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder113.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder112.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder111.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder110.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder11.$verific$add_4$ucsb_152_tap_fir.v:2130$45318.
  creating $alu model for $macc $flatten\Adder109.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder108.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder107.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder106.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder105.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder104.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder103.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder102.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder101.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder100.$verific$add_4$ucsb_152_tap_fir.v:2284$45437.
  creating $alu model for $macc $flatten\Adder10.$verific$add_4$ucsb_152_tap_fir.v:2200$45298.
  creating $alu model for $macc $flatten\Adder1.$verific$add_4$ucsb_152_tap_fir.v:2102$45368.
  creating $alu model for $macc $flatten\Adder0.$verific$add_4$ucsb_152_tap_fir.v:2088$45358.
  creating $alu cell for $flatten\Adder0.$verific$add_4$ucsb_152_tap_fir.v:2088$45358: $auto$alumacc.cc:485:replace_alu$45739
  creating $alu cell for $flatten\Adder10.$verific$add_4$ucsb_152_tap_fir.v:2200$45298: $auto$alumacc.cc:485:replace_alu$45742
  creating $alu cell for $flatten\Adder100.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45745
  creating $alu cell for $flatten\Adder101.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45748
  creating $alu cell for $flatten\Adder102.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45751
  creating $alu cell for $flatten\Adder103.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45754
  creating $alu cell for $flatten\Adder104.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45757
  creating $alu cell for $flatten\Adder105.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45760
  creating $alu cell for $flatten\Adder106.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45763
  creating $alu cell for $flatten\Adder107.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45766
  creating $alu cell for $flatten\Adder108.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45769
  creating $alu cell for $flatten\Adder109.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45772
  creating $alu cell for $flatten\Adder11.$verific$add_4$ucsb_152_tap_fir.v:2130$45318: $auto$alumacc.cc:485:replace_alu$45775
  creating $alu cell for $flatten\Adder110.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45778
  creating $alu cell for $flatten\Adder111.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45781
  creating $alu cell for $flatten\Adder112.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45784
  creating $alu cell for $flatten\Adder113.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45787
  creating $alu cell for $flatten\Adder114.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45790
  creating $alu cell for $flatten\Adder115.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45793
  creating $alu cell for $flatten\Adder116.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45796
  creating $alu cell for $flatten\Adder117.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45799
  creating $alu cell for $flatten\Adder118.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45802
  creating $alu cell for $flatten\Adder119.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45805
  creating $alu cell for $flatten\Adder12.$verific$add_4$ucsb_152_tap_fir.v:2116$45378: $auto$alumacc.cc:485:replace_alu$45808
  creating $alu cell for $flatten\Adder120.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45811
  creating $alu cell for $flatten\Adder121.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45814
  creating $alu cell for $flatten\Adder122.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45817
  creating $alu cell for $flatten\Adder123.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45820
  creating $alu cell for $flatten\Adder124.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45823
  creating $alu cell for $flatten\Adder125.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45826
  creating $alu cell for $flatten\Adder126.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45829
  creating $alu cell for $flatten\Adder127.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45832
  creating $alu cell for $flatten\Adder128.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45835
  creating $alu cell for $flatten\Adder129.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45838
  creating $alu cell for $flatten\Adder13.$verific$add_4$ucsb_152_tap_fir.v:2144$45328: $auto$alumacc.cc:485:replace_alu$45841
  creating $alu cell for $flatten\Adder130.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45844
  creating $alu cell for $flatten\Adder131.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45847
  creating $alu cell for $flatten\Adder132.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45850
  creating $alu cell for $flatten\Adder133.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45853
  creating $alu cell for $flatten\Adder134.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45856
  creating $alu cell for $flatten\Adder135.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45859
  creating $alu cell for $flatten\Adder136.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45862
  creating $alu cell for $flatten\Adder137.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45865
  creating $alu cell for $flatten\Adder138.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45868
  creating $alu cell for $flatten\Adder139.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45871
  creating $alu cell for $flatten\Adder14.$verific$add_4$ucsb_152_tap_fir.v:2172$45338: $auto$alumacc.cc:485:replace_alu$45874
  creating $alu cell for $flatten\Adder140.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45877
  creating $alu cell for $flatten\Adder141.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45880
  creating $alu cell for $flatten\Adder142.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45883
  creating $alu cell for $flatten\Adder143.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45886
  creating $alu cell for $flatten\Adder144.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45889
  creating $alu cell for $flatten\Adder145.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45892
  creating $alu cell for $flatten\Adder146.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45895
  creating $alu cell for $flatten\Adder147.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45898
  creating $alu cell for $flatten\Adder148.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45901
  creating $alu cell for $flatten\Adder149.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45904
  creating $alu cell for $flatten\Adder15.$verific$add_4$ucsb_152_tap_fir.v:2088$45358: $auto$alumacc.cc:485:replace_alu$45907
  creating $alu cell for $flatten\Adder150.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45910
  creating $alu cell for $flatten\Adder151.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45913
  creating $alu cell for $flatten\Adder152.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45916
  creating $alu cell for $flatten\Adder153.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45919
  creating $alu cell for $flatten\Adder154.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45922
  creating $alu cell for $flatten\Adder155.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45925
  creating $alu cell for $flatten\Adder156.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45928
  creating $alu cell for $flatten\Adder157.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45931
  creating $alu cell for $flatten\Adder158.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45934
  creating $alu cell for $flatten\Adder159.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45937
  creating $alu cell for $flatten\Adder16.$verific$add_4$ucsb_152_tap_fir.v:2116$45378: $auto$alumacc.cc:485:replace_alu$45940
  creating $alu cell for $flatten\Adder160.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45943
  creating $alu cell for $flatten\Adder161.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45946
  creating $alu cell for $flatten\Adder162.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45949
  creating $alu cell for $flatten\Adder163.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45952
  creating $alu cell for $flatten\Adder164.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45955
  creating $alu cell for $flatten\Adder165.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45958
  creating $alu cell for $flatten\Adder166.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45961
  creating $alu cell for $flatten\Adder167.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45964
  creating $alu cell for $flatten\Adder168.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45967
  creating $alu cell for $flatten\Adder169.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45970
  creating $alu cell for $flatten\Adder17.$verific$add_4$ucsb_152_tap_fir.v:2116$45378: $auto$alumacc.cc:485:replace_alu$45973
  creating $alu cell for $flatten\Adder170.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45976
  creating $alu cell for $flatten\Adder171.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45979
  creating $alu cell for $flatten\Adder172.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45982
  creating $alu cell for $flatten\Adder173.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45985
  creating $alu cell for $flatten\Adder174.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45988
  creating $alu cell for $flatten\Adder175.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45991
  creating $alu cell for $flatten\Adder176.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45994
  creating $alu cell for $flatten\Adder177.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$45997
  creating $alu cell for $flatten\Adder178.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46000
  creating $alu cell for $flatten\Adder179.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46003
  creating $alu cell for $flatten\Adder180.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46006
  creating $alu cell for $flatten\Adder181.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46009
  creating $alu cell for $flatten\Adder182.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46012
  creating $alu cell for $flatten\Adder183.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46015
  creating $alu cell for $flatten\Adder184.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46018
  creating $alu cell for $flatten\Adder185.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46021
  creating $alu cell for $flatten\Adder186.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46024
  creating $alu cell for $flatten\Adder187.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46027
  creating $alu cell for $flatten\Adder188.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46030
  creating $alu cell for $flatten\Adder19.$verific$add_4$ucsb_152_tap_fir.v:2186$45348: $auto$alumacc.cc:485:replace_alu$46033
  creating $alu cell for $flatten\Adder2.$verific$add_4$ucsb_152_tap_fir.v:2116$45378: $auto$alumacc.cc:485:replace_alu$46036
  creating $alu cell for $flatten\Adder20.$verific$add_4$ucsb_152_tap_fir.v:2172$45338: $auto$alumacc.cc:485:replace_alu$46039
  creating $alu cell for $flatten\Adder22.$verific$add_4$ucsb_152_tap_fir.v:2186$45348: $auto$alumacc.cc:485:replace_alu$46042
  creating $alu cell for $flatten\Adder23.$verific$add_4$ucsb_152_tap_fir.v:2116$45378: $auto$alumacc.cc:485:replace_alu$46045
  creating $alu cell for $flatten\Adder24.$verific$add_4$ucsb_152_tap_fir.v:2186$45348: $auto$alumacc.cc:485:replace_alu$46048
  creating $alu cell for $flatten\Adder25.$verific$add_4$ucsb_152_tap_fir.v:2102$45368: $auto$alumacc.cc:485:replace_alu$46051
  creating $alu cell for $flatten\Adder26.$verific$add_4$ucsb_152_tap_fir.v:2186$45348: $auto$alumacc.cc:485:replace_alu$46054
  creating $alu cell for $flatten\Adder27.$verific$add_4$ucsb_152_tap_fir.v:2158$45388: $auto$alumacc.cc:485:replace_alu$46057
  creating $alu cell for $flatten\Adder28.$verific$add_4$ucsb_152_tap_fir.v:2088$45358: $auto$alumacc.cc:485:replace_alu$46060
  creating $alu cell for $flatten\Adder29.$verific$add_4$ucsb_152_tap_fir.v:2102$45368: $auto$alumacc.cc:485:replace_alu$46063
  creating $alu cell for $flatten\Adder3.$verific$add_4$ucsb_152_tap_fir.v:2130$45318: $auto$alumacc.cc:485:replace_alu$46066
  creating $alu cell for $flatten\Adder30.$verific$add_4$ucsb_152_tap_fir.v:2158$45388: $auto$alumacc.cc:485:replace_alu$46069
  creating $alu cell for $flatten\Adder31.$verific$add_4$ucsb_152_tap_fir.v:2158$45388: $auto$alumacc.cc:485:replace_alu$46072
  creating $alu cell for $flatten\Adder32.$verific$add_4$ucsb_152_tap_fir.v:2116$45378: $auto$alumacc.cc:485:replace_alu$46075
  creating $alu cell for $flatten\Adder33.$verific$add_4$ucsb_152_tap_fir.v:2102$45368: $auto$alumacc.cc:485:replace_alu$46078
  creating $alu cell for $flatten\Adder39.$verific$add_4$ucsb_152_tap_fir.v:2228$45398: $auto$alumacc.cc:485:replace_alu$46081
  creating $alu cell for $flatten\Adder4.$verific$add_4$ucsb_152_tap_fir.v:2116$45378: $auto$alumacc.cc:485:replace_alu$46084
  creating $alu cell for $flatten\Adder40.$verific$add_4$ucsb_152_tap_fir.v:2242$45408: $auto$alumacc.cc:485:replace_alu$46087
  creating $alu cell for $flatten\Adder41.$verific$add_4$ucsb_152_tap_fir.v:2256$45418: $auto$alumacc.cc:485:replace_alu$46090
  creating $alu cell for $flatten\Adder42.$verific$add_4$ucsb_152_tap_fir.v:2270$45428: $auto$alumacc.cc:485:replace_alu$46093
  creating $alu cell for $flatten\Adder43.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46096
  creating $alu cell for $flatten\Adder44.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46099
  creating $alu cell for $flatten\Adder45.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46102
  creating $alu cell for $flatten\Adder46.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46105
  creating $alu cell for $flatten\Adder47.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46108
  creating $alu cell for $flatten\Adder48.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46111
  creating $alu cell for $flatten\Adder49.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46114
  creating $alu cell for $flatten\Adder50.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46117
  creating $alu cell for $flatten\Adder51.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46120
  creating $alu cell for $flatten\Adder52.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46123
  creating $alu cell for $flatten\Adder53.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46126
  creating $alu cell for $flatten\Adder54.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46129
  creating $alu cell for $flatten\Adder55.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46132
  creating $alu cell for $flatten\Adder56.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46135
  creating $alu cell for $flatten\Adder57.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46138
  creating $alu cell for $flatten\Adder58.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46141
  creating $alu cell for $flatten\Adder59.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46144
  creating $alu cell for $flatten\Adder60.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46147
  creating $alu cell for $flatten\Adder61.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46150
  creating $alu cell for $flatten\Adder62.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46153
  creating $alu cell for $flatten\Adder63.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46156
  creating $alu cell for $flatten\Adder64.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46159
  creating $alu cell for $flatten\Adder65.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46162
  creating $alu cell for $flatten\Adder66.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46165
  creating $alu cell for $flatten\Adder67.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46168
  creating $alu cell for $flatten\Adder68.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46171
  creating $alu cell for $flatten\Adder69.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46174
  creating $alu cell for $flatten\Adder7.$verific$add_4$ucsb_152_tap_fir.v:2102$45368: $auto$alumacc.cc:485:replace_alu$46177
  creating $alu cell for $flatten\Adder70.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46180
  creating $alu cell for $flatten\Adder71.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46183
  creating $alu cell for $flatten\Adder72.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46186
  creating $alu cell for $flatten\Adder73.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46189
  creating $alu cell for $flatten\Adder74.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46192
  creating $alu cell for $flatten\Adder75.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46195
  creating $alu cell for $flatten\Adder76.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46198
  creating $alu cell for $flatten\Adder77.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46201
  creating $alu cell for $flatten\Adder78.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46204
  creating $alu cell for $flatten\Adder79.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46207
  creating $alu cell for $flatten\Adder80.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46210
  creating $alu cell for $flatten\Adder81.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46213
  creating $alu cell for $flatten\Adder82.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46216
  creating $alu cell for $flatten\Adder83.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46219
  creating $alu cell for $flatten\Adder84.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46222
  creating $alu cell for $flatten\Adder85.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46225
  creating $alu cell for $flatten\Adder86.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46228
  creating $alu cell for $flatten\Adder87.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46231
  creating $alu cell for $flatten\Adder88.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46234
  creating $alu cell for $flatten\Adder89.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46237
  creating $alu cell for $flatten\Adder9.$verific$add_4$ucsb_152_tap_fir.v:2088$45358: $auto$alumacc.cc:485:replace_alu$46240
  creating $alu cell for $flatten\Adder90.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46243
  creating $alu cell for $flatten\Adder91.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46246
  creating $alu cell for $flatten\Adder92.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46249
  creating $alu cell for $flatten\Adder93.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46252
  creating $alu cell for $flatten\Adder94.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46255
  creating $alu cell for $flatten\Adder95.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46258
  creating $alu cell for $flatten\Adder96.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46261
  creating $alu cell for $flatten\Adder97.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46264
  creating $alu cell for $flatten\Adder98.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46267
  creating $alu cell for $flatten\Adder99.$verific$add_4$ucsb_152_tap_fir.v:2284$45437: $auto$alumacc.cc:485:replace_alu$46270
  creating $alu cell for $flatten\Neg0.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482: $auto$alumacc.cc:485:replace_alu$46273
  creating $alu cell for $flatten\Neg1.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482: $auto$alumacc.cc:485:replace_alu$46276
  creating $alu cell for $flatten\Neg10.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464: $auto$alumacc.cc:485:replace_alu$46279
  creating $alu cell for $flatten\Neg11.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464: $auto$alumacc.cc:485:replace_alu$46282
  creating $alu cell for $flatten\Neg12.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464: $auto$alumacc.cc:485:replace_alu$46285
  creating $alu cell for $flatten\Neg13.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464: $auto$alumacc.cc:485:replace_alu$46288
  creating $alu cell for $flatten\Neg14.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482: $auto$alumacc.cc:485:replace_alu$46291
  creating $alu cell for $flatten\Neg15.$verific$unary_minus_4$ucsb_152_tap_fir.v:2654$45464: $auto$alumacc.cc:485:replace_alu$46294
  creating $alu cell for $flatten\Neg16.$verific$unary_minus_4$ucsb_152_tap_fir.v:2693$45500: $auto$alumacc.cc:485:replace_alu$46297
  creating $alu cell for $flatten\Neg17.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455: $auto$alumacc.cc:485:replace_alu$46300
  creating $alu cell for $flatten\Neg18.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491: $auto$alumacc.cc:485:replace_alu$46303
  creating $alu cell for $flatten\Neg19.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482: $auto$alumacc.cc:485:replace_alu$46306
  creating $alu cell for $flatten\Neg2.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482: $auto$alumacc.cc:485:replace_alu$46309
  creating $alu cell for $flatten\Neg3.$verific$unary_minus_4$ucsb_152_tap_fir.v:2628$45482: $auto$alumacc.cc:485:replace_alu$46312
  creating $alu cell for $flatten\Neg4.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455: $auto$alumacc.cc:485:replace_alu$46315
  creating $alu cell for $flatten\Neg5.$verific$unary_minus_4$ucsb_152_tap_fir.v:2680$45473: $auto$alumacc.cc:485:replace_alu$46318
  creating $alu cell for $flatten\Neg6.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491: $auto$alumacc.cc:485:replace_alu$46321
  creating $alu cell for $flatten\Neg7.$verific$unary_minus_4$ucsb_152_tap_fir.v:2667$45455: $auto$alumacc.cc:485:replace_alu$46324
  creating $alu cell for $flatten\Neg8.$verific$unary_minus_4$ucsb_152_tap_fir.v:2641$45491: $auto$alumacc.cc:485:replace_alu$46327
  creating $alu cell for $flatten\Neg9.$verific$unary_minus_4$ucsb_152_tap_fir.v:2706$45446: $auto$alumacc.cc:485:replace_alu$46330
  creating $alu cell for $flatten\Sub0.$verific$sub_4$ucsb_152_tap_fir.v:2299$45607: $auto$alumacc.cc:485:replace_alu$46333
  creating $alu cell for $flatten\Sub1.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634: $auto$alumacc.cc:485:replace_alu$46336
  creating $alu cell for $flatten\Adder8.$verific$add_4$ucsb_152_tap_fir.v:2172$45338: $auto$alumacc.cc:485:replace_alu$46339
  creating $alu cell for $flatten\Sub10.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652: $auto$alumacc.cc:485:replace_alu$46342
  creating $alu cell for $flatten\Sub11.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661: $auto$alumacc.cc:485:replace_alu$46345
  creating $alu cell for $flatten\Sub12.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46348
  creating $alu cell for $flatten\Sub13.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652: $auto$alumacc.cc:485:replace_alu$46351
  creating $alu cell for $flatten\Sub14.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697: $auto$alumacc.cc:485:replace_alu$46354
  creating $alu cell for $flatten\Sub15.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634: $auto$alumacc.cc:485:replace_alu$46357
  creating $alu cell for $flatten\Sub16.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46360
  creating $alu cell for $flatten\Sub17.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652: $auto$alumacc.cc:485:replace_alu$46363
  creating $alu cell for $flatten\Sub18.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697: $auto$alumacc.cc:485:replace_alu$46366
  creating $alu cell for $flatten\Sub19.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46369
  creating $alu cell for $flatten\Sub2.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46372
  creating $alu cell for $flatten\Sub20.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46375
  creating $alu cell for $flatten\Sub21.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661: $auto$alumacc.cc:485:replace_alu$46378
  creating $alu cell for $flatten\Sub22.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46381
  creating $alu cell for $flatten\Sub23.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46384
  creating $alu cell for $flatten\Sub24.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688: $auto$alumacc.cc:485:replace_alu$46387
  creating $alu cell for $flatten\Sub25.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697: $auto$alumacc.cc:485:replace_alu$46390
  creating $alu cell for $flatten\Sub26.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46393
  creating $alu cell for $flatten\Sub27.$verific$sub_4$ucsb_152_tap_fir.v:2403$45661: $auto$alumacc.cc:485:replace_alu$46396
  creating $alu cell for $flatten\Sub28.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652: $auto$alumacc.cc:485:replace_alu$46399
  creating $alu cell for $flatten\Adder21.$verific$add_4$ucsb_152_tap_fir.v:2088$45358: $auto$alumacc.cc:485:replace_alu$46402
  creating $alu cell for $flatten\Sub29.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46405
  creating $alu cell for $flatten\Adder1.$verific$add_4$ucsb_152_tap_fir.v:2102$45368: $auto$alumacc.cc:485:replace_alu$46408
  creating $alu cell for $flatten\Sub3.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46411
  creating $alu cell for $flatten\Sub30.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46414
  creating $alu cell for $flatten\Sub31.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688: $auto$alumacc.cc:485:replace_alu$46417
  creating $alu cell for $flatten\Sub32.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688: $auto$alumacc.cc:485:replace_alu$46420
  creating $alu cell for $flatten\Adder18.$verific$add_4$ucsb_152_tap_fir.v:2214$45308: $auto$alumacc.cc:485:replace_alu$46423
  creating $alu cell for $flatten\Sub33.$verific$sub_4$ucsb_152_tap_fir.v:2416$45616: $auto$alumacc.cc:485:replace_alu$46426
  creating $alu cell for $flatten\Sub34.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652: $auto$alumacc.cc:485:replace_alu$46429
  creating $alu cell for $flatten\Sub35.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46432
  creating $alu cell for $flatten\Sub36.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697: $auto$alumacc.cc:485:replace_alu$46435
  creating $alu cell for $flatten\Sub37.$verific$sub_4$ucsb_152_tap_fir.v:2429$45625: $auto$alumacc.cc:485:replace_alu$46438
  creating $alu cell for $flatten\Sub38.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46441
  creating $alu cell for $flatten\Sub39.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652: $auto$alumacc.cc:485:replace_alu$46444
  creating $alu cell for $flatten\Sub4.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46447
  creating $alu cell for $flatten\Sub40.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46450
  creating $alu cell for $flatten\Sub41.$verific$sub_4$ucsb_152_tap_fir.v:2377$45688: $auto$alumacc.cc:485:replace_alu$46453
  creating $alu cell for $flatten\Sub42.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46456
  creating $alu cell for $flatten\Sub43.$verific$sub_4$ucsb_152_tap_fir.v:2364$45652: $auto$alumacc.cc:485:replace_alu$46459
  creating $alu cell for $flatten\Adder34.$verific$add_4$ucsb_152_tap_fir.v:2088$45358: $auto$alumacc.cc:485:replace_alu$46462
  creating $alu cell for $flatten\Sub44.$verific$sub_4$ucsb_152_tap_fir.v:2351$45670: $auto$alumacc.cc:485:replace_alu$46465
  creating $alu cell for $flatten\Sub5.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46468
  creating $alu cell for $flatten\Sub6.$verific$sub_4$ucsb_152_tap_fir.v:2338$45697: $auto$alumacc.cc:485:replace_alu$46471
  creating $alu cell for $flatten\Adder6.$verific$add_4$ucsb_152_tap_fir.v:2102$45368: $auto$alumacc.cc:485:replace_alu$46474
  creating $alu cell for $flatten\Sub7.$verific$sub_4$ucsb_152_tap_fir.v:2325$45679: $auto$alumacc.cc:485:replace_alu$46477
  creating $alu cell for $flatten\Adder5.$verific$add_4$ucsb_152_tap_fir.v:2144$45328: $auto$alumacc.cc:485:replace_alu$46480
  creating $alu cell for $flatten\Sub8.$verific$sub_4$ucsb_152_tap_fir.v:2390$45643: $auto$alumacc.cc:485:replace_alu$46483
  creating $alu cell for $flatten\Sub9.$verific$sub_4$ucsb_152_tap_fir.v:2312$45634: $auto$alumacc.cc:485:replace_alu$46486
  created 250 $alu and 0 $macc cells.

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_merge -nomux

3.42. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.43. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.46. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.47. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 1

yosys> stat

3.50. Printing statistics.

=== ucsb_152_tap_fir ===

   Number of wires:               4143
   Number of wire bits:          84098
   Number of public wires:        3393
   Number of public wire bits:   64553
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                827
     $alu                          250
     $dff                          577


yosys> memory -nomap

3.51. Executing MEMORY pass.

yosys> opt_mem

3.51.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.51.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.51.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.51.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.51.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.51.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> memory_share

3.51.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.51.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.51.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> memory_collect

3.51.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.52. Printing statistics.

=== ucsb_152_tap_fir ===

   Number of wires:               4143
   Number of wire bits:          84098
   Number of public wires:        3393
   Number of public wire bits:   64553
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                827
     $alu                          250
     $dff                          577


yosys> muxpack

3.53. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> pmuxtree

3.55. Executing PMUXTREE pass.

yosys> muxpack

3.56. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> memory_map

3.57. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.58. Printing statistics.

=== ucsb_152_tap_fir ===

   Number of wires:               4143
   Number of wire bits:          84098
   Number of public wires:        3393
   Number of public wire bits:   64553
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                827
     $alu                          250
     $dff                          577


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.59. Executing TECHMAP pass (map to technology primitives).

3.59.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.59.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.59.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $dff.
Using template $paramod$4ce4a1faeffe5690bb1819c6520eb4b4e75ebebd\_90_alu for cells of type $alu.
Using template $paramod$afde0246d300ce8686bf304a857c881891cb118b\_90_alu for cells of type $alu.
Using template $paramod$5bf5b6baad103a9d0abfeb265eea5e70beb7f3d1\_90_alu for cells of type $alu.
Using template $paramod$a7a1d5fc4563c49b9a54941942b1beedd64a98db\_90_alu for cells of type $alu.
Using template $paramod$350a16b50f723fdde288977a0c5fcdd3e8b66dcf\_90_alu for cells of type $alu.
Using template $paramod$aac77111ec976962096d49169906492758c7e4cd\_90_alu for cells of type $alu.
Using template $paramod$54f0c9cd51aeed2c4826b930481806ecdd6ae5b0\_90_alu for cells of type $alu.
Using template $paramod$081ba1a4a7201ecdb44563d3c3bd7013d1ebf4eb\_90_alu for cells of type $alu.
Using template $paramod$ece0460f5cc8016af662a0ffa795881740e488ff\_90_alu for cells of type $alu.
Using template $paramod$a7926d38756e33b5022e02ebfd484599309272c7\_90_alu for cells of type $alu.
Using template $paramod$b6ce0c8955977b221a89650d58ba8da4bf595cb5\_90_alu for cells of type $alu.
Using template $paramod$aa43f2dbffadf36a7e9a5a6a61a7417f2989191d\_90_alu for cells of type $alu.
Using template $paramod$aa79f08a9b2ecafced19428b8029eec0afdb6a1e\_80_rs_alu for cells of type $alu.
Using template $paramod$3e19ada69a9e411fcc5aa738850a92bb40610310\_80_rs_alu for cells of type $alu.
Using template $paramod$10db1bc54e2d15c66fff3e549d67309dd2facbfb\_80_rs_alu for cells of type $alu.
Using template $paramod$8e2417abf902dc270e6b9d4fe38ffb7930d0ce51\_80_rs_alu for cells of type $alu.
Using template $paramod$abcf52131b10ed7b724573e192891ae0893d14a0\_80_rs_alu for cells of type $alu.
Using template $paramod$936d9ad87e18e0497f1edc8dd79d39671cff9ad7\_80_rs_alu for cells of type $alu.
Using template $paramod$88ebedc0964674c5b2e447c66b33a42fc7e7abe0\_90_alu for cells of type $alu.
Using template $paramod$baed74508ba7948f6a7ac7f19ad907f08135b192\_80_rs_alu for cells of type $alu.
Using template $paramod$48d45e1de23846801b39d47d83c68c21dc405d0a\_80_rs_alu for cells of type $alu.
Using template $paramod$60c7301d06eee6f37e38a45728545a7c8da04512\_90_alu for cells of type $alu.
Using template $paramod$6f3d9ed33ebed64b9db31476d98bc097d6866eed\_80_rs_alu for cells of type $alu.
Using template $paramod$ec4cd333bc5ed64421f9ad2d4ba45c0659044a6d\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010101 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011101 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010011 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011000 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011100 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000011010 for cells of type $lcu.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~25387 debug messages>

yosys> stat

3.60. Printing statistics.

=== ucsb_152_tap_fir ===

   Number of wires:              22344
   Number of wire bits:         377734
   Number of public wires:        3393
   Number of public wire bits:   64553
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              61348
     $_AND_                      13382
     $_DFF_P_                    14683
     $_MUX_                       6703
     $_NOT_                       6515
     $_OR_                        6691
     $_XOR_                      10779
     adder_carry                  2595


yosys> opt_expr

3.61. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
<suppressed ~11703 debug messages>

yosys> opt_merge -nomux

3.62. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
<suppressed ~17619 debug messages>
Removed a total of 5873 cells.

yosys> opt_muxtree

3.63. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.64. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.65. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.66. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.67. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 2035 unused cells and 7936 unused wires.
<suppressed ~2036 debug messages>

yosys> opt_expr

3.69. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
<suppressed ~13 debug messages>

yosys> opt_muxtree

3.70. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.71. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.72. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.73. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.74. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.75. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 3

yosys> opt_expr -full

3.84. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> techmap -map +/techmap.v

3.85. Executing TECHMAP pass (map to technology primitives).

3.85.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.85.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.86. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_merge -nomux

3.87. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.88. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.89. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 1

yosys> abc -dff

3.94. Executing ABC pass (technology mapping using ABC).

3.94.1. Summary of detected clock domains:
  42052 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.94.2. Extracting gate netlist of module `\ucsb_152_tap_fir' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 39457 gates and 41971 wires to a netlist network with 2513 inputs and 4404 outputs.

3.94.2.1. Executing ABC.

yosys> abc -dff

3.95. Executing ABC pass (technology mapping using ABC).

3.95.1. Summary of detected clock domains:
  32125 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.95.2. Extracting gate netlist of module `\ucsb_152_tap_fir' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 29530 gates and 32043 wires to a netlist network with 2513 inputs and 4404 outputs.

3.95.2.1. Executing ABC.

yosys> abc -dff

3.96. Executing ABC pass (technology mapping using ABC).

3.96.1. Summary of detected clock domains:
  32116 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.96.2. Extracting gate netlist of module `\ucsb_152_tap_fir' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 29521 gates and 32034 wires to a netlist network with 2513 inputs and 4404 outputs.

3.96.2.1. Executing ABC.

yosys> abc -dff

3.97. Executing ABC pass (technology mapping using ABC).

3.97.1. Summary of detected clock domains:
  32119 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.97.2. Extracting gate netlist of module `\ucsb_152_tap_fir' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 29524 gates and 32037 wires to a netlist network with 2513 inputs and 4404 outputs.

3.97.2.1. Executing ABC.

yosys> opt_ffinv

3.98. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 14 inverters.

yosys> opt_expr

3.99. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
<suppressed ~2 debug messages>

yosys> opt_merge -nomux

3.100. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_muxtree

3.101. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.102. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.103. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.104. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.105. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 14 unused cells and 154628 unused wires.
<suppressed ~1363 debug messages>

yosys> opt_expr

3.107. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 2

yosys> bmuxmap

3.115. Executing BMUXMAP pass.

yosys> demuxmap

3.116. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_yFBFPO/abc_tmp_1.scr

3.117. Executing ABC pass (technology mapping using ABC).

3.117.1. Extracting gate netlist of module `\ucsb_152_tap_fir' to `<abc-temp-dir>/input.blif'..
Extracted 19082 gates and 24343 wires to a netlist network with 5261 inputs and 4941 outputs.

3.117.1.1. Executing ABC.
DE:   #PIs = 5261  #Luts =  7554  Max Lvl =  12  Avg Lvl =   3.98  [   0.39 sec. at Pass 0]{firstMap}
DE:   #PIs = 5261  #Luts =  7331  Max Lvl =  24  Avg Lvl =   5.60  [  46.24 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 5261  #Luts =  7002  Max Lvl =  25  Avg Lvl =   5.04  [   7.32 sec. at Pass 2]{map}
DE:   #PIs = 5261  #Luts =  7002  Max Lvl =  25  Avg Lvl =   5.04  [  14.56 sec. at Pass 3]{postMap}
DE:   #PIs = 5261  #Luts =  6954  Max Lvl =  25  Avg Lvl =   4.99  [  10.38 sec. at Pass 4]{map}
DE:   #PIs = 5261  #Luts =  6946  Max Lvl =  23  Avg Lvl =   4.98  [  18.02 sec. at Pass 5]{postMap}
DE:   #PIs = 5261  #Luts =  6926  Max Lvl =  25  Avg Lvl =   4.97  [  11.16 sec. at Pass 6]{map}
DE:   #PIs = 5261  #Luts =  6920  Max Lvl =  23  Avg Lvl =   4.95  [  17.52 sec. at Pass 7]{postMap}
DE:   #PIs = 5261  #Luts =  6902  Max Lvl =  23  Avg Lvl =   4.91  [  12.25 sec. at Pass 8]{map}
DE:   #PIs = 5261  #Luts =  6902  Max Lvl =  23  Avg Lvl =   4.91  [  22.77 sec. at Pass 9]{postMap}
DE:   #PIs = 5261  #Luts =  6902  Max Lvl =  23  Avg Lvl =   4.91  [   3.25 sec. at Pass 10]{finalMap}

yosys> opt_expr

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_merge -nomux

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.120. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.121. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.122. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.123. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.124. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.125. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 0 unused cells and 24343 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.127. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 146 inverters.

yosys> stat

3.128. Printing statistics.

=== ucsb_152_tap_fir ===

   Number of wires:              15318
   Number of wire bits:          51371
   Number of public wires:        2045
   Number of public wire bits:   30501
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              19889
     $_DFF_P_                    10392
     $lut                         6902
     adder_carry                  2595


yosys> shregmap -minlen 8 -maxlen 20

3.129. Executing SHREGMAP pass (map shift registers).
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$226508 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229857 to a shift register with depth 10.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$226820 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229819 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$226821 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229859 to a shift register with depth 14.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$227333 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229833 to a shift register with depth 14.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$227334 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229822 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$227637 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229837 to a shift register with depth 10.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$227722 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229824 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$227760 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229839 to a shift register with depth 20.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$227788 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229826 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$234553 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229868 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$234798 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229865 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$235090 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229845 to a shift register with depth 16.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$235516 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229870 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$235517 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229872 to a shift register with depth 8.
Converting ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$235518 ... ucsb_152_tap_fir.$abc$226149$auto$blifparse.cc:362:parse_blif$229874 to a shift register with depth 8.
Converted 156 dff cells into 15 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.130. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.131. Printing statistics.

=== ucsb_152_tap_fir ===

   Number of wires:              15319
   Number of wire bits:          51372
   Number of public wires:        2045
   Number of public wire bits:   30501
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              19748
     $_DFF_P_                    10236
     $__SHREG_DFF_P_                15
     $lut                         6902
     adder_carry                  2595


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.132. Executing TECHMAP pass (map to technology primitives).

3.132.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.132.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.132.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000001000 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010000 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000010100 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000001010 for cells of type $__SHREG_DFF_P_.
Using template $paramod\$__SHREG_DFF_P_\DEPTH=32'00000000000000000000000000001110 for cells of type $__SHREG_DFF_P_.
No more expansions possible.
<suppressed ~17344 debug messages>

yosys> opt_expr -mux_undef

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
<suppressed ~74857 debug messages>

yosys> simplemap

3.134. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.135. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
<suppressed ~105870 debug messages>
Removed a total of 35290 cells.

yosys> opt_dff -nodffe -nosdff

3.137. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.138. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 146 unused cells and 42478 unused wires.
<suppressed ~147 debug messages>

yosys> opt_expr

3.139. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
<suppressed ~664 debug messages>

yosys> opt_merge -nomux

3.140. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
<suppressed ~42 debug messages>
Removed a total of 14 cells.

yosys> opt_muxtree

3.141. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.142. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.144. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 0 unused cells and 42 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_yFBFPO/abc_tmp_2.scr

3.148. Executing ABC pass (technology mapping using ABC).

3.148.1. Extracting gate netlist of module `\ucsb_152_tap_fir' to `<abc-temp-dir>/input.blif'..
Extracted 37721 gates and 42846 wires to a netlist network with 5123 inputs and 4795 outputs.

3.148.1.1. Executing ABC.
DE:   #PIs = 5123  #Luts =  6755  Max Lvl =  21  Avg Lvl =   4.74  [   1.13 sec. at Pass 0]{firstMap}
DE:   #PIs = 5123  #Luts =  6755  Max Lvl =  21  Avg Lvl =   4.74  [  70.44 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 5123  #Luts =  6755  Max Lvl =  21  Avg Lvl =   4.74  [  11.73 sec. at Pass 2]{map}
DE:   #PIs = 5123  #Luts =  6755  Max Lvl =  21  Avg Lvl =   4.74  [  17.31 sec. at Pass 3]{postMap}
DE:   #PIs = 5123  #Luts =  6745  Max Lvl =  22  Avg Lvl =   5.05  [  15.35 sec. at Pass 4]{map}
DE:   #PIs = 5123  #Luts =  6745  Max Lvl =  22  Avg Lvl =   5.05  [  26.69 sec. at Pass 5]{postMap}
DE:   #PIs = 5123  #Luts =  6745  Max Lvl =  22  Avg Lvl =   5.05  [  19.24 sec. at Pass 6]{map}
DE:   #PIs = 5123  #Luts =  6745  Max Lvl =  22  Avg Lvl =   5.05  [  28.40 sec. at Pass 7]{postMap}
DE:   #PIs = 5123  #Luts =  6745  Max Lvl =  22  Avg Lvl =   5.05  [   4.37 sec. at Pass 8]{finalMap}

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.

yosys> opt_merge -nomux

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.151. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \ucsb_152_tap_fir..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.152. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \ucsb_152_tap_fir.
Performed a total of 0 changes.

yosys> opt_merge

3.153. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\ucsb_152_tap_fir'.
Removed a total of 0 cells.

yosys> opt_share

3.154. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.155. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.156. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 0 unused cells and 26318 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.157. Executing OPT_EXPR pass (perform const folding).
Optimizing module ucsb_152_tap_fir.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.158. Executing HIERARCHY pass (managing design hierarchy).

3.158.1. Analyzing design hierarchy..
Top module:  \ucsb_152_tap_fir

3.158.2. Analyzing design hierarchy..
Top module:  \ucsb_152_tap_fir
Removed 0 unused modules.

yosys> stat

3.159. Printing statistics.

=== ucsb_152_tap_fir ===

   Number of wires:              15035
   Number of wire bits:          51214
   Number of public wires:        2045
   Number of public wire bits:   30501
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              19732
     $lut                         6745
     adder_carry                  2595
     dffsre                      10236
     sh_dff                        156


yosys> opt_clean -purge

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \ucsb_152_tap_fir..
Removed 0 unused cells and 1967 unused wires.
<suppressed ~1967 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.161. Executing Verilog backend.
Dumping module `\ucsb_152_tap_fir'.

End of script. Logfile hash: 9918688d79, CPU: user 150.76s system 0.59s, MEM: 427.66 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 93% 6x abc (2144 sec), 1% 54x opt_expr (43 sec), ...
real 568.02
user 2148.36
sys 133.41
