
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k Log2highacc.v

yosys> verific -vlog2k Log2highacc.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'Log2highacc.v'

yosys> synth_rs -top Log2highacc -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top Log2highacc

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] Log2highacc.v:1: compiling module 'Log2highacc'
Importing module Log2highacc.

3.4.1. Analyzing design hierarchy..
Top module:  \Log2highacc

3.4.2. Analyzing design hierarchy..
Top module:  \Log2highacc
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
<suppressed ~2 debug messages>

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 89 unused wires.
<suppressed ~8 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module Log2highacc...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
    New ctrl vector for $pmux cell $verific$select_65$Log2highacc.v:80$197: { \DIN [23] $verific$n246$5 $verific$n248$7 $verific$n250$9 $verific$n252$11 $verific$n254$13 $verific$n256$15 $verific$n258$17 $verific$n260$19 $verific$n262$21 $verific$n264$23 $verific$n266$25 $verific$n268$27 $verific$n270$29 $verific$n272$31 }
  Optimizing cells in module \Log2highacc.
Performed a total of 1 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$priencout3_reg$Log2highacc.v:47$129 ($aldff) from module Log2highacc.
Removing never-active async load on $verific$priencout2_reg$Log2highacc.v:47$128 ($aldff) from module Log2highacc.
Removing never-active async load on $verific$priencout1_reg$Log2highacc.v:80$198 ($aldff) from module Log2highacc.
Removing never-active async load on $verific$barrelout_reg$Log2highacc.v:54$135 ($aldff) from module Log2highacc.
Removing never-active async load on $verific$barrelin_reg$Log2highacc.v:47$130 ($aldff) from module Log2highacc.
Removing never-active async load on $verific$LUTout_reg$Log2highacc.v:176$200 ($aldff) from module Log2highacc.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 2 unused cells and 2 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking Log2highacc.LUTout as FSM state register:
    Register is connected to module port.
    Users of register don't seem to benefit from recoding.
Not marking Log2highacc.priencout1 as FSM state register:
    Users of register don't seem to benefit from recoding.

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.42. Executing WREDUCE pass (reducing word size of cells).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$203 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$204 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$205 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$206 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$207 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$208 ($mux).
Removed top 1 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$209 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$210 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$211 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$212 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$213 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$214 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$215 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$217 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$218 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$219 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$220 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$221 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$222 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$223 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$224 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$225 ($mux).
Removed top 6 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$226 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$227 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$228 ($mux).
Removed top 6 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$229 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$230 ($mux).
Removed top 6 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$231 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$232 ($mux).
Removed top 6 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$233 ($mux).
Removed top 5 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$234 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$236 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$237 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$238 ($mux).
Removed top 1 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$239 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$240 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$241 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$243 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$244 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$245 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$246 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$247 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$248 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$249 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$250 ($mux).
Removed top 4 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$251 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$253 ($mux).
Removed top 1 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$254 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$255 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$257 ($mux).
Removed top 1 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$258 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$259 ($mux).
Removed top 3 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$260 ($mux).
Removed top 1 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$262 ($mux).
Removed top 1 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$264 ($mux).
Removed top 2 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$265 ($mux).
Removed top 1 bits (of 8) from mux cell Log2highacc.$auto$bmuxmap.cc:60:execute$268 ($mux).
Removed top 5 bits (of 256) from wire Log2highacc.$auto$bmuxmap.cc:58:execute$202.
Removed top 4 bits (of 128) from wire Log2highacc.$auto$bmuxmap.cc:58:execute$235.
Removed top 3 bits (of 64) from wire Log2highacc.$auto$bmuxmap.cc:58:execute$252.
Removed top 2 bits (of 32) from wire Log2highacc.$auto$bmuxmap.cc:58:execute$261.
Removed top 1 bits (of 16) from wire Log2highacc.$auto$bmuxmap.cc:58:execute$266.

yosys> peepopt

3.43. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.44. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 5 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.45. Executing BMUXMAP pass.

yosys> demuxmap

3.46. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.47. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module Log2highacc:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_merge -nomux

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_share

3.53. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> opt_expr

3.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_muxtree

3.57. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.58. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.59. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.60. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.61. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> opt_expr

3.63. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 2

yosys> stat

3.64. Printing statistics.

=== Log2highacc ===

   Number of wires:                 61
   Number of wire bits:            660
   Number of public wires:          11
   Number of public wire bits:     121
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                107
     $dff                            6
     $mux                           56
     $not                           29
     $pmux                           1
     $reduce_or                     14
     $shl                            1


yosys> memory -nomap

3.65. Executing MEMORY pass.

yosys> opt_mem

3.65.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.65.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.65.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.65.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.65.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.65.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> memory_share

3.65.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.65.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.65.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> memory_collect

3.65.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.66. Printing statistics.

=== Log2highacc ===

   Number of wires:                 61
   Number of wire bits:            660
   Number of public wires:          11
   Number of public wire bits:     121
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                107
     $dff                            6
     $mux                           56
     $not                           29
     $pmux                           1
     $reduce_or                     14
     $shl                            1


yosys> muxpack

3.67. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~54 debug messages>

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> pmuxtree

3.69. Executing PMUXTREE pass.

yosys> muxpack

3.70. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~62 debug messages>

yosys> memory_map

3.71. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.72. Printing statistics.

=== Log2highacc ===

   Number of wires:                 85
   Number of wire bits:            729
   Number of public wires:          11
   Number of public wire bits:     121
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                130
     $dff                            6
     $mux                           71
     $not                           30
     $or                             4
     $reduce_or                     18
     $shl                            1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.73. Executing TECHMAP pass (map to technology primitives).

3.73.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.73.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.73.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $not.
Using template $paramod$constmap:e97a204a8e3da804c8af3c57f868e12b7ac821c7$paramod$287778180084c1e324ab73ea54767ffc41fb54a3\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
No more expansions possible.
<suppressed ~466 debug messages>

yosys> stat

3.74. Printing statistics.

=== Log2highacc ===

   Number of wires:                148
   Number of wire bits:           3012
   Number of public wires:          11
   Number of public wire bits:     121
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                651
     $_DFF_P_                       47
     $_MUX_                        441
     $_NOT_                         33
     $_OR_                         130


yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
<suppressed ~228 debug messages>

yosys> opt_merge -nomux

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
<suppressed ~522 debug messages>
Removed a total of 174 cells.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 38 unused cells and 39 unused wires.
<suppressed ~39 debug messages>

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
<suppressed ~4 debug messages>

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
<suppressed ~33 debug messages>

yosys> techmap -map +/techmap.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_merge -nomux

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.98. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 1

yosys> abc -dff

3.101. Executing ABC pass (technology mapping using ABC).

3.101.1. Summary of detected clock domains:
  319 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.101.2. Extracting gate netlist of module `\Log2highacc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 319 gates and 343 wires to a netlist network with 22 inputs and 12 outputs.

3.101.2.1. Executing ABC.

yosys> abc -dff

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Summary of detected clock domains:
  276 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.102.2. Extracting gate netlist of module `\Log2highacc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 276 gates and 298 wires to a netlist network with 22 inputs and 12 outputs.

3.102.2.1. Executing ABC.

yosys> abc -dff

3.103. Executing ABC pass (technology mapping using ABC).

3.103.1. Summary of detected clock domains:
  289 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.103.2. Extracting gate netlist of module `\Log2highacc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 289 gates and 311 wires to a netlist network with 22 inputs and 12 outputs.

3.103.2.1. Executing ABC.

yosys> abc -dff

3.104. Executing ABC pass (technology mapping using ABC).

3.104.1. Summary of detected clock domains:
  286 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.104.2. Extracting gate netlist of module `\Log2highacc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 286 gates and 308 wires to a netlist network with 22 inputs and 12 outputs.

3.104.2.1. Executing ABC.

yosys> opt_ffinv

3.105. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 1149 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.115. Executing BMUXMAP pass.

yosys> demuxmap

3.116. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_ROQQjM/abc_tmp_1.scr

3.117. Executing ABC pass (technology mapping using ABC).

3.117.1. Extracting gate netlist of module `\Log2highacc' to `<abc-temp-dir>/input.blif'..
Extracted 262 gates and 290 wires to a netlist network with 28 inputs and 18 outputs.

3.117.1.1. Executing ABC.
DE:   #PIs =  28  #Luts =    61  Max Lvl =   5  Avg Lvl =   2.67  [   0.16 sec. at Pass 0]{firstMap}
DE:   #PIs =  28  #Luts =    43  Max Lvl =   7  Avg Lvl =   3.33  [   1.05 sec. at Pass 1]{initMapFlow}
DE:   #PIs =  28  #Luts =    42  Max Lvl =   7  Avg Lvl =   3.28  [   0.46 sec. at Pass 2]{map}
DE:   #PIs =  28  #Luts =    41  Max Lvl =   6  Avg Lvl =   2.94  [   0.75 sec. at Pass 3]{postMap}
DE:   #PIs =  28  #Luts =    41  Max Lvl =   6  Avg Lvl =   2.94  [   1.07 sec. at Pass 4]{map}
DE:   #PIs =  28  #Luts =    41  Max Lvl =   6  Avg Lvl =   2.94  [   2.49 sec. at Pass 5]{postMap}
DE:   #PIs =  28  #Luts =    41  Max Lvl =   6  Avg Lvl =   2.94  [   2.53 sec. at Pass 6]{map}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [  12.12 sec. at Pass 7]{pushMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   3.05 sec. at Pass 8]{postMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   2.32 sec. at Pass 9]{map}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   5.77 sec. at Pass 10]{postMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [  10.07 sec. at Pass 11]{pushMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   2.29 sec. at Pass 12]{finalMap}

yosys> opt_expr

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_merge -nomux

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.120. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.121. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.122. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.123. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.124. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.125. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 290 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.127. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.128. Printing statistics.

=== Log2highacc ===

   Number of wires:                 64
   Number of wire bits:            143
   Number of public wires:           7
   Number of public wire bits:      86
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 69
     $_DFF_P_                       30
     $lut                           39


yosys> shregmap -minlen 8 -maxlen 20

3.129. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.130. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.131. Printing statistics.

=== Log2highacc ===

   Number of wires:                 64
   Number of wire bits:            143
   Number of public wires:           7
   Number of public wire bits:      86
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 69
     $_DFF_P_                       30
     $lut                           39


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.132. Executing TECHMAP pass (map to technology primitives).

3.132.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.132.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.132.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~205 debug messages>

yosys> opt_expr -mux_undef

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
<suppressed ~1529 debug messages>

yosys> simplemap

3.134. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.135. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
<suppressed ~603 debug messages>
Removed a total of 201 cells.

yosys> opt_dff -nodffe -nosdff

3.137. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.138. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 166 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.139. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
<suppressed ~52 debug messages>

yosys> opt_merge -nomux

3.140. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_muxtree

3.141. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.142. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.144. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 15 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_ROQQjM/abc_tmp_2.scr

3.148. Executing ABC pass (technology mapping using ABC).

3.148.1. Extracting gate netlist of module `\Log2highacc' to `<abc-temp-dir>/input.blif'..
Extracted 267 gates and 297 wires to a netlist network with 28 inputs and 18 outputs.

3.148.1.1. Executing ABC.
DE:   #PIs =  28  #Luts =    45  Max Lvl =   5  Avg Lvl =   2.72  [   0.05 sec. at Pass 0]{firstMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   0.42 sec. at Pass 1]{initMapFlow}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   0.15 sec. at Pass 2]{map}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   0.51 sec. at Pass 3]{postMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   0.14 sec. at Pass 4]{map}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   1.18 sec. at Pass 5]{postMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   9.12 sec. at Pass 6]{pushMap}
DE:   #PIs =  28  #Luts =    39  Max Lvl =   6  Avg Lvl =   2.89  [   1.95 sec. at Pass 7]{finalMap}

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.

yosys> opt_merge -nomux

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.151. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \Log2highacc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.152. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \Log2highacc.
Performed a total of 0 changes.

yosys> opt_merge

3.153. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\Log2highacc'.
Removed a total of 0 cells.

yosys> opt_share

3.154. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.155. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.156. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 193 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.157. Executing OPT_EXPR pass (perform const folding).
Optimizing module Log2highacc.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.158. Executing HIERARCHY pass (managing design hierarchy).

3.158.1. Analyzing design hierarchy..
Top module:  \Log2highacc

3.158.2. Analyzing design hierarchy..
Top module:  \Log2highacc
Removed 0 unused modules.

yosys> stat

3.159. Printing statistics.

=== Log2highacc ===

   Number of wires:                 64
   Number of wire bits:            143
   Number of public wires:           7
   Number of public wire bits:      86
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 69
     $lut                           39
     dffsre                         30


yosys> opt_clean -purge

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \Log2highacc..
Removed 0 unused cells and 4 unused wires.
<suppressed ~4 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.161. Executing Verilog backend.
Dumping module `\Log2highacc'.

End of script. Logfile hash: 96b1cadeae, CPU: user 0.77s system 0.01s, MEM: 40.12 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 99% 6x abc (484 sec), 0% 28x opt_expr (0 sec), ...
real 64.59
user 464.89
sys 19.85
