
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k sbox3.v sbox8.v crp.v sbox2.v key_sel.v sbox1.v sbox5.v sbox4.v des_top.v sbox6.v sbox7.v

yosys> verific -vlog2k sbox3.v sbox8.v crp.v sbox2.v key_sel.v sbox1.v sbox5.v sbox4.v des_top.v sbox6.v sbox7.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox3.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox8.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'crp.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox2.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'key_sel.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox1.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox5.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox4.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'des_top.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox6.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'sbox7.v'

yosys> synth_rs -top des_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top des_top

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] des_top.v:35: compiling module 'des_top'
VERIFIC-INFO [VERI-1018] crp.v:35: compiling module 'crp'
VERIFIC-INFO [VERI-1018] sbox1.v:35: compiling module 'sbox1'
VERIFIC-INFO [VERI-1018] sbox2.v:35: compiling module 'sbox2'
VERIFIC-INFO [VERI-1018] sbox3.v:35: compiling module 'sbox3'
VERIFIC-INFO [VERI-1018] sbox4.v:35: compiling module 'sbox4'
VERIFIC-INFO [VERI-1018] sbox5.v:35: compiling module 'sbox5'
VERIFIC-INFO [VERI-1018] sbox6.v:35: compiling module 'sbox6'
VERIFIC-INFO [VERI-1018] sbox7.v:35: compiling module 'sbox7'
VERIFIC-INFO [VERI-1018] sbox8.v:35: compiling module 'sbox8'
VERIFIC-WARNING [VERI-2371] des_top.v:58: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] des_top.v:61: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] key_sel.v:43: compiling module 'key_selh'
Importing module des_top.
Importing module crp.
Importing module key_selh.
Importing module sbox1.
Importing module sbox2.
Importing module sbox3.
Importing module sbox4.
Importing module sbox5.
Importing module sbox6.
Importing module sbox7.
Importing module sbox8.

3.4.1. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \key_selh
Used module:     \crp
Used module:         \sbox8
Used module:         \sbox7
Used module:         \sbox6
Used module:         \sbox5
Used module:         \sbox4
Used module:         \sbox3
Used module:         \sbox2
Used module:         \sbox1

3.4.2. Analyzing design hierarchy..
Top module:  \des_top
Used module:     \key_selh
Used module:     \crp
Used module:         \sbox8
Used module:         \sbox7
Used module:         \sbox6
Used module:         \sbox5
Used module:         \sbox4
Used module:         \sbox3
Used module:         \sbox2
Used module:         \sbox1
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module sbox8.
Optimizing module sbox7.
Optimizing module sbox6.
Optimizing module sbox5.
Optimizing module sbox4.
Optimizing module sbox3.
Optimizing module sbox2.
Optimizing module sbox1.
Optimizing module key_selh.
Optimizing module crp.
Optimizing module des_top.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module crp.
Deleting now unused module key_selh.
Deleting now unused module sbox1.
Deleting now unused module sbox2.
Deleting now unused module sbox3.
Deleting now unused module sbox4.
Deleting now unused module sbox5.
Deleting now unused module sbox6.
Deleting now unused module sbox7.
Deleting now unused module sbox8.
<suppressed ~10 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 132 unused wires.
<suppressed ~23 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module des_top...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~12 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~48 debug messages>
Removed a total of 16 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$R_reg$des_top.v:61$25 ($aldff) from module des_top.
Removing never-active async load on $verific$L_reg$des_top.v:58$23 ($aldff) from module des_top.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.42. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$700 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$697 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$694 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$693 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$690 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$686 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$684 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u0.$auto$bmuxmap.cc:60:execute$680 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:60:execute$639 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:60:execute$638 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:60:execute$635 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:60:execute$632 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:60:execute$617 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:60:execute$611 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:60:execute$609 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u2.$auto$bmuxmap.cc:60:execute$558 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u2.$auto$bmuxmap.cc:60:execute$557 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u2.$auto$bmuxmap.cc:60:execute$553 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u2.$auto$bmuxmap.cc:60:execute$549 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u2.$auto$bmuxmap.cc:60:execute$541 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u2.$auto$bmuxmap.cc:60:execute$540 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$492 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$488 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$485 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$482 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$481 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$478 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$476 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$474 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$473 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u3.$auto$bmuxmap.cc:60:execute$472 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$432 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$425 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$423 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$421 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$419 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$417 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$414 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$413 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$411 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$409 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$408 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:60:execute$402 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$363 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$362 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$361 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$360 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$359 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$356 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$352 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$348 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$345 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$344 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$341 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$337 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:60:execute$333 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u6.$auto$bmuxmap.cc:60:execute$288 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u6.$auto$bmuxmap.cc:60:execute$285 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u6.$auto$bmuxmap.cc:60:execute$283 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u6.$auto$bmuxmap.cc:60:execute$280 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u6.$auto$bmuxmap.cc:60:execute$279 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u6.$auto$bmuxmap.cc:60:execute$270 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u6.$auto$bmuxmap.cc:60:execute$266 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$224 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$222 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$221 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$218 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$215 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$214 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$212 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$211 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$205 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$203 ($mux).
Removed top 1 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$200 ($mux).
Removed top 2 bits (of 4) from mux cell des_top.$flatten\u0.\u7.$auto$bmuxmap.cc:60:execute$198 ($mux).
Removed top 1 bits (of 128) from wire des_top.$flatten\u0.\u1.$auto$bmuxmap.cc:58:execute$607.
Removed top 1 bits (of 128) from wire des_top.$flatten\u0.\u4.$auto$bmuxmap.cc:58:execute$400.
Removed top 1 bits (of 128) from wire des_top.$flatten\u0.\u5.$auto$bmuxmap.cc:58:execute$331.

yosys> peepopt

3.43. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.44. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.45. Executing BMUXMAP pass.

yosys> demuxmap

3.46. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.47. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module des_top:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~28 debug messages>

yosys> opt_reduce

3.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~27 debug messages>
Removed a total of 9 cells.

yosys> opt_share

3.53. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_muxtree

3.57. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~35 debug messages>

yosys> opt_reduce

3.58. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.59. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.60. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.61. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.63. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 2

yosys> stat

3.64. Printing statistics.

=== des_top ===

   Number of wires:                 95
   Number of wire bits:           3651
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                504
     $dff                            2
     $logic_not                      1
     $mux                          497
     $not                            1
     $xor                            3


yosys> memory -nomap

3.65. Executing MEMORY pass.

yosys> opt_mem

3.65.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.65.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.65.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.65.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.65.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.65.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_share

3.65.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.65.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.65.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> memory_collect

3.65.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.66. Printing statistics.

=== des_top ===

   Number of wires:                 95
   Number of wire bits:           3651
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                504
     $dff                            2
     $logic_not                      1
     $mux                          497
     $not                            1
     $xor                            3


yosys> muxpack

3.67. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~284 debug messages>

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> pmuxtree

3.69. Executing PMUXTREE pass.

yosys> muxpack

3.70. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~284 debug messages>

yosys> memory_map

3.71. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.72. Printing statistics.

=== des_top ===

   Number of wires:                 95
   Number of wire bits:           3651
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                504
     $dff                            2
     $logic_not                      1
     $mux                          497
     $not                            1
     $xor                            3


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.73. Executing TECHMAP pass (map to technology primitives).

3.73.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.73.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.73.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $not.
No more expansions possible.
<suppressed ~575 debug messages>

yosys> stat

3.74. Printing statistics.

=== des_top ===

   Number of wires:                 97
   Number of wire bits:           3654
   Number of public wires:          51
   Number of public wire bits:    1375
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2778
     $_DFF_P_                       64
     $_MUX_                       2626
     $_NOT_                          4
     $_OR_                           3
     $_XOR_                         81


yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~685 debug messages>

yosys> opt_merge -nomux

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~2049 debug messages>
Removed a total of 683 cells.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 1 unused cells and 1 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~16 debug messages>

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~33 debug messages>

yosys> techmap -map +/techmap.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.98. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> abc -dff

3.101. Executing ABC pass (technology mapping using ABC).

3.101.1. Summary of detected clock domains:
  1457 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.101.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1457 gates and 1584 wires to a netlist network with 125 inputs and 64 outputs.

3.101.2.1. Executing ABC.

yosys> abc -dff

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Summary of detected clock domains:
  1990 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.102.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1990 gates and 2115 wires to a netlist network with 125 inputs and 64 outputs.

3.102.2.1. Executing ABC.

yosys> abc -dff

3.103. Executing ABC pass (technology mapping using ABC).

3.103.1. Summary of detected clock domains:
  1982 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.103.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1982 gates and 2107 wires to a netlist network with 125 inputs and 64 outputs.

3.103.2.1. Executing ABC.

yosys> abc -dff

3.104. Executing ABC pass (technology mapping using ABC).

3.104.1. Summary of detected clock domains:
  1966 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.104.2. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1966 gates and 2091 wires to a netlist network with 125 inputs and 64 outputs.

3.104.2.1. Executing ABC.

yosys> opt_ffinv

3.105. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~3 debug messages>

yosys> opt_merge -nomux

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~192 debug messages>
Removed a total of 64 cells.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 6633 unused wires.
<suppressed ~23 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.115. Executing BMUXMAP pass.

yosys> demuxmap

3.116. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_ZRb5AC/abc_tmp_1.scr

3.117. Executing ABC pass (technology mapping using ABC).

3.117.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 1829 gates and 2018 wires to a netlist network with 189 inputs and 64 outputs.

3.117.1.1. Executing ABC.
DE:   #PIs = 189  #Luts =   627  Max Lvl =   5  Avg Lvl =   3.00  [   0.18 sec. at Pass 0]{firstMap}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   5.50 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   1.85 sec. at Pass 2]{map}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   3.14 sec. at Pass 3]{postMap}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   2.19 sec. at Pass 4]{map}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   3.73 sec. at Pass 5]{postMap}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   6.93 sec. at Pass 6]{pushMap}
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   0.68 sec. at Pass 7]{finalMap}

yosys> opt_expr

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.120. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.121. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.122. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.123. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.124. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.125. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 2018 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.127. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.128. Printing statistics.

=== des_top ===

   Number of wires:                417
   Number of wire bits:           1183
   Number of public wires:          29
   Number of public wire bits:     795
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                452
     $_DFF_P_                       64
     $lut                          388


yosys> shregmap -minlen 8 -maxlen 20

3.129. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.130. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.131. Printing statistics.

=== des_top ===

   Number of wires:                417
   Number of wire bits:           1183
   Number of public wires:          29
   Number of public wire bits:     795
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                452
     $_DFF_P_                       64
     $lut                          388


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.132. Executing TECHMAP pass (map to technology primitives).

3.132.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.132.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.132.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
No more expansions possible.
<suppressed ~588 debug messages>

yosys> opt_expr -mux_undef

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~14165 debug messages>

yosys> simplemap

3.134. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.135. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~4899 debug messages>
Removed a total of 1633 cells.

yosys> opt_dff -nodffe -nosdff

3.137. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.138. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1395 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.139. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
<suppressed ~411 debug messages>

yosys> opt_merge -nomux

3.140. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.141. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.142. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.144. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 119 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_ZRb5AC/abc_tmp_2.scr

3.148. Executing ABC pass (technology mapping using ABC).

3.148.1. Extracting gate netlist of module `\des_top' to `<abc-temp-dir>/input.blif'..
Extracted 1789 gates and 1980 wires to a netlist network with 189 inputs and 64 outputs.

3.148.1.1. Executing ABC.
DE:   #PIs = 189  #Luts =   473  Max Lvl =   5  Avg Lvl =   3.00  [   0.31 sec. at Pass 0]{firstMap}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [  11.96 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   2.23 sec. at Pass 2]{map}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   2.71 sec. at Pass 3]{postMap}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   2.45 sec. at Pass 4]{map}
DE:   #PIs = 189  #Luts =   389  Max Lvl =   6  Avg Lvl =   4.00  [   2.91 sec. at Pass 5]{postMap}
DE:   #PIs = 189  #Luts =   388  Max Lvl =   7  Avg Lvl =   4.12  [   6.05 sec. at Pass 6]{pushMap}
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   3.87 sec. at Pass 7]{map}
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   4.58 sec. at Pass 8]{postMap}
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   2.27 sec. at Pass 9]{map}
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   4.11 sec. at Pass 10]{postMap}
DE:   #PIs = 189  #Luts =   388  Max Lvl =   6  Avg Lvl =   4.00  [   9.87 sec. at Pass 11]{pushMap}
DE:   #PIs = 189  #Luts =   386  Max Lvl =   7  Avg Lvl =   4.31  [   0.63 sec. at Pass 12]{finalMap}

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.

yosys> opt_merge -nomux

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.151. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \des_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.152. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \des_top.
Performed a total of 0 changes.

yosys> opt_merge

3.153. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\des_top'.
Removed a total of 0 cells.

yosys> opt_share

3.154. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.155. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.156. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 1220 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.157. Executing OPT_EXPR pass (perform const folding).
Optimizing module des_top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.158. Executing HIERARCHY pass (managing design hierarchy).

3.158.1. Analyzing design hierarchy..
Top module:  \des_top

3.158.2. Analyzing design hierarchy..
Top module:  \des_top
Removed 0 unused modules.

yosys> stat

3.159. Printing statistics.

=== des_top ===

   Number of wires:                415
   Number of wire bits:           1181
   Number of public wires:          29
   Number of public wire bits:     795
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                450
     $lut                          386
     dffsre                         64


yosys> opt_clean -purge

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \des_top..
Removed 0 unused cells and 23 unused wires.
<suppressed ~23 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.161. Executing Verilog backend.
Dumping module `\des_top'.

Warnings: 2 unique messages, 2 total
End of script. Logfile hash: 9cad9738f8, CPU: user 4.29s system 0.04s, MEM: 68.35 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 98% 6x abc (257 sec), 0% 26x opt_expr (1 sec), ...
real 92.93
user 243.66
sys 17.93
