
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv

yosys> verific -sv prim_alert_pkg.sv prim_mubi_pkg.sv prim_pad_wrapper_pkg.sv prim_pkg.sv prim_secded_pkg.sv prim_subreg_pkg.sv prim_util_pkg.sv top_pkg.sv tlul_pkg.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_alert_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:19: parameter 'ALERT_TX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_alert_pkg.sv:22: parameter 'ALERT_RX_DEFAULT' declared inside package 'prim_alert_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_mubi_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:19: parameter 'MuBi4Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:148: parameter 'MuBi8Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:277: parameter 'MuBi12Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:406: parameter 'MuBi16Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pad_wrapper_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:24: parameter 'DriveStrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:25: parameter 'SlewRateDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:39: parameter 'AttrDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_pad_wrapper_pkg.sv:42: parameter 'PokDw' declared inside package 'prim_pad_wrapper_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:81: parameter 'Secded2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:82: parameter 'Secded2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:90: parameter 'Secded2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:91: parameter 'Secded2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:99: parameter 'Secded3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:100: parameter 'Secded3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:108: parameter 'Secded6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:109: parameter 'Secded6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:117: parameter 'Secded7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:118: parameter 'Secded7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:126: parameter 'SecdedHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:127: parameter 'SecdedHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:135: parameter 'SecdedHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:136: parameter 'SecdedHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:144: parameter 'SecdedHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:145: parameter 'SecdedHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:153: parameter 'SecdedHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:154: parameter 'SecdedHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:162: parameter 'SecdedInv2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:163: parameter 'SecdedInv2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:171: parameter 'SecdedInv2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:172: parameter 'SecdedInv2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:180: parameter 'SecdedInv3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:181: parameter 'SecdedInv3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:189: parameter 'SecdedInv6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:190: parameter 'SecdedInv6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:198: parameter 'SecdedInv7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:199: parameter 'SecdedInv7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:207: parameter 'SecdedInvHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:208: parameter 'SecdedInvHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:216: parameter 'SecdedInvHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:217: parameter 'SecdedInvHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:225: parameter 'SecdedInvHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:226: parameter 'SecdedInvHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:234: parameter 'SecdedInvHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:235: parameter 'SecdedInvHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_subreg_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_util_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'top_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_pkg.sv'
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:14: parameter 'ArbiterImpl' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:27: parameter 'H2DCmdMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:28: parameter 'H2DCmdIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:29: parameter 'H2DCmdFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:30: parameter 'D2HRspMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:31: parameter 'D2HRspIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:32: parameter 'D2HRspFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:33: parameter 'DataMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:34: parameter 'DataIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:35: parameter 'DataFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:44: parameter 'TL_A_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:84: parameter 'TL_D_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam

yosys> read -vlog2k IOBUF.v

yosys> verific -vlog2k IOBUF.v

3. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'IOBUF.v'

yosys> read -sv prim_xilinx_pad_wrapper.sv

yosys> verific -sv prim_xilinx_pad_wrapper.sv

4. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_xilinx_pad_wrapper.sv'

yosys> synth_rs -top prim_xilinx_pad_wrapper -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

5. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

5.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

5.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

5.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top prim_xilinx_pad_wrapper

5.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] prim_xilinx_pad_wrapper.sv:9: compiling module 'prim_xilinx_pad_wrapper'
VERIFIC-INFO [VERI-1018] IOBUF.v:42: compiling module 'IOBUF'
VERIFIC-WARNING [VERI-1166] IOBUF.v:72: case condition never applies
Importing module prim_xilinx_pad_wrapper.
Importing module IOBUF.

5.4.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF

5.4.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Used module:     \IOBUF
Removed 0 unused modules.

yosys> proc

5.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

5.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

5.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

5.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

5.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

5.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

5.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

5.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

5.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

5.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

5.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

5.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

5.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module IOBUF.
<suppressed ~1 debug messages>
Optimizing module prim_xilinx_pad_wrapper.

yosys> bmuxmap

5.6. Executing BMUXMAP pass.

yosys> demuxmap

5.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

5.8. Executing FLATTEN pass (flatten design).
Deleting now unused module IOBUF.
<suppressed ~1 debug messages>

yosys> bmuxmap

5.9. Executing BMUXMAP pass.

yosys> demuxmap

5.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

5.11. Executing TRIBUF pass.

yosys> deminout

5.12. Executing DEMINOUT pass (demote inout ports to input or output).
Demoting inout port prim_xilinx_pad_wrapper.inout_io to output.

yosys> opt_expr

5.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_clean

5.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 7 unused cells and 16 unused wires.
<suppressed ~17 debug messages>

yosys> check

5.15. Executing CHECK pass (checking for obvious problems).
Checking module prim_xilinx_pad_wrapper...
Found and reported 0 problems.

yosys> opt_expr

5.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.22. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

5.25. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

5.25.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

5.25.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

5.25.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

5.25.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> fsm_opt

5.25.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

5.25.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

5.25.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

5.25.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

5.26. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.28. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.29. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.30. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.31. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

5.32. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.33. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

5.35. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

5.36. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

5.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> bmuxmap

5.38. Executing BMUXMAP pass.

yosys> demuxmap

5.39. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

5.40. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module prim_xilinx_pad_wrapper:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

5.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.42. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.43. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.44. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.46. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.47. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> stat

5.50. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> memory -nomap

5.51. Executing MEMORY pass.

yosys> opt_mem

5.51.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

5.51.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

5.51.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

5.51.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

5.51.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

5.51.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_share

5.51.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

5.51.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

5.51.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> memory_collect

5.51.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

5.52. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> muxpack

5.53. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> opt_clean

5.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> pmuxtree

5.55. Executing PMUXTREE pass.

yosys> muxpack

5.56. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> memory_map

5.57. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

5.58. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

5.59. Executing TECHMAP pass (map to technology primitives).

5.59.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.59.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

5.59.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> stat

5.60. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  2
     $_XOR_                          2


yosys> opt_expr

5.61. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.62. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.63. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.64. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.65. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.66. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.67. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.69. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> opt_expr -full

5.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~1 debug messages>

yosys> techmap -map +/techmap.v

5.71. Executing TECHMAP pass (map to technology primitives).

5.71.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.71.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

5.72. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.74. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.75. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

5.77. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.78. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.79. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> abc -dff

5.80. Executing ABC pass (technology mapping using ABC).

5.80.1. Summary of detected clock domains:
  2 cells in clk={ }, en={ }, arst={ }, srst={ }

5.80.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 2 outputs.

5.80.2.1. Executing ABC.

yosys> abc -dff

5.81. Executing ABC pass (technology mapping using ABC).

5.81.1. Summary of detected clock domains:
  1 cells in clk={ }, en={ }, arst={ }, srst={ }

5.81.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.81.2.1. Executing ABC.

yosys> abc -dff

5.82. Executing ABC pass (technology mapping using ABC).

5.82.1. Summary of detected clock domains:
  1 cells in clk={ }, en={ }, arst={ }, srst={ }

5.82.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.82.2.1. Executing ABC.

yosys> abc -dff

5.83. Executing ABC pass (technology mapping using ABC).

5.83.1. Summary of detected clock domains:
  1 cells in clk={ }, en={ }, arst={ }, srst={ }

5.83.2. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.83.2.1. Executing ABC.

yosys> opt_ffinv

5.84. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

5.85. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.87. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.88. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.89. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.90. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

5.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 13 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> bmuxmap

5.94. Executing BMUXMAP pass.

yosys> demuxmap

5.95. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_HbUUPM/abc_tmp_1.scr

5.96. Executing ABC pass (technology mapping using ABC).

5.96.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 1 gates and 3 wires to a netlist network with 2 inputs and 1 outputs.

5.96.1.1. Executing ABC.
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.07 sec. at Pass 0]{firstMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.33 sec. at Pass 1]{initMapFlow}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.19 sec. at Pass 2]{map}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.40 sec. at Pass 3]{postMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.37 sec. at Pass 4]{map}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.92 sec. at Pass 5]{postMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   3.14 sec. at Pass 6]{pushMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   2.48 sec. at Pass 7]{finalMap}

yosys> opt_expr

5.97. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.98. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.99. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.100. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.102. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.103. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.104. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.105. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> opt_ffinv

5.106. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

5.107. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  1
     $lut                            1


yosys> shregmap -minlen 8 -maxlen 20

5.108. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

5.109. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

5.110. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  1
     $lut                            1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

5.111. Executing TECHMAP pass (map to technology primitives).

5.111.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

5.111.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

5.111.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~137 debug messages>

yosys> opt_expr -mux_undef

5.112. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
<suppressed ~1 debug messages>

yosys> simplemap

5.113. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

5.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge

5.115. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

5.116. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.117. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.120. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.121. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.122. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.123. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.124. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.125. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..

yosys> opt_expr

5.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_HbUUPM/abc_tmp_2.scr

5.127. Executing ABC pass (technology mapping using ABC).

5.127.1. Extracting gate netlist of module `\prim_xilinx_pad_wrapper' to `<abc-temp-dir>/input.blif'..
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 1 outputs.

5.127.1.1. Executing ABC.
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.06 sec. at Pass 0]{firstMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.12 sec. at Pass 1]{initMapFlow}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.15 sec. at Pass 2]{map}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.34 sec. at Pass 3]{postMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   0.53 sec. at Pass 4]{map}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   1.03 sec. at Pass 5]{postMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   2.31 sec. at Pass 6]{pushMap}
DE:   #PIs =   2  #Luts =     1  Max Lvl =   1  Avg Lvl =   1.00  [   1.87 sec. at Pass 7]{finalMap}

yosys> opt_expr

5.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.

yosys> opt_merge -nomux

5.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.130. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \prim_xilinx_pad_wrapper..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.131. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \prim_xilinx_pad_wrapper.
Performed a total of 0 changes.

yosys> opt_merge

5.132. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\prim_xilinx_pad_wrapper'.
Removed a total of 0 cells.

yosys> opt_share

5.133. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

5.134. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

5.135. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 4 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

5.136. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_xilinx_pad_wrapper.
MAX OPT ITERATION = 1

yosys> hierarchy -check

5.137. Executing HIERARCHY pass (managing design hierarchy).

5.137.1. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper

5.137.2. Analyzing design hierarchy..
Top module:  \prim_xilinx_pad_wrapper
Removed 0 unused modules.

yosys> stat

5.138. Printing statistics.

=== prim_xilinx_pad_wrapper ===

   Number of wires:                 26
   Number of wire bits:             37
   Number of public wires:          26
   Number of public wire bits:      37
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                  1
     $lut                            1


yosys> opt_clean -purge

5.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \prim_xilinx_pad_wrapper..
Removed 0 unused cells and 8 unused wires.
<suppressed ~8 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

5.140. Executing Verilog backend.
Dumping module `\prim_xilinx_pad_wrapper'.

Warnings: 59 unique messages, 59 total
End of script. Logfile hash: 7a27661545, CPU: user 0.29s system 0.02s, MEM: 37.83 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 98% 6x abc (22 sec), 0% 9x read_verilog (0 sec), ...
real 20.27
user 15.95
sys 6.57
