
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k spi_defines.vh spi_clgen.v spi_top.v timescale.v spi_shift.v

yosys> verific -vlog2k spi_defines.vh spi_clgen.v spi_top.v timescale.v spi_shift.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'spi_defines.vh'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'spi_clgen.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'spi_top.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'timescale.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'spi_shift.v'

yosys> synth_rs -top spi_top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top spi_top

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] spi_top.v:43: compiling module 'spi_top'
VERIFIC-WARNING [VERI-2371] spi_top.v:143: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:145: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:152: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:154: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:164: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:166: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:168: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:175: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:184: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:186: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:213: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:217: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:219: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:222: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:237: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_top.v:242: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] spi_clgen.v:42: compiling module 'spi_clgen'
VERIFIC-WARNING [VERI-2371] spi_clgen.v:72: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:76: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:78: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:86: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:88: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:96: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:97: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:101: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_clgen.v:102: delay control is not supported for synthesis
VERIFIC-INFO [VERI-1018] spi_shift.v:42: compiling module 'spi_shift'
VERIFIC-WARNING [VERI-2371] spi_shift.v:93: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:97: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:99: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:107: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:109: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:111: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:118: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:120: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:127: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:132: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:134: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:136: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:138: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:143: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:145: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:147: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:149: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:154: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:156: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:158: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:160: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:165: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:167: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:169: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:171: delay control is not supported for synthesis
VERIFIC-WARNING [VERI-2371] spi_shift.v:232: delay control is not supported for synthesis
Importing module spi_top.
Importing module spi_clgen.
Importing module spi_shift.

3.4.1. Analyzing design hierarchy..
Top module:  \spi_top
Used module:     \spi_shift
Used module:     \spi_clgen

3.4.2. Analyzing design hierarchy..
Top module:  \spi_top
Used module:     \spi_shift
Used module:     \spi_clgen
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_shift.
<suppressed ~2 debug messages>
Optimizing module spi_clgen.
<suppressed ~2 debug messages>
Optimizing module spi_top.
<suppressed ~5 debug messages>

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module spi_clgen.
Deleting now unused module spi_shift.
<suppressed ~2 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 308 unused wires.
<suppressed ~45 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module spi_top...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
<suppressed ~2 debug messages>

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
<suppressed ~18 debug messages>
Removed a total of 6 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~17 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $verific$wb_int_o_reg$spi_top.v:168$139 ($aldff) from module spi_top.
Changing const-value async load to async reset on $verific$wb_dat_o_reg$spi_top.v:145$126 ($aldff) from module spi_top.
Changing const-value async load to async reset on $verific$wb_ack_o_reg$spi_top.v:154$131 ($aldff) from module spi_top.
Changing const-value async load to async reset on $verific$ss_reg$spi_top.v:268$176 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\clgen.$verific$clk_out_reg$spi_clgen.v:88$452 ($aldff) from module spi_top.
Changing const-value async load to async reset on $verific$divider_reg$spi_top.v:206$149 ($aldff) from module spi_top.
Changing const-value async load to async reset on $verific$ctrl_reg$spi_top.v:222$162 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\shift.$verific$tip_reg$spi_shift.v:111$711 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\shift.$verific$s_out_reg$spi_shift.v:120$716 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\shift.$verific$cnt_reg$spi_shift.v:100$702 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\clgen.$verific$pos_edge_reg$spi_clgen.v:103$469 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\clgen.$verific$neg_edge_reg$spi_clgen.v:103$470 ($aldff) from module spi_top.
Changing const-value async load to async reset on $flatten\clgen.$verific$cnt_reg$spi_clgen.v:79$443 ($aldff) from module spi_top.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 8 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.25. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.25.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.25.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.25.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.25.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..

yosys> fsm_opt

3.25.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.25.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.25.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.25.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.26. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_merge -nomux

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~17 debug messages>

yosys> opt_reduce

3.29. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.30. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.31. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.32. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$wb_int_o_reg$spi_top.v:168$139 ($adff) from module spi_top (D = $verific$n351$62, Q = \wb_int_o).
Adding EN signal on $verific$ss_reg$spi_top.v:268$176 ($adff) from module spi_top (D = \wb_dat_i [7:0], Q = \ss).
Adding EN signal on $verific$divider_reg$spi_top.v:206$149 ($adff) from module spi_top (D = \wb_dat_i [7:0], Q = \divider [7:0]).
Adding EN signal on $verific$divider_reg$spi_top.v:206$149 ($adff) from module spi_top (D = \wb_dat_i [15:8], Q = \divider [15:8]).
Adding EN signal on $verific$ctrl_reg$spi_top.v:222$162 ($adff) from module spi_top (D = $verific$n461$86, Q = \ctrl [7:0]).
Adding EN signal on $verific$ctrl_reg$spi_top.v:222$162 ($adff) from module spi_top (D = \wb_dat_i [13:9], Q = \ctrl [13:9]).
Adding EN signal on $verific$ctrl_reg$spi_top.v:222$162 ($adff) from module spi_top (D = $verific$n504$89 [8], Q = \ctrl [8]).
Adding EN signal on $flatten\shift.$verific$tip_reg$spi_shift.v:111$711 ($adff) from module spi_top (D = $flatten\shift.$verific$n333$491, Q = \shift.tip).
Adding EN signal on $flatten\shift.$verific$s_out_reg$spi_shift.v:120$716 ($adff) from module spi_top (D = $flatten\shift.$auto$bmuxmap.cc:58:execute$1145, Q = \shift.s_out).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [0], Q = \shift.data [0]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [1], Q = \shift.data [1]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [2], Q = \shift.data [2]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [3], Q = \shift.data [3]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [4], Q = \shift.data [4]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [5], Q = \shift.data [5]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [6], Q = \shift.data [6]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [7], Q = \shift.data [7]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [32], Q = \shift.data [32]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [33], Q = \shift.data [33]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [34], Q = \shift.data [34]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [35], Q = \shift.data [35]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [36], Q = \shift.data [36]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [37], Q = \shift.data [37]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [38], Q = \shift.data [38]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [39], Q = \shift.data [39]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [64], Q = \shift.data [64]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [65], Q = \shift.data [65]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [66], Q = \shift.data [66]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [67], Q = \shift.data [67]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [68], Q = \shift.data [68]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [69], Q = \shift.data [69]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [70], Q = \shift.data [70]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [71], Q = \shift.data [71]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [96], Q = \shift.data [96]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [97], Q = \shift.data [97]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [98], Q = \shift.data [98]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [99], Q = \shift.data [99]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [100], Q = \shift.data [100]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [101], Q = \shift.data [101]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [102], Q = \shift.data [102]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [103], Q = \shift.data [103]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [8], Q = \shift.data [8]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [9], Q = \shift.data [9]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [10], Q = \shift.data [10]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [11], Q = \shift.data [11]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [12], Q = \shift.data [12]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [13], Q = \shift.data [13]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [14], Q = \shift.data [14]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [15], Q = \shift.data [15]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [40], Q = \shift.data [40]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [41], Q = \shift.data [41]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [42], Q = \shift.data [42]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [43], Q = \shift.data [43]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [44], Q = \shift.data [44]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [45], Q = \shift.data [45]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [46], Q = \shift.data [46]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [47], Q = \shift.data [47]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [72], Q = \shift.data [72]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [73], Q = \shift.data [73]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [74], Q = \shift.data [74]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [75], Q = \shift.data [75]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [76], Q = \shift.data [76]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [77], Q = \shift.data [77]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [78], Q = \shift.data [78]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [79], Q = \shift.data [79]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [104], Q = \shift.data [104]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [105], Q = \shift.data [105]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [106], Q = \shift.data [106]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [107], Q = \shift.data [107]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [108], Q = \shift.data [108]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [109], Q = \shift.data [109]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [110], Q = \shift.data [110]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [111], Q = \shift.data [111]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [16], Q = \shift.data [16]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [17], Q = \shift.data [17]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [18], Q = \shift.data [18]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [19], Q = \shift.data [19]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [20], Q = \shift.data [20]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [21], Q = \shift.data [21]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [22], Q = \shift.data [22]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [23], Q = \shift.data [23]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [48], Q = \shift.data [48]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [49], Q = \shift.data [49]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [50], Q = \shift.data [50]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [51], Q = \shift.data [51]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [52], Q = \shift.data [52]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [53], Q = \shift.data [53]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [54], Q = \shift.data [54]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [55], Q = \shift.data [55]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [80], Q = \shift.data [80]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [81], Q = \shift.data [81]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [82], Q = \shift.data [82]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [83], Q = \shift.data [83]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [84], Q = \shift.data [84]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [85], Q = \shift.data [85]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [86], Q = \shift.data [86]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [87], Q = \shift.data [87]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [112], Q = \shift.data [112]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [113], Q = \shift.data [113]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [114], Q = \shift.data [114]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [115], Q = \shift.data [115]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [116], Q = \shift.data [116]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [117], Q = \shift.data [117]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [118], Q = \shift.data [118]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [119], Q = \shift.data [119]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [24], Q = \shift.data [24]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [25], Q = \shift.data [25]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [26], Q = \shift.data [26]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [27], Q = \shift.data [27]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [28], Q = \shift.data [28]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [29], Q = \shift.data [29]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [30], Q = \shift.data [30]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1400$654 [31], Q = \shift.data [31]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [56], Q = \shift.data [56]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [57], Q = \shift.data [57]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [58], Q = \shift.data [58]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [59], Q = \shift.data [59]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [60], Q = \shift.data [60]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [61], Q = \shift.data [61]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [62], Q = \shift.data [62]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1271$653 [63], Q = \shift.data [63]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [88], Q = \shift.data [88]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [89], Q = \shift.data [89]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [90], Q = \shift.data [90]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [91], Q = \shift.data [91]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [92], Q = \shift.data [92]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [93], Q = \shift.data [93]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [94], Q = \shift.data [94]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1142$652 [95], Q = \shift.data [95]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [120], Q = \shift.data [120]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [121], Q = \shift.data [121]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [122], Q = \shift.data [122]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [123], Q = \shift.data [123]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [124], Q = \shift.data [124]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [125], Q = \shift.data [125]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [126], Q = \shift.data [126]).
Adding EN signal on $flatten\shift.$verific$data_reg$spi_shift.v:232$877 ($adff) from module spi_top (D = $flatten\shift.$verific$n1013$651 [127], Q = \shift.data [127]).
Adding EN signal on $flatten\shift.$verific$cnt_reg$spi_shift.v:100$702 ($adff) from module spi_top (D = $flatten\shift.$verific$n306$644, Q = \shift.cnt).
Adding EN signal on $flatten\clgen.$verific$clk_out_reg$spi_clgen.v:88$452 ($adff) from module spi_top (D = $flatten\clgen.$verific$n119$408, Q = \clgen.clk_out).

yosys> opt_clean

3.33. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 7 unused cells and 7 unused wires.
<suppressed ~8 debug messages>

yosys> opt_expr

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
<suppressed ~131 debug messages>

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~17 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
<suppressed ~1500 debug messages>
Removed a total of 500 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 500 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 3

yosys> wreduce -keepdc

3.49. Executing WREDUCE pass (reducing word size of cells).
Removed top 2 bits (of 3) from port B of cell spi_top.$verific$equal_16$spi_top.v:105$115 ($eq).
Removed top 1 bits (of 3) from port B of cell spi_top.$verific$equal_20$spi_top.v:106$116 ($eq).
Removed top 1 bits (of 3) from port B of cell spi_top.$verific$equal_24$spi_top.v:107$117 ($eq).
Removed top 7 bits (of 8) from port B of cell spi_top.$verific$or_126$spi_top.v:217$153 ($or).
Removed top 5 bits (of 14) from mux cell spi_top.$verific$mux_147$spi_top.v:222$161 ($mux).
Removed top 16 bits (of 32) from mux cell spi_top.$auto$bmuxmap.cc:60:execute$1150 ($mux).
Removed top 127 bits (of 128) from port A of cell spi_top.$flatten\shift.$verific$Decoder_218$spi_shift.v:232$744 ($shl).
Removed top 7 bits (of 8) from port B of cell spi_top.$flatten\shift.$verific$add_12$spi_shift.v:81$680 ($add).
Removed top 1 bits (of 8) from mux cell spi_top.$flatten\shift.$verific$mux_17$spi_shift.v:82$684 ($mux).
Removed top 96 bits (of 128) from mux cell spi_top.$flatten\shift.$verific$mux_350$spi_shift.v:232$876 ($mux).
Removed top 1 bits (of 8) from mux cell spi_top.$flatten\shift.$verific$mux_8$spi_shift.v:80$678 ($mux).
Removed top 1 bits (of 8) from port Y of cell spi_top.$flatten\shift.$verific$sub_14$spi_shift.v:81$682 ($sub).
Removed top 1 bits (of 8) from port A of cell spi_top.$flatten\shift.$verific$sub_14$spi_shift.v:81$682 ($sub).
Removed top 1 bits (of 8) from port B of cell spi_top.$flatten\shift.$verific$sub_14$spi_shift.v:81$682 ($sub).
Removed top 1 bits (of 8) from port Y of cell spi_top.$flatten\shift.$verific$sub_6$spi_shift.v:80$676 ($sub).
Removed top 1 bits (of 8) from port A of cell spi_top.$flatten\shift.$verific$sub_6$spi_shift.v:80$676 ($sub).
Removed top 1 bits (of 8) from port B of cell spi_top.$flatten\shift.$verific$sub_6$spi_shift.v:80$676 ($sub).
Removed top 7 bits (of 8) from port B of cell spi_top.$flatten\shift.$verific$sub_7$spi_shift.v:80$677 ($sub).
Removed top 15 bits (of 16) from port B of cell spi_top.$flatten\clgen.$verific$equal_5$spi_clgen.v:66$436 ($eq).
Removed top 15 bits (of 16) from port B of cell spi_top.$flatten\clgen.$verific$sub_12$spi_clgen.v:78$441 ($sub).
Removed top 1 bits (of 2) from port B of cell spi_top.$auto$opt_dff.cc:195:make_patterns_logic$2852 ($ne).
Removed top 5 bits (of 6) from mux cell spi_top.$verific$mux_176$spi_top.v:219$145 ($mux).
Removed cell spi_top.$flatten\shift.$verific$i6$spi_shift.v:80$675 ($not).
Removed top 1 bits (of 8) from mux cell spi_top.$flatten\shift.$verific$mux_13$spi_shift.v:81$681 ($mux).
Removed top 1 bits (of 8) from mux cell spi_top.$flatten\shift.$verific$mux_16$spi_shift.v:82$683 ($mux).
Removed top 64 bits (of 128) from mux cell spi_top.$flatten\shift.$verific$mux_349$spi_shift.v:232$875 ($mux).
Removed top 1 bits (of 8) from port Y of cell spi_top.$flatten\shift.$verific$add_12$spi_shift.v:81$680 ($add).
Removed top 1 bits (of 8) from port A of cell spi_top.$flatten\shift.$verific$add_12$spi_shift.v:81$680 ($add).
Removed top 32 bits (of 128) from mux cell spi_top.$flatten\shift.$verific$mux_348$spi_shift.v:232$874 ($mux).
Removed top 32 bits (of 128) from wire spi_top.$flatten\shift.$verific$n1142$652.
Removed top 64 bits (of 128) from wire spi_top.$flatten\shift.$verific$n1271$653.
Removed top 96 bits (of 128) from wire spi_top.$flatten\shift.$verific$n1400$654.
Removed top 5 bits (of 14) from wire spi_top.$verific$n504$89.
Removed top 5 bits (of 6) from wire spi_top.$verific$n786$100.

yosys> peepopt

3.50. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 6 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.52. Executing BMUXMAP pass.

yosys> demuxmap

3.53. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.54. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module spi_top:
  creating $macc model for $flatten\clgen.$verific$sub_12$spi_clgen.v:78$441 ($sub).
  creating $macc model for $flatten\shift.$verific$add_12$spi_shift.v:81$680 ($add).
  creating $macc model for $flatten\shift.$verific$sub_14$spi_shift.v:81$682 ($sub).
  creating $macc model for $flatten\shift.$verific$sub_6$spi_shift.v:80$676 ($sub).
  creating $macc model for $flatten\shift.$verific$sub_7$spi_shift.v:80$677 ($sub).
  creating $alu model for $macc $flatten\shift.$verific$sub_7$spi_shift.v:80$677.
  creating $alu model for $macc $flatten\shift.$verific$sub_6$spi_shift.v:80$676.
  creating $alu model for $macc $flatten\shift.$verific$sub_14$spi_shift.v:81$682.
  creating $alu model for $macc $flatten\shift.$verific$add_12$spi_shift.v:81$680.
  creating $alu model for $macc $flatten\clgen.$verific$sub_12$spi_clgen.v:78$441.
  creating $alu cell for $flatten\clgen.$verific$sub_12$spi_clgen.v:78$441: $auto$alumacc.cc:485:replace_alu$2859
  creating $alu cell for $flatten\shift.$verific$add_12$spi_shift.v:81$680: $auto$alumacc.cc:485:replace_alu$2862
  creating $alu cell for $flatten\shift.$verific$sub_14$spi_shift.v:81$682: $auto$alumacc.cc:485:replace_alu$2865
  creating $alu cell for $flatten\shift.$verific$sub_6$spi_shift.v:80$676: $auto$alumacc.cc:485:replace_alu$2868
  creating $alu cell for $flatten\shift.$verific$sub_7$spi_shift.v:80$677: $auto$alumacc.cc:485:replace_alu$2871
  created 5 $alu and 0 $macc cells.

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_merge -nomux

3.56. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.57. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~22 debug messages>

yosys> opt_reduce

3.58. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.59. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.60. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.61. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..

yosys> opt_expr

3.63. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 1

yosys> stat

3.64. Printing statistics.

=== spi_top ===

   Number of wires:                603
   Number of wire bits:           2548
   Number of public wires:          72
   Number of public wire bits:     698
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                922
     $adff                           5
     $adffe                        139
     $alu                            5
     $and                           38
     $eq                             7
     $logic_not                      2
     $mux                          415
     $ne                            24
     $not                           10
     $or                             8
     $reduce_and                   134
     $reduce_bool                  131
     $reduce_or                      3
     $shl                            1


yosys> memory -nomap

3.65. Executing MEMORY pass.

yosys> opt_mem

3.65.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.65.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.65.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.65.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.65.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.65.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..

yosys> memory_share

3.65.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.65.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.65.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..

yosys> memory_collect

3.65.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.66. Printing statistics.

=== spi_top ===

   Number of wires:                603
   Number of wire bits:           2548
   Number of public wires:          72
   Number of public wire bits:     698
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                922
     $adff                           5
     $adffe                        139
     $alu                            5
     $and                           38
     $eq                             7
     $logic_not                      2
     $mux                          415
     $ne                            24
     $not                           10
     $or                             8
     $reduce_and                   134
     $reduce_bool                  131
     $reduce_or                      3
     $shl                            1


yosys> muxpack

3.67. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~222 debug messages>

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..

yosys> pmuxtree

3.69. Executing PMUXTREE pass.

yosys> muxpack

3.70. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~222 debug messages>

yosys> memory_map

3.71. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.72. Printing statistics.

=== spi_top ===

   Number of wires:                603
   Number of wire bits:           2548
   Number of public wires:          72
   Number of public wire bits:     698
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                922
     $adff                           5
     $adffe                        139
     $alu                            5
     $and                           38
     $eq                             7
     $logic_not                      2
     $mux                          415
     $ne                            24
     $not                           10
     $or                             8
     $reduce_and                   134
     $reduce_bool                  131
     $reduce_or                      3
     $shl                            1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.73. Executing TECHMAP pass (map to technology primitives).

3.73.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.73.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.73.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $ne.
Using template $paramod$a1665ef28c749ebcdbe9aecd466e644647b56463\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $or.
Using template $paramod$constmap:5090bc8fbcf3ae403956334bfa77f78b3de013ab$paramod$0b7ef1ec7ff4cd51af214180028bea8c50fdcd6a\_90_shift_ops_shr_shl_sshl_sshr for cells of type $shl.
Using template $paramod$dbcdc7e8aa1a4080cea2deda6fdc8772064f4d90\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $reduce_or.
Using template $paramod$403a3c2fa431a154c52a6a5429d7a6260b5d144f\_90_alu for cells of type $alu.
Using template $paramod$103b4016182df467cceab67bcf3e18e6361ec0fd\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000010000 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000111 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
No more expansions possible.
<suppressed ~3649 debug messages>

yosys> stat

3.74. Printing statistics.

=== spi_top ===

   Number of wires:               1593
   Number of wire bits:          12929
   Number of public wires:          72
   Number of public wire bits:     698
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3034
     $_AND_                        709
     $_DFFE_PP0P_                  178
     $_DFF_PP0_                     35
     $_DFF_PP1_                     16
     $_MUX_                       1332
     $_NOT_                         72
     $_OR_                         511
     $_XOR_                        181


yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
<suppressed ~252 debug messages>

yosys> opt_merge -nomux

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
<suppressed ~1608 debug messages>
Removed a total of 536 cells.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 42 unused cells and 807 unused wires.
<suppressed ~43 debug messages>

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
<suppressed ~509 debug messages>

yosys> techmap -map +/techmap.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_merge -nomux

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.98. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 139 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 1

yosys> abc -dff

3.101. Executing ABC pass (technology mapping using ABC).

3.101.1. Summary of detected clock domains:
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2848, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2835, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2822, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2809, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2796, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2783, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2770, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2757, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2744, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2731, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2718, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2705, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2692, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2679, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2666, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2640, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2627, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2614, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2601, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2588, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2575, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2549, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2536, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2523, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2510, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2497, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2484, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2471, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2458, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2445, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2432, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2419, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2406, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2393, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2380, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2367, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2354, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2341, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2328, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2315, arst=\wb_rst_i, srst={ }
  66 cells in clk=\wb_clk_i, en=$flatten\shift.$verific$n338$492, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1197, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1522, arst=\wb_rst_i, srst={ }
  90 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1173, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1180, arst=\wb_rst_i, srst={ }
  67 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$2851, arst=\wb_rst_i, srst={ }
  17 cells in clk=\wb_clk_i, en=$flatten\clgen.$verific$n118$407, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1535, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1210, arst=\wb_rst_i, srst={ }
  2 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1158, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1899, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1886, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1873, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1860, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1847, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1548, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1821, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1808, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1795, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1782, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2016, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2003, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1990, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1977, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1964, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1951, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1938, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1925, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2172, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2159, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2146, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2133, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2120, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2107, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2094, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2081, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2068, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2055, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2211, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2224, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2185, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2198, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2042, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2029, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1587, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1574, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1613, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1561, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1756, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1743, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1730, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1717, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1704, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1691, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1678, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1665, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1652, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1639, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1626, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1600, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2289, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2276, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2302, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2263, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2250, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$2237, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1496, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1769, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1483, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1470, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1457, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1444, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1431, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1418, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1405, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1392, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1366, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1353, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1340, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1327, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1314, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1236, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1223, arst=\wb_rst_i, srst={ }
  21 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1164, arst=\wb_rst_i, srst={ }
  16 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1509, arst=\wb_rst_i, srst={ }
  17 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:194:make_patterns_logic$1183, arst=\wb_rst_i, srst={ }
  63 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1170, arst=\wb_rst_i, srst={ }
  56 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1161, arst=\wb_rst_i, srst={ }
  251 cells in clk=\wb_clk_i, en={ }, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1912, arst=\wb_rst_i, srst={ }
  22 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1167, arst=\wb_rst_i, srst={ }
  15 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1301, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1249, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1288, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\wb_rst_i, srst={ }
  79 cells in clk=\wb_clk_i, en=$auto$opt_dff.cc:219:make_patterns_logic$1262, arst=\wb_rst_i, srst={ }

3.101.2. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2848, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.2.1. Executing ABC.

3.101.3. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2835, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.3.1. Executing ABC.

3.101.4. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2822, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.4.1. Executing ABC.

3.101.5. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2809, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.5.1. Executing ABC.

3.101.6. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2796, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.6.1. Executing ABC.

3.101.7. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2783, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.7.1. Executing ABC.

3.101.8. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2770, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.8.1. Executing ABC.

3.101.9. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2757, asynchronously reset by \wb_rst_i
Extracted 13 gates and 26 wires to a netlist network with 13 inputs and 8 outputs.

3.101.9.1. Executing ABC.

3.101.10. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2744, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.10.1. Executing ABC.

3.101.11. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2731, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.101.11.1. Executing ABC.

3.101.12. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2718, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.101.12.1. Executing ABC.

3.101.13. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2705, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.101.13.1. Executing ABC.

3.101.14. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2692, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.101.14.1. Executing ABC.

3.101.15. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2679, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.101.15.1. Executing ABC.

3.101.16. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2666, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.101.16.1. Executing ABC.

3.101.17. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 4 outputs.

3.101.17.1. Executing ABC.

3.101.18. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2640, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 13 inputs and 5 outputs.

3.101.18.1. Executing ABC.

3.101.19. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2627, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.19.1. Executing ABC.

3.101.20. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2614, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.20.1. Executing ABC.

3.101.21. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2601, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.21.1. Executing ABC.

3.101.22. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2588, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.22.1. Executing ABC.

3.101.23. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2575, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.23.1. Executing ABC.

3.101.24. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.24.1. Executing ABC.

3.101.25. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2549, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 5 outputs.

3.101.25.1. Executing ABC.

3.101.26. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2536, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 12 inputs and 7 outputs.

3.101.26.1. Executing ABC.

3.101.27. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2523, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 8 inputs and 3 outputs.

3.101.27.1. Executing ABC.

3.101.28. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2510, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.28.1. Executing ABC.

3.101.29. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2497, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 8 inputs and 3 outputs.

3.101.29.1. Executing ABC.

3.101.30. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2484, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.30.1. Executing ABC.

3.101.31. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2471, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 8 inputs and 3 outputs.

3.101.31.1. Executing ABC.

3.101.32. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2458, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.32.1. Executing ABC.

3.101.33. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2445, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 12 inputs and 5 outputs.

3.101.33.1. Executing ABC.

3.101.34. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2432, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.34.1. Executing ABC.

3.101.35. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2419, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.35.1. Executing ABC.

3.101.36. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2406, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.36.1. Executing ABC.

3.101.37. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2393, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.37.1. Executing ABC.

3.101.38. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2380, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.38.1. Executing ABC.

3.101.39. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2367, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.39.1. Executing ABC.

3.101.40. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2354, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.101.40.1. Executing ABC.

3.101.41. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2341, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 6 outputs.

3.101.41.1. Executing ABC.

3.101.42. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2328, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.42.1. Executing ABC.

3.101.43. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2315, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.43.1. Executing ABC.

3.101.44. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $flatten\shift.$verific$n338$492, asynchronously reset by \wb_rst_i
Extracted 66 gates and 139 wires to a netlist network with 73 inputs and 2 outputs.

3.101.44.1. Executing ABC.

3.101.45. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1197, asynchronously reset by \wb_rst_i
Extracted 14 gates and 33 wires to a netlist network with 18 inputs and 8 outputs.

3.101.45.1. Executing ABC.

3.101.46. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1522, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 15 inputs and 8 outputs.

3.101.46.1. Executing ABC.

3.101.47. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1173, asynchronously reset by \wb_rst_i
Extracted 90 gates and 150 wires to a netlist network with 60 inputs and 32 outputs.

3.101.47.1. Executing ABC.

3.101.48. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1180, asynchronously reset by \wb_rst_i
Extracted 9 gates and 18 wires to a netlist network with 8 inputs and 4 outputs.

3.101.48.1. Executing ABC.

3.101.49. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$2851, asynchronously reset by \wb_rst_i
Extracted 67 gates and 76 wires to a netlist network with 9 inputs and 30 outputs.

3.101.49.1. Executing ABC.

3.101.50. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $flatten\clgen.$verific$n118$407, asynchronously reset by \wb_rst_i
Extracted 17 gates and 31 wires to a netlist network with 14 inputs and 8 outputs.

3.101.50.1. Executing ABC.

3.101.51. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1535, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 15 inputs and 8 outputs.

3.101.51.1. Executing ABC.

3.101.52. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1210, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 3 outputs.

3.101.52.1. Executing ABC.

3.101.53. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1158, asynchronously reset by \wb_rst_i
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 2 outputs.

3.101.53.1. Executing ABC.

3.101.54. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1899, asynchronously reset by \wb_rst_i
Extracted 14 gates and 31 wires to a netlist network with 16 inputs and 10 outputs.

3.101.54.1. Executing ABC.

3.101.55. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1886, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.101.55.1. Executing ABC.

3.101.56. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1873, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 8 outputs.

3.101.56.1. Executing ABC.

3.101.57. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1860, asynchronously reset by \wb_rst_i
Extracted 12 gates and 29 wires to a netlist network with 16 inputs and 8 outputs.

3.101.57.1. Executing ABC.

3.101.58. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1847, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 6 outputs.

3.101.58.1. Executing ABC.

3.101.59. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1548, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 11 inputs and 6 outputs.

3.101.59.1. Executing ABC.

3.101.60. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \wb_rst_i
Extracted 11 gates and 27 wires to a netlist network with 15 inputs and 7 outputs.

3.101.60.1. Executing ABC.

3.101.61. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1821, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 7 outputs.

3.101.61.1. Executing ABC.

3.101.62. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1808, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.62.1. Executing ABC.

3.101.63. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1795, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.63.1. Executing ABC.

3.101.64. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1782, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.64.1. Executing ABC.

3.101.65. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2016, asynchronously reset by \wb_rst_i
Extracted 13 gates and 29 wires to a netlist network with 15 inputs and 9 outputs.

3.101.65.1. Executing ABC.

3.101.66. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2003, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.101.66.1. Executing ABC.

3.101.67. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1990, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.67.1. Executing ABC.

3.101.68. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1977, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.101.68.1. Executing ABC.

3.101.69. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1964, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.69.1. Executing ABC.

3.101.70. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1951, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.101.70.1. Executing ABC.

3.101.71. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1938, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.101.71.1. Executing ABC.

3.101.72. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1925, asynchronously reset by \wb_rst_i
Extracted 9 gates and 19 wires to a netlist network with 10 inputs and 4 outputs.

3.101.72.1. Executing ABC.

3.101.73. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2172, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.73.1. Executing ABC.

3.101.74. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2159, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.74.1. Executing ABC.

3.101.75. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2146, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.75.1. Executing ABC.

3.101.76. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2133, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.76.1. Executing ABC.

3.101.77. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2120, asynchronously reset by \wb_rst_i
Extracted 10 gates and 25 wires to a netlist network with 14 inputs and 4 outputs.

3.101.77.1. Executing ABC.

3.101.78. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2107, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.101.78.1. Executing ABC.

3.101.79. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2094, asynchronously reset by \wb_rst_i
Extracted 10 gates and 25 wires to a netlist network with 14 inputs and 4 outputs.

3.101.79.1. Executing ABC.

3.101.80. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2081, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 3 outputs.

3.101.80.1. Executing ABC.

3.101.81. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2068, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.101.81.1. Executing ABC.

3.101.82. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2055, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 9 inputs and 2 outputs.

3.101.82.1. Executing ABC.

3.101.83. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2211, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 13 inputs and 4 outputs.

3.101.83.1. Executing ABC.

3.101.84. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2224, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 10 inputs and 2 outputs.

3.101.84.1. Executing ABC.

3.101.85. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2185, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 5 outputs.

3.101.85.1. Executing ABC.

3.101.86. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2198, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 10 inputs and 3 outputs.

3.101.86.1. Executing ABC.

3.101.87. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2042, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.101.87.1. Executing ABC.

3.101.88. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2029, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 10 inputs and 3 outputs.

3.101.88.1. Executing ABC.

3.101.89. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1587, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 7 outputs.

3.101.89.1. Executing ABC.

3.101.90. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1574, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 7 outputs.

3.101.90.1. Executing ABC.

3.101.91. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1613, asynchronously reset by \wb_rst_i
Extracted 10 gates and 25 wires to a netlist network with 14 inputs and 4 outputs.

3.101.91.1. Executing ABC.

3.101.92. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1561, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 11 inputs and 6 outputs.

3.101.92.1. Executing ABC.

3.101.93. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1756, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.93.1. Executing ABC.

3.101.94. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1743, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.94.1. Executing ABC.

3.101.95. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1730, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.95.1. Executing ABC.

3.101.96. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1717, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 10 inputs and 3 outputs.

3.101.96.1. Executing ABC.

3.101.97. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1704, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.101.97.1. Executing ABC.

3.101.98. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1691, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 9 inputs and 2 outputs.

3.101.98.1. Executing ABC.

3.101.99. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1678, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.101.99.1. Executing ABC.

3.101.100. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1665, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 3 outputs.

3.101.100.1. Executing ABC.

3.101.101. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1652, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.101.101.1. Executing ABC.

3.101.102. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1639, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 9 inputs and 2 outputs.

3.101.102.1. Executing ABC.

3.101.103. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1626, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 10 inputs and 4 outputs.

3.101.103.1. Executing ABC.

3.101.104. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1600, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 14 inputs and 7 outputs.

3.101.104.1. Executing ABC.

3.101.105. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2289, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.105.1. Executing ABC.

3.101.106. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2276, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.106.1. Executing ABC.

3.101.107. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2302, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 8 inputs and 3 outputs.

3.101.107.1. Executing ABC.

3.101.108. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2263, asynchronously reset by \wb_rst_i
Extracted 10 gates and 21 wires to a netlist network with 10 inputs and 5 outputs.

3.101.108.1. Executing ABC.

3.101.109. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2250, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.109.1. Executing ABC.

3.101.110. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$2237, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 10 inputs and 4 outputs.

3.101.110.1. Executing ABC.

3.101.111. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1496, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.111.1. Executing ABC.

3.101.112. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1769, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 11 inputs and 3 outputs.

3.101.112.1. Executing ABC.

3.101.113. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1483, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 8 inputs and 3 outputs.

3.101.113.1. Executing ABC.

3.101.114. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1470, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.114.1. Executing ABC.

3.101.115. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1457, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 8 inputs and 3 outputs.

3.101.115.1. Executing ABC.

3.101.116. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1444, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 11 inputs and 5 outputs.

3.101.116.1. Executing ABC.

3.101.117. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1431, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 8 inputs and 3 outputs.

3.101.117.1. Executing ABC.

3.101.118. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1418, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 8 outputs.

3.101.118.1. Executing ABC.

3.101.119. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1405, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 4 outputs.

3.101.119.1. Executing ABC.

3.101.120. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1392, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.120.1. Executing ABC.

3.101.121. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.121.1. Executing ABC.

3.101.122. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1366, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.122.1. Executing ABC.

3.101.123. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1353, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.123.1. Executing ABC.

3.101.124. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1340, asynchronously reset by \wb_rst_i
Extracted 9 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.101.124.1. Executing ABC.

3.101.125. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1327, asynchronously reset by \wb_rst_i
Extracted 7 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.101.125.1. Executing ABC.

3.101.126. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1314, asynchronously reset by \wb_rst_i
Extracted 13 gates and 28 wires to a netlist network with 14 inputs and 7 outputs.

3.101.126.1. Executing ABC.

3.101.127. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1236, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 14 inputs and 6 outputs.

3.101.127.1. Executing ABC.

3.101.128. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1223, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 9 inputs and 2 outputs.

3.101.128.1. Executing ABC.

3.101.129. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1164, asynchronously reset by \wb_rst_i
Extracted 21 gates and 40 wires to a netlist network with 19 inputs and 21 outputs.

3.101.129.1. Executing ABC.

3.101.130. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1509, asynchronously reset by \wb_rst_i
Extracted 16 gates and 31 wires to a netlist network with 15 inputs and 6 outputs.

3.101.130.1. Executing ABC.

3.101.131. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$1183, asynchronously reset by \wb_rst_i
Extracted 17 gates and 30 wires to a netlist network with 13 inputs and 11 outputs.

3.101.131.1. Executing ABC.

3.101.132. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1170, asynchronously reset by \wb_rst_i
Extracted 63 gates and 92 wires to a netlist network with 29 inputs and 46 outputs.

3.101.132.1. Executing ABC.

3.101.133. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1161, asynchronously reset by \wb_rst_i
Extracted 56 gates and 81 wires to a netlist network with 25 inputs and 19 outputs.

3.101.133.1. Executing ABC.

3.101.134. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by \wb_rst_i
Extracted 251 gates and 366 wires to a netlist network with 114 inputs and 47 outputs.

3.101.134.1. Executing ABC.

3.101.135. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1912, asynchronously reset by \wb_rst_i
Extracted 14 gates and 30 wires to a netlist network with 15 inputs and 5 outputs.

3.101.135.1. Executing ABC.

3.101.136. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1167, asynchronously reset by \wb_rst_i
Extracted 22 gates and 37 wires to a netlist network with 15 inputs and 18 outputs.

3.101.136.1. Executing ABC.

3.101.137. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1301, asynchronously reset by \wb_rst_i
Extracted 15 gates and 31 wires to a netlist network with 15 inputs and 5 outputs.

3.101.137.1. Executing ABC.

3.101.138. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1249, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.101.138.1. Executing ABC.

3.101.139. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1288, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 13 inputs and 5 outputs.

3.101.139.1. Executing ABC.

3.101.140. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 9 inputs and 2 outputs.

3.101.140.1. Executing ABC.

3.101.141. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1262, asynchronously reset by \wb_rst_i
Extracted 79 gates and 166 wires to a netlist network with 86 inputs and 6 outputs.

3.101.141.1. Executing ABC.

yosys> abc -dff

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Summary of detected clock domains:
  9 cells in clk=\wb_clk_i, en=$abc$10220$auto$opt_dff.cc:219:make_patterns_logic$1431, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10151$auto$opt_dff.cc:219:make_patterns_logic$2237, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$10067$auto$opt_dff.cc:219:make_patterns_logic$1639, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9986$auto$opt_dff.cc:219:make_patterns_logic$1743, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$9899$auto$opt_dff.cc:219:make_patterns_logic$2198, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$9812$auto$opt_dff.cc:219:make_patterns_logic$2107, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$9734$auto$opt_dff.cc:219:make_patterns_logic$1951, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9752$auto$opt_dff.cc:219:make_patterns_logic$1925, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$9834$auto$opt_dff.cc:219:make_patterns_logic$2081, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$9920$auto$opt_dff.cc:219:make_patterns_logic$2029, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9792$auto$opt_dff.cc:219:make_patterns_logic$2133, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$9876$auto$opt_dff.cc:219:make_patterns_logic$2224, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$10241$auto$opt_dff.cc:219:make_patterns_logic$1405, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$10129$auto$opt_dff.cc:219:make_patterns_logic$2263, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9965$auto$opt_dff.cc:219:make_patterns_logic$1561, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$10192$auto$opt_dff.cc:219:make_patterns_logic$1470, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$10111$auto$opt_dff.cc:219:make_patterns_logic$2276, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$10026$auto$opt_dff.cc:219:make_patterns_logic$1691, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$9942$auto$opt_dff.cc:219:make_patterns_logic$1574, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$9855$auto$opt_dff.cc:219:make_patterns_logic$2055, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9773$auto$opt_dff.cc:219:make_patterns_logic$2159, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9698$auto$opt_dff.cc:219:make_patterns_logic$2003, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$8782$auto$opt_dff.cc:219:make_patterns_logic$2848, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$8814$auto$opt_dff.cc:219:make_patterns_logic$2809, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$8845$auto$opt_dff.cc:219:make_patterns_logic$2770, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$8881$auto$opt_dff.cc:219:make_patterns_logic$2731, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$10173$auto$opt_dff.cc:219:make_patterns_logic$1769, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$10046$auto$opt_dff.cc:219:make_patterns_logic$1665, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10210$auto$opt_dff.cc:219:make_patterns_logic$1444, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10087$auto$opt_dff.cc:219:make_patterns_logic$1600, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$10005$auto$opt_dff.cc:219:make_patterns_logic$1717, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$10141$auto$opt_dff.cc:219:make_patterns_logic$2250, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10056$auto$opt_dff.cc:219:make_patterns_logic$1652, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9976$auto$opt_dff.cc:219:make_patterns_logic$1756, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$9886$auto$opt_dff.cc:219:make_patterns_logic$2185, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$9801$auto$opt_dff.cc:219:make_patterns_logic$2120, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9724$auto$opt_dff.cc:219:make_patterns_logic$1964, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$9642$auto$opt_dff.cc:219:make_patterns_logic$1821, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$10886$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$8793$auto$opt_dff.cc:219:make_patterns_logic$2835, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$8803$auto$opt_dff.cc:219:make_patterns_logic$2822, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$8824$auto$opt_dff.cc:219:make_patterns_logic$2796, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$8835$auto$opt_dff.cc:219:make_patterns_logic$2783, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$8856$auto$opt_dff.cc:219:make_patterns_logic$2757, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$8871$auto$opt_dff.cc:219:make_patterns_logic$2744, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9630$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$10271$auto$opt_dff.cc:219:make_patterns_logic$1366, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$9665$auto$opt_dff.cc:219:make_patterns_logic$1795, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$8888$auto$opt_dff.cc:219:make_patterns_logic$2718, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$10324$auto$opt_dff.cc:219:make_patterns_logic$1236, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$8897$auto$opt_dff.cc:219:make_patterns_logic$2705, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$10309$auto$opt_dff.cc:219:make_patterns_logic$1314, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$9619$auto$opt_dff.cc:219:make_patterns_logic$1548, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9608$auto$opt_dff.cc:219:make_patterns_logic$1847, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9595$auto$opt_dff.cc:219:make_patterns_logic$1860, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10262$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$10228$auto$opt_dff.cc:219:make_patterns_logic$1418, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$10202$auto$opt_dff.cc:219:make_patterns_logic$1457, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$10161$auto$opt_dff.cc:219:make_patterns_logic$1496, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10121$auto$opt_dff.cc:219:make_patterns_logic$2302, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$10076$auto$opt_dff.cc:219:make_patterns_logic$1626, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10035$auto$opt_dff.cc:219:make_patterns_logic$1678, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9995$auto$opt_dff.cc:219:make_patterns_logic$1730, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9954$auto$opt_dff.cc:219:make_patterns_logic$1613, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$9909$auto$opt_dff.cc:219:make_patterns_logic$2042, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9864$auto$opt_dff.cc:219:make_patterns_logic$2211, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$9823$auto$opt_dff.cc:219:make_patterns_logic$2094, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9782$auto$opt_dff.cc:219:make_patterns_logic$2146, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9742$auto$opt_dff.cc:219:make_patterns_logic$1938, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9706$auto$opt_dff.cc:219:make_patterns_logic$1990, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$9655$auto$opt_dff.cc:219:make_patterns_logic$1808, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$10863$auto$opt_dff.cc:219:make_patterns_logic$1249, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$10300$auto$opt_dff.cc:219:make_patterns_logic$1327, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$10290$auto$opt_dff.cc:219:make_patterns_logic$1340, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$10847$auto$opt_dff.cc:219:make_patterns_logic$1301, arst=\wb_rst_i, srst={ }
  32 cells in clk=\wb_clk_i, en=$abc$10490$auto$opt_dff.cc:219:make_patterns_logic$1161, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$10337$auto$opt_dff.cc:219:make_patterns_logic$1223, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$10384$auto$opt_dff.cc:219:make_patterns_logic$1509, arst=\wb_rst_i, srst={ }
  47 cells in clk=\wb_clk_i, en=$abc$10419$auto$opt_dff.cc:219:make_patterns_logic$1170, arst=\wb_rst_i, srst={ }
  22 cells in clk=\wb_clk_i, en=$abc$10401$auto$opt_dff.cc:194:make_patterns_logic$1183, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$9582$auto$opt_dff.cc:219:make_patterns_logic$1873, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$9568$auto$opt_dff.cc:219:make_patterns_logic$1886, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$9553$auto$opt_dff.cc:219:make_patterns_logic$1899, arst=\wb_rst_i, srst={ }
  1 cells in clk=\wb_clk_i, en=$abc$9548$auto$opt_dff.cc:194:make_patterns_logic$1158, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$9538$auto$opt_dff.cc:219:make_patterns_logic$1210, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9525$auto$opt_dff.cc:219:make_patterns_logic$1535, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$9506$flatten\clgen.$verific$n118$407, arst=\wb_rst_i, srst={ }
  16 cells in clk=\wb_clk_i, en=$abc$9438$auto$opt_dff.cc:219:make_patterns_logic$1180, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9335$auto$opt_dff.cc:219:make_patterns_logic$1522, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9320$auto$opt_dff.cc:219:make_patterns_logic$1197, arst=\wb_rst_i, srst={ }
  112 cells in clk=\wb_clk_i, en=$abc$9206$flatten\shift.$verific$n338$492, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$9196$auto$opt_dff.cc:219:make_patterns_logic$2315, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9186$auto$opt_dff.cc:219:make_patterns_logic$2328, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9069$auto$opt_dff.cc:219:make_patterns_logic$2471, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9087$auto$opt_dff.cc:219:make_patterns_logic$2445, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9110$auto$opt_dff.cc:219:make_patterns_logic$2419, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$9131$auto$opt_dff.cc:219:make_patterns_logic$2393, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9152$auto$opt_dff.cc:219:make_patterns_logic$2367, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9173$auto$opt_dff.cc:219:make_patterns_logic$2341, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$8904$auto$opt_dff.cc:219:make_patterns_logic$2692, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$8913$auto$opt_dff.cc:219:make_patterns_logic$2679, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$8920$auto$opt_dff.cc:219:make_patterns_logic$2666, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$8929$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$8940$auto$opt_dff.cc:219:make_patterns_logic$2640, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$8951$auto$opt_dff.cc:219:make_patterns_logic$2627, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$8960$auto$opt_dff.cc:219:make_patterns_logic$2614, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$8970$auto$opt_dff.cc:219:make_patterns_logic$2601, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$8979$auto$opt_dff.cc:219:make_patterns_logic$2588, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$8989$auto$opt_dff.cc:219:make_patterns_logic$2575, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$8998$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$9008$auto$opt_dff.cc:219:make_patterns_logic$2549, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9021$auto$opt_dff.cc:219:make_patterns_logic$2536, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9033$auto$opt_dff.cc:219:make_patterns_logic$2523, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$9041$auto$opt_dff.cc:219:make_patterns_logic$2510, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9051$auto$opt_dff.cc:219:make_patterns_logic$2497, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9059$auto$opt_dff.cc:219:make_patterns_logic$2484, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$9077$auto$opt_dff.cc:219:make_patterns_logic$2458, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9099$auto$opt_dff.cc:219:make_patterns_logic$2432, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9120$auto$opt_dff.cc:219:make_patterns_logic$2406, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$9141$auto$opt_dff.cc:219:make_patterns_logic$2380, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$9162$auto$opt_dff.cc:219:make_patterns_logic$2354, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10794$auto$opt_dff.cc:219:make_patterns_logic$1912, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$9716$auto$opt_dff.cc:219:make_patterns_logic$1977, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$9684$auto$opt_dff.cc:219:make_patterns_logic$2016, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$10281$auto$opt_dff.cc:219:make_patterns_logic$1353, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$10874$auto$opt_dff.cc:219:make_patterns_logic$1288, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$10252$auto$opt_dff.cc:219:make_patterns_logic$1392, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$10184$auto$opt_dff.cc:219:make_patterns_logic$1483, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$10101$auto$opt_dff.cc:219:make_patterns_logic$2289, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$10015$auto$opt_dff.cc:219:make_patterns_logic$1704, arst=\wb_rst_i, srst={ }
  17 cells in clk=\wb_clk_i, en=$abc$9930$auto$opt_dff.cc:219:make_patterns_logic$1587, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$9844$auto$opt_dff.cc:219:make_patterns_logic$2068, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$9763$auto$opt_dff.cc:219:make_patterns_logic$2172, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$9674$auto$opt_dff.cc:219:make_patterns_logic$1782, arst=\wb_rst_i, srst={ }
  68 cells in clk=\wb_clk_i, en=$abc$9348$auto$opt_dff.cc:219:make_patterns_logic$1173, arst=\wb_rst_i, srst={ }
  63 cells in clk=\wb_clk_i, en=$abc$10531$auto$opt_dff.cc:194:make_patterns_logic$2851, arst=\wb_rst_i, srst={ }
  27 cells in clk=\wb_clk_i, en=$abc$10809$auto$opt_dff.cc:219:make_patterns_logic$1167, arst=\wb_rst_i, srst={ }
  28 cells in clk=\wb_clk_i, en=$abc$10346$auto$opt_dff.cc:219:make_patterns_logic$1164, arst=\wb_rst_i, srst={ }
  209 cells in clk=\wb_clk_i, en={ }, arst=\wb_rst_i, srst={ }
  153 cells in clk=\wb_clk_i, en=$abc$10895$auto$opt_dff.cc:219:make_patterns_logic$1262, arst=\wb_rst_i, srst={ }

3.102.2. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10220$auto$opt_dff.cc:219:make_patterns_logic$1431, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 12 inputs and 5 outputs.

3.102.2.1. Executing ABC.

3.102.3. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10151$auto$opt_dff.cc:219:make_patterns_logic$2237, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.102.3.1. Executing ABC.

3.102.4. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10067$auto$opt_dff.cc:219:make_patterns_logic$1639, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.102.4.1. Executing ABC.

3.102.5. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9986$auto$opt_dff.cc:219:make_patterns_logic$1743, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.5.1. Executing ABC.

3.102.6. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9899$auto$opt_dff.cc:219:make_patterns_logic$2198, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.102.6.1. Executing ABC.

3.102.7. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9812$auto$opt_dff.cc:219:make_patterns_logic$2107, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.102.7.1. Executing ABC.

3.102.8. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9734$auto$opt_dff.cc:219:make_patterns_logic$1951, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 7 outputs.

3.102.8.1. Executing ABC.

3.102.9. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9752$auto$opt_dff.cc:219:make_patterns_logic$1925, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.9.1. Executing ABC.

3.102.10. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9834$auto$opt_dff.cc:219:make_patterns_logic$2081, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 4 outputs.

3.102.10.1. Executing ABC.

3.102.11. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9920$auto$opt_dff.cc:219:make_patterns_logic$2029, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.102.11.1. Executing ABC.

3.102.12. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9792$auto$opt_dff.cc:219:make_patterns_logic$2133, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.12.1. Executing ABC.

3.102.13. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9876$auto$opt_dff.cc:219:make_patterns_logic$2224, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 5 outputs.

3.102.13.1. Executing ABC.

3.102.14. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10241$auto$opt_dff.cc:219:make_patterns_logic$1405, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 5 outputs.

3.102.14.1. Executing ABC.

3.102.15. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10129$auto$opt_dff.cc:219:make_patterns_logic$2263, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 5 outputs.

3.102.15.1. Executing ABC.

3.102.16. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9965$auto$opt_dff.cc:219:make_patterns_logic$1561, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.16.1. Executing ABC.

3.102.17. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10192$auto$opt_dff.cc:219:make_patterns_logic$1470, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 6 outputs.

3.102.17.1. Executing ABC.

3.102.18. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10111$auto$opt_dff.cc:219:make_patterns_logic$2276, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.102.18.1. Executing ABC.

3.102.19. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10026$auto$opt_dff.cc:219:make_patterns_logic$1691, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 4 outputs.

3.102.19.1. Executing ABC.

3.102.20. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9942$auto$opt_dff.cc:219:make_patterns_logic$1574, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.102.20.1. Executing ABC.

3.102.21. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9855$auto$opt_dff.cc:219:make_patterns_logic$2055, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.102.21.1. Executing ABC.

3.102.22. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9773$auto$opt_dff.cc:219:make_patterns_logic$2159, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.22.1. Executing ABC.

3.102.23. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9698$auto$opt_dff.cc:219:make_patterns_logic$2003, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.23.1. Executing ABC.

3.102.24. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8782$auto$opt_dff.cc:219:make_patterns_logic$2848, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.24.1. Executing ABC.

3.102.25. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8814$auto$opt_dff.cc:219:make_patterns_logic$2809, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.25.1. Executing ABC.

3.102.26. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8845$auto$opt_dff.cc:219:make_patterns_logic$2770, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.26.1. Executing ABC.

3.102.27. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8881$auto$opt_dff.cc:219:make_patterns_logic$2731, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.102.27.1. Executing ABC.

3.102.28. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10173$auto$opt_dff.cc:219:make_patterns_logic$1769, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 5 outputs.

3.102.28.1. Executing ABC.

3.102.29. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10046$auto$opt_dff.cc:219:make_patterns_logic$1665, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 12 inputs and 4 outputs.

3.102.29.1. Executing ABC.

3.102.30. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10210$auto$opt_dff.cc:219:make_patterns_logic$1444, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.102.30.1. Executing ABC.

3.102.31. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10087$auto$opt_dff.cc:219:make_patterns_logic$1600, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.31.1. Executing ABC.

3.102.32. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10005$auto$opt_dff.cc:219:make_patterns_logic$1717, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.102.32.1. Executing ABC.

3.102.33. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10141$auto$opt_dff.cc:219:make_patterns_logic$2250, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.102.33.1. Executing ABC.

3.102.34. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10056$auto$opt_dff.cc:219:make_patterns_logic$1652, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.102.34.1. Executing ABC.

3.102.35. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9976$auto$opt_dff.cc:219:make_patterns_logic$1756, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.102.35.1. Executing ABC.

3.102.36. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9886$auto$opt_dff.cc:219:make_patterns_logic$2185, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 3 outputs.

3.102.36.1. Executing ABC.

3.102.37. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9801$auto$opt_dff.cc:219:make_patterns_logic$2120, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 2 outputs.

3.102.37.1. Executing ABC.

3.102.38. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9724$auto$opt_dff.cc:219:make_patterns_logic$1964, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.102.38.1. Executing ABC.

3.102.39. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9642$auto$opt_dff.cc:219:make_patterns_logic$1821, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.102.39.1. Executing ABC.

3.102.40. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10886$auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.102.40.1. Executing ABC.

3.102.41. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8793$auto$opt_dff.cc:219:make_patterns_logic$2835, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.102.41.1. Executing ABC.

3.102.42. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8803$auto$opt_dff.cc:219:make_patterns_logic$2822, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.102.42.1. Executing ABC.

3.102.43. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8824$auto$opt_dff.cc:219:make_patterns_logic$2796, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.43.1. Executing ABC.

3.102.44. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8835$auto$opt_dff.cc:219:make_patterns_logic$2783, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.102.44.1. Executing ABC.

3.102.45. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8856$auto$opt_dff.cc:219:make_patterns_logic$2757, asynchronously reset by \wb_rst_i
Extracted 11 gates and 22 wires to a netlist network with 11 inputs and 6 outputs.

3.102.45.1. Executing ABC.

3.102.46. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8871$auto$opt_dff.cc:219:make_patterns_logic$2744, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.102.46.1. Executing ABC.

3.102.47. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9630$auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.102.47.1. Executing ABC.

3.102.48. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10271$auto$opt_dff.cc:219:make_patterns_logic$1366, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 5 outputs.

3.102.48.1. Executing ABC.

3.102.49. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9665$auto$opt_dff.cc:219:make_patterns_logic$1795, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.102.49.1. Executing ABC.

3.102.50. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8888$auto$opt_dff.cc:219:make_patterns_logic$2718, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.102.50.1. Executing ABC.

3.102.51. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10324$auto$opt_dff.cc:219:make_patterns_logic$1236, asynchronously reset by \wb_rst_i
Extracted 13 gates and 29 wires to a netlist network with 16 inputs and 7 outputs.

3.102.51.1. Executing ABC.

3.102.52. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8897$auto$opt_dff.cc:219:make_patterns_logic$2705, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.102.52.1. Executing ABC.

3.102.53. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10309$auto$opt_dff.cc:219:make_patterns_logic$1314, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.102.53.1. Executing ABC.

3.102.54. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9619$auto$opt_dff.cc:219:make_patterns_logic$1548, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 4 outputs.

3.102.54.1. Executing ABC.

3.102.55. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9608$auto$opt_dff.cc:219:make_patterns_logic$1847, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.102.55.1. Executing ABC.

3.102.56. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9595$auto$opt_dff.cc:219:make_patterns_logic$1860, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.102.56.1. Executing ABC.

3.102.57. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10262$auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.57.1. Executing ABC.

3.102.58. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10228$auto$opt_dff.cc:219:make_patterns_logic$1418, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.102.58.1. Executing ABC.

3.102.59. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10202$auto$opt_dff.cc:219:make_patterns_logic$1457, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.102.59.1. Executing ABC.

3.102.60. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10161$auto$opt_dff.cc:219:make_patterns_logic$1496, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.102.60.1. Executing ABC.

3.102.61. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10121$auto$opt_dff.cc:219:make_patterns_logic$2302, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.102.61.1. Executing ABC.

3.102.62. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10076$auto$opt_dff.cc:219:make_patterns_logic$1626, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 6 outputs.

3.102.62.1. Executing ABC.

3.102.63. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10035$auto$opt_dff.cc:219:make_patterns_logic$1678, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.102.63.1. Executing ABC.

3.102.64. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9995$auto$opt_dff.cc:219:make_patterns_logic$1730, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.102.64.1. Executing ABC.

3.102.65. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9954$auto$opt_dff.cc:219:make_patterns_logic$1613, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.102.65.1. Executing ABC.

3.102.66. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9909$auto$opt_dff.cc:219:make_patterns_logic$2042, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 5 outputs.

3.102.66.1. Executing ABC.

3.102.67. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9864$auto$opt_dff.cc:219:make_patterns_logic$2211, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 2 outputs.

3.102.67.1. Executing ABC.

3.102.68. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9823$auto$opt_dff.cc:219:make_patterns_logic$2094, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 6 outputs.

3.102.68.1. Executing ABC.

3.102.69. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9782$auto$opt_dff.cc:219:make_patterns_logic$2146, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.102.69.1. Executing ABC.

3.102.70. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9742$auto$opt_dff.cc:219:make_patterns_logic$1938, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.102.70.1. Executing ABC.

3.102.71. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9706$auto$opt_dff.cc:219:make_patterns_logic$1990, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.102.71.1. Executing ABC.

3.102.72. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9655$auto$opt_dff.cc:219:make_patterns_logic$1808, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 3 outputs.

3.102.72.1. Executing ABC.

3.102.73. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10863$auto$opt_dff.cc:219:make_patterns_logic$1249, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.102.73.1. Executing ABC.

3.102.74. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10300$auto$opt_dff.cc:219:make_patterns_logic$1327, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.102.74.1. Executing ABC.

3.102.75. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10290$auto$opt_dff.cc:219:make_patterns_logic$1340, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.102.75.1. Executing ABC.

3.102.76. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10847$auto$opt_dff.cc:219:make_patterns_logic$1301, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.102.76.1. Executing ABC.

3.102.77. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10490$auto$opt_dff.cc:219:make_patterns_logic$1161, asynchronously reset by \wb_rst_i
Extracted 32 gates and 57 wires to a netlist network with 25 inputs and 19 outputs.

3.102.77.1. Executing ABC.

3.102.78. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10337$auto$opt_dff.cc:219:make_patterns_logic$1223, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 6 outputs.

3.102.78.1. Executing ABC.

3.102.79. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10384$auto$opt_dff.cc:219:make_patterns_logic$1509, asynchronously reset by \wb_rst_i
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.102.79.1. Executing ABC.

3.102.80. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10419$auto$opt_dff.cc:219:make_patterns_logic$1170, asynchronously reset by \wb_rst_i
Extracted 47 gates and 79 wires to a netlist network with 32 inputs and 43 outputs.

3.102.80.1. Executing ABC.

3.102.81. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10401$auto$opt_dff.cc:194:make_patterns_logic$1183, asynchronously reset by \wb_rst_i
Extracted 22 gates and 35 wires to a netlist network with 13 inputs and 10 outputs.

3.102.81.1. Executing ABC.

3.102.82. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9582$auto$opt_dff.cc:219:make_patterns_logic$1873, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 6 outputs.

3.102.82.1. Executing ABC.

3.102.83. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9568$auto$opt_dff.cc:219:make_patterns_logic$1886, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 4 outputs.

3.102.83.1. Executing ABC.

3.102.84. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9553$auto$opt_dff.cc:219:make_patterns_logic$1899, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 7 outputs.

3.102.84.1. Executing ABC.

3.102.85. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9548$auto$opt_dff.cc:194:make_patterns_logic$1158, asynchronously reset by \wb_rst_i
Extracted 1 gates and 2 wires to a netlist network with 1 inputs and 1 outputs.

3.102.85.1. Executing ABC.

3.102.86. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9538$auto$opt_dff.cc:219:make_patterns_logic$1210, asynchronously reset by \wb_rst_i
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.102.86.1. Executing ABC.

3.102.87. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9525$auto$opt_dff.cc:219:make_patterns_logic$1535, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.102.87.1. Executing ABC.

3.102.88. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9506$flatten\clgen.$verific$n118$407, asynchronously reset by \wb_rst_i
Extracted 9 gates and 15 wires to a netlist network with 6 inputs and 6 outputs.

3.102.88.1. Executing ABC.

3.102.89. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9438$auto$opt_dff.cc:219:make_patterns_logic$1180, asynchronously reset by \wb_rst_i
Extracted 16 gates and 33 wires to a netlist network with 17 inputs and 6 outputs.

3.102.89.1. Executing ABC.

3.102.90. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9335$auto$opt_dff.cc:219:make_patterns_logic$1522, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.102.90.1. Executing ABC.

3.102.91. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9320$auto$opt_dff.cc:219:make_patterns_logic$1197, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.102.91.1. Executing ABC.

3.102.92. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9206$flatten\shift.$verific$n338$492, asynchronously reset by \wb_rst_i
Extracted 112 gates and 185 wires to a netlist network with 73 inputs and 2 outputs.

3.102.92.1. Executing ABC.

3.102.93. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9196$auto$opt_dff.cc:219:make_patterns_logic$2315, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 17 inputs and 7 outputs.

3.102.93.1. Executing ABC.

3.102.94. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9186$auto$opt_dff.cc:219:make_patterns_logic$2328, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.102.94.1. Executing ABC.

3.102.95. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9069$auto$opt_dff.cc:219:make_patterns_logic$2471, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.102.95.1. Executing ABC.

3.102.96. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9087$auto$opt_dff.cc:219:make_patterns_logic$2445, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.102.96.1. Executing ABC.

3.102.97. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9110$auto$opt_dff.cc:219:make_patterns_logic$2419, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.102.97.1. Executing ABC.

3.102.98. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9131$auto$opt_dff.cc:219:make_patterns_logic$2393, asynchronously reset by \wb_rst_i
Extracted 14 gates and 29 wires to a netlist network with 15 inputs and 9 outputs.

3.102.98.1. Executing ABC.

3.102.99. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9152$auto$opt_dff.cc:219:make_patterns_logic$2367, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.102.99.1. Executing ABC.

3.102.100. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9173$auto$opt_dff.cc:219:make_patterns_logic$2341, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.102.100.1. Executing ABC.

3.102.101. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8904$auto$opt_dff.cc:219:make_patterns_logic$2692, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.102.101.1. Executing ABC.

3.102.102. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8913$auto$opt_dff.cc:219:make_patterns_logic$2679, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.102.102.1. Executing ABC.

3.102.103. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8920$auto$opt_dff.cc:219:make_patterns_logic$2666, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.102.103.1. Executing ABC.

3.102.104. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8929$auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 7 outputs.

3.102.104.1. Executing ABC.

3.102.105. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8940$auto$opt_dff.cc:219:make_patterns_logic$2640, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.102.105.1. Executing ABC.

3.102.106. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8951$auto$opt_dff.cc:219:make_patterns_logic$2627, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 8 outputs.

3.102.106.1. Executing ABC.

3.102.107. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8960$auto$opt_dff.cc:219:make_patterns_logic$2614, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 7 outputs.

3.102.107.1. Executing ABC.

3.102.108. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8970$auto$opt_dff.cc:219:make_patterns_logic$2601, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.102.108.1. Executing ABC.

3.102.109. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8979$auto$opt_dff.cc:219:make_patterns_logic$2588, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 17 inputs and 8 outputs.

3.102.109.1. Executing ABC.

3.102.110. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8989$auto$opt_dff.cc:219:make_patterns_logic$2575, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.102.110.1. Executing ABC.

3.102.111. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$8998$auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 7 outputs.

3.102.111.1. Executing ABC.

3.102.112. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9008$auto$opt_dff.cc:219:make_patterns_logic$2549, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 5 outputs.

3.102.112.1. Executing ABC.

3.102.113. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9021$auto$opt_dff.cc:219:make_patterns_logic$2536, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.102.113.1. Executing ABC.

3.102.114. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9033$auto$opt_dff.cc:219:make_patterns_logic$2523, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.102.114.1. Executing ABC.

3.102.115. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9041$auto$opt_dff.cc:219:make_patterns_logic$2510, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.102.115.1. Executing ABC.

3.102.116. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9051$auto$opt_dff.cc:219:make_patterns_logic$2497, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.102.116.1. Executing ABC.

3.102.117. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9059$auto$opt_dff.cc:219:make_patterns_logic$2484, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.102.117.1. Executing ABC.

3.102.118. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9077$auto$opt_dff.cc:219:make_patterns_logic$2458, asynchronously reset by \wb_rst_i
Extracted 10 gates and 22 wires to a netlist network with 12 inputs and 5 outputs.

3.102.118.1. Executing ABC.

3.102.119. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9099$auto$opt_dff.cc:219:make_patterns_logic$2432, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.102.119.1. Executing ABC.

3.102.120. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9120$auto$opt_dff.cc:219:make_patterns_logic$2406, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.102.120.1. Executing ABC.

3.102.121. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9141$auto$opt_dff.cc:219:make_patterns_logic$2380, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.102.121.1. Executing ABC.

3.102.122. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9162$auto$opt_dff.cc:219:make_patterns_logic$2354, asynchronously reset by \wb_rst_i
Extracted 9 gates and 19 wires to a netlist network with 10 inputs and 4 outputs.

3.102.122.1. Executing ABC.

3.102.123. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10794$auto$opt_dff.cc:219:make_patterns_logic$1912, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.102.123.1. Executing ABC.

3.102.124. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9716$auto$opt_dff.cc:219:make_patterns_logic$1977, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.102.124.1. Executing ABC.

3.102.125. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9684$auto$opt_dff.cc:219:make_patterns_logic$2016, asynchronously reset by \wb_rst_i
Extracted 13 gates and 27 wires to a netlist network with 14 inputs and 8 outputs.

3.102.125.1. Executing ABC.

3.102.126. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10281$auto$opt_dff.cc:219:make_patterns_logic$1353, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.102.126.1. Executing ABC.

3.102.127. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10874$auto$opt_dff.cc:219:make_patterns_logic$1288, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 6 outputs.

3.102.127.1. Executing ABC.

3.102.128. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10252$auto$opt_dff.cc:219:make_patterns_logic$1392, asynchronously reset by \wb_rst_i
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 6 outputs.

3.102.128.1. Executing ABC.

3.102.129. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10184$auto$opt_dff.cc:219:make_patterns_logic$1483, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 9 outputs.

3.102.129.1. Executing ABC.

3.102.130. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10101$auto$opt_dff.cc:219:make_patterns_logic$2289, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 5 outputs.

3.102.130.1. Executing ABC.

3.102.131. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10015$auto$opt_dff.cc:219:make_patterns_logic$1704, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.102.131.1. Executing ABC.

3.102.132. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9930$auto$opt_dff.cc:219:make_patterns_logic$1587, asynchronously reset by \wb_rst_i
Extracted 17 gates and 32 wires to a netlist network with 15 inputs and 6 outputs.

3.102.132.1. Executing ABC.

3.102.133. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9844$auto$opt_dff.cc:219:make_patterns_logic$2068, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 6 outputs.

3.102.133.1. Executing ABC.

3.102.134. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9763$auto$opt_dff.cc:219:make_patterns_logic$2172, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 4 outputs.

3.102.134.1. Executing ABC.

3.102.135. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9674$auto$opt_dff.cc:219:make_patterns_logic$1782, asynchronously reset by \wb_rst_i
Extracted 14 gates and 29 wires to a netlist network with 15 inputs and 6 outputs.

3.102.135.1. Executing ABC.

3.102.136. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$9348$auto$opt_dff.cc:219:make_patterns_logic$1173, asynchronously reset by \wb_rst_i
Extracted 68 gates and 122 wires to a netlist network with 54 inputs and 28 outputs.

3.102.136.1. Executing ABC.

3.102.137. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10531$auto$opt_dff.cc:194:make_patterns_logic$2851, asynchronously reset by \wb_rst_i
Extracted 63 gates and 79 wires to a netlist network with 16 inputs and 34 outputs.

3.102.137.1. Executing ABC.

3.102.138. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10809$auto$opt_dff.cc:219:make_patterns_logic$1167, asynchronously reset by \wb_rst_i
Extracted 27 gates and 42 wires to a netlist network with 15 inputs and 21 outputs.

3.102.138.1. Executing ABC.

3.102.139. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10346$auto$opt_dff.cc:219:make_patterns_logic$1164, asynchronously reset by \wb_rst_i
Extracted 28 gates and 46 wires to a netlist network with 18 inputs and 22 outputs.

3.102.139.1. Executing ABC.

3.102.140. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by \wb_rst_i
Extracted 209 gates and 323 wires to a netlist network with 114 inputs and 48 outputs.

3.102.140.1. Executing ABC.

3.102.141. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$10895$auto$opt_dff.cc:219:make_patterns_logic$1262, asynchronously reset by \wb_rst_i
Extracted 153 gates and 238 wires to a netlist network with 85 inputs and 5 outputs.

3.102.141.1. Executing ABC.

yosys> abc -dff

3.103. Executing ABC pass (technology mapping using ABC).

3.103.1. Summary of detected clock domains:
  9 cells in clk=\wb_clk_i, en=$abc$11051$abc$10220$auto$opt_dff.cc:219:make_patterns_logic$1431, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11061$abc$10151$auto$opt_dff.cc:219:make_patterns_logic$2237, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11070$abc$10067$auto$opt_dff.cc:219:make_patterns_logic$1639, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11083$abc$9986$auto$opt_dff.cc:219:make_patterns_logic$1743, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$11093$abc$9899$auto$opt_dff.cc:219:make_patterns_logic$2198, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11103$abc$9812$auto$opt_dff.cc:219:make_patterns_logic$2107, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$11115$abc$9734$auto$opt_dff.cc:219:make_patterns_logic$1951, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11128$abc$9752$auto$opt_dff.cc:219:make_patterns_logic$1925, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11137$abc$9834$auto$opt_dff.cc:219:make_patterns_logic$2081, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11148$abc$9920$auto$opt_dff.cc:219:make_patterns_logic$2029, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11161$abc$9792$auto$opt_dff.cc:219:make_patterns_logic$2133, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11171$abc$9876$auto$opt_dff.cc:219:make_patterns_logic$2224, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11184$abc$10241$auto$opt_dff.cc:219:make_patterns_logic$1405, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11196$abc$10129$auto$opt_dff.cc:219:make_patterns_logic$2263, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11208$abc$9965$auto$opt_dff.cc:219:make_patterns_logic$1561, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11217$abc$10192$auto$opt_dff.cc:219:make_patterns_logic$1470, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11228$abc$10111$auto$opt_dff.cc:219:make_patterns_logic$2276, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$11236$abc$10026$auto$opt_dff.cc:219:make_patterns_logic$1691, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$11247$abc$9942$auto$opt_dff.cc:219:make_patterns_logic$1574, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11254$abc$9855$auto$opt_dff.cc:219:make_patterns_logic$2055, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11267$abc$9773$auto$opt_dff.cc:219:make_patterns_logic$2159, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11277$abc$9698$auto$opt_dff.cc:219:make_patterns_logic$2003, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11286$abc$8782$auto$opt_dff.cc:219:make_patterns_logic$2848, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11295$abc$8814$auto$opt_dff.cc:219:make_patterns_logic$2809, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11304$abc$8845$auto$opt_dff.cc:219:make_patterns_logic$2770, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11313$abc$8881$auto$opt_dff.cc:219:make_patterns_logic$2731, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11322$abc$10173$auto$opt_dff.cc:219:make_patterns_logic$1769, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$11335$abc$10046$auto$opt_dff.cc:219:make_patterns_logic$1665, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11346$abc$10210$auto$opt_dff.cc:219:make_patterns_logic$1444, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11356$abc$10087$auto$opt_dff.cc:219:make_patterns_logic$1600, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11365$abc$10005$auto$opt_dff.cc:219:make_patterns_logic$1717, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11377$abc$10141$auto$opt_dff.cc:219:make_patterns_logic$2250, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11385$abc$10056$auto$opt_dff.cc:219:make_patterns_logic$1652, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11395$abc$9976$auto$opt_dff.cc:219:make_patterns_logic$1756, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$11403$abc$9886$auto$opt_dff.cc:219:make_patterns_logic$2185, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$11414$abc$9801$auto$opt_dff.cc:219:make_patterns_logic$2120, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11423$abc$9724$auto$opt_dff.cc:219:make_patterns_logic$1964, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$11433$abc$9642$auto$opt_dff.cc:219:make_patterns_logic$1821, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11442$abc$10886$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$11454$abc$8793$auto$opt_dff.cc:219:make_patterns_logic$2835, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11461$abc$8803$auto$opt_dff.cc:219:make_patterns_logic$2822, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11469$abc$8824$auto$opt_dff.cc:219:make_patterns_logic$2796, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11478$abc$8835$auto$opt_dff.cc:219:make_patterns_logic$2783, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11486$abc$8856$auto$opt_dff.cc:219:make_patterns_logic$2757, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$11499$abc$8871$auto$opt_dff.cc:219:make_patterns_logic$2744, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11506$abc$9630$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11516$abc$10271$auto$opt_dff.cc:219:make_patterns_logic$1366, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$11527$abc$9665$auto$opt_dff.cc:219:make_patterns_logic$1795, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$11539$abc$8888$auto$opt_dff.cc:219:make_patterns_logic$2718, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$11548$abc$10324$auto$opt_dff.cc:219:make_patterns_logic$1236, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$11562$abc$8897$auto$opt_dff.cc:219:make_patterns_logic$2705, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$11569$abc$10309$auto$opt_dff.cc:219:make_patterns_logic$1314, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$11579$abc$9619$auto$opt_dff.cc:219:make_patterns_logic$1548, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11588$abc$9608$auto$opt_dff.cc:219:make_patterns_logic$1847, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11598$abc$9595$auto$opt_dff.cc:219:make_patterns_logic$1860, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11606$abc$10262$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11616$abc$10228$auto$opt_dff.cc:219:make_patterns_logic$1418, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$11624$abc$10202$auto$opt_dff.cc:219:make_patterns_logic$1457, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$11631$abc$10161$auto$opt_dff.cc:219:make_patterns_logic$1496, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11643$abc$10121$auto$opt_dff.cc:219:make_patterns_logic$2302, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11652$abc$10076$auto$opt_dff.cc:219:make_patterns_logic$1626, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11665$abc$10035$auto$opt_dff.cc:219:make_patterns_logic$1678, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11675$abc$9995$auto$opt_dff.cc:219:make_patterns_logic$1730, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11683$abc$9954$auto$opt_dff.cc:219:make_patterns_logic$1613, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$11693$abc$9909$auto$opt_dff.cc:219:make_patterns_logic$2042, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$11705$abc$9864$auto$opt_dff.cc:219:make_patterns_logic$2211, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11715$abc$9823$auto$opt_dff.cc:219:make_patterns_logic$2094, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11728$abc$9782$auto$opt_dff.cc:219:make_patterns_logic$2146, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11736$abc$9742$auto$opt_dff.cc:219:make_patterns_logic$1938, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$11744$abc$9706$auto$opt_dff.cc:219:make_patterns_logic$1990, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$11753$abc$9655$auto$opt_dff.cc:219:make_patterns_logic$1808, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11762$abc$10863$auto$opt_dff.cc:219:make_patterns_logic$1249, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$11775$abc$10300$auto$opt_dff.cc:219:make_patterns_logic$1327, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$11785$abc$10290$auto$opt_dff.cc:219:make_patterns_logic$1340, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$11794$abc$10847$auto$opt_dff.cc:219:make_patterns_logic$1301, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$11847$abc$10337$auto$opt_dff.cc:219:make_patterns_logic$1223, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$11860$abc$10384$auto$opt_dff.cc:219:make_patterns_logic$1509, arst=\wb_rst_i, srst={ }
  15 cells in clk=\wb_clk_i, en=$abc$11937$abc$10401$auto$opt_dff.cc:194:make_patterns_logic$1183, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$11954$abc$9582$auto$opt_dff.cc:219:make_patterns_logic$1873, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$11965$abc$9568$auto$opt_dff.cc:219:make_patterns_logic$1886, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$11974$abc$9553$auto$opt_dff.cc:219:make_patterns_logic$1899, arst=\wb_rst_i, srst={ }
  4 cells in clk=\wb_clk_i, en=$abc$12864$abc$9548$auto$opt_dff.cc:194:make_patterns_logic$1158, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$11991$abc$9538$auto$opt_dff.cc:219:make_patterns_logic$1210, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12007$abc$9525$auto$opt_dff.cc:219:make_patterns_logic$1535, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$12015$abc$9506$flatten\clgen.$verific$n118$407, arst=\wb_rst_i, srst={ }
  55 cells in clk=\wb_clk_i, en=$abc$11876$abc$10419$auto$opt_dff.cc:219:make_patterns_logic$1170, arst=\wb_rst_i, srst={ }
  17 cells in clk=\wb_clk_i, en=$abc$12026$abc$9438$auto$opt_dff.cc:219:make_patterns_logic$1180, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12044$abc$9335$auto$opt_dff.cc:219:make_patterns_logic$1522, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12052$abc$9320$auto$opt_dff.cc:219:make_patterns_logic$1197, arst=\wb_rst_i, srst={ }
  89 cells in clk=\wb_clk_i, en=$abc$12062$abc$9206$flatten\shift.$verific$n338$492, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$12153$abc$9196$auto$opt_dff.cc:219:make_patterns_logic$2315, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12167$abc$9186$auto$opt_dff.cc:219:make_patterns_logic$2328, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12177$abc$9069$auto$opt_dff.cc:219:make_patterns_logic$2471, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12186$abc$9087$auto$opt_dff.cc:219:make_patterns_logic$2445, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12195$abc$9110$auto$opt_dff.cc:219:make_patterns_logic$2419, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$12205$abc$9131$auto$opt_dff.cc:219:make_patterns_logic$2393, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12219$abc$9152$auto$opt_dff.cc:219:make_patterns_logic$2367, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12229$abc$9173$auto$opt_dff.cc:219:make_patterns_logic$2341, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$12239$abc$8904$auto$opt_dff.cc:219:make_patterns_logic$2692, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12248$abc$8913$auto$opt_dff.cc:219:make_patterns_logic$2679, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$12258$abc$8920$auto$opt_dff.cc:219:make_patterns_logic$2666, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$12267$abc$8929$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$12281$abc$8940$auto$opt_dff.cc:219:make_patterns_logic$2640, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$12293$abc$8951$auto$opt_dff.cc:219:make_patterns_logic$2627, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$12307$abc$8960$auto$opt_dff.cc:219:make_patterns_logic$2614, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$12320$abc$8970$auto$opt_dff.cc:219:make_patterns_logic$2601, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$12332$abc$8979$auto$opt_dff.cc:219:make_patterns_logic$2588, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$12346$abc$8989$auto$opt_dff.cc:219:make_patterns_logic$2575, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$12355$abc$8998$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$12368$abc$9008$auto$opt_dff.cc:219:make_patterns_logic$2549, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12381$abc$9021$auto$opt_dff.cc:219:make_patterns_logic$2536, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12391$abc$9033$auto$opt_dff.cc:219:make_patterns_logic$2523, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12399$abc$9041$auto$opt_dff.cc:219:make_patterns_logic$2510, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12409$abc$9051$auto$opt_dff.cc:219:make_patterns_logic$2497, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12417$abc$9059$auto$opt_dff.cc:219:make_patterns_logic$2484, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$12425$abc$9077$auto$opt_dff.cc:219:make_patterns_logic$2458, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12437$abc$9099$auto$opt_dff.cc:219:make_patterns_logic$2432, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12445$abc$9120$auto$opt_dff.cc:219:make_patterns_logic$2406, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$12453$abc$9141$auto$opt_dff.cc:219:make_patterns_logic$2380, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$12460$abc$9162$auto$opt_dff.cc:219:make_patterns_logic$2354, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$12471$abc$10794$auto$opt_dff.cc:219:make_patterns_logic$1912, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$12481$abc$9716$auto$opt_dff.cc:219:make_patterns_logic$1977, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$12489$abc$9684$auto$opt_dff.cc:219:make_patterns_logic$2016, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$12504$abc$10281$auto$opt_dff.cc:219:make_patterns_logic$1353, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$12513$abc$10874$auto$opt_dff.cc:219:make_patterns_logic$1288, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$12526$abc$10252$auto$opt_dff.cc:219:make_patterns_logic$1392, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$12540$abc$10184$auto$opt_dff.cc:219:make_patterns_logic$1483, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$12554$abc$10101$auto$opt_dff.cc:219:make_patterns_logic$2289, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$12568$abc$10015$auto$opt_dff.cc:219:make_patterns_logic$1704, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$12578$abc$9930$auto$opt_dff.cc:219:make_patterns_logic$1587, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$12595$abc$9844$auto$opt_dff.cc:219:make_patterns_logic$2068, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$12608$abc$9763$auto$opt_dff.cc:219:make_patterns_logic$2172, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$12619$abc$9674$auto$opt_dff.cc:219:make_patterns_logic$1782, arst=\wb_rst_i, srst={ }
  76 cells in clk=\wb_clk_i, en=$abc$12635$abc$9348$auto$opt_dff.cc:219:make_patterns_logic$1173, arst=\wb_rst_i, srst={ }
  31 cells in clk=\wb_clk_i, en=$abc$11806$abc$10490$auto$opt_dff.cc:219:make_patterns_logic$1161, arst=\wb_rst_i, srst={ }
  50 cells in clk=\wb_clk_i, en=$abc$12718$abc$10531$auto$opt_dff.cc:194:make_patterns_logic$2851, arst=\wb_rst_i, srst={ }
  25 cells in clk=\wb_clk_i, en=$abc$12784$abc$10809$auto$opt_dff.cc:219:make_patterns_logic$1167, arst=\wb_rst_i, srst={ }
  27 cells in clk=\wb_clk_i, en=$abc$12822$abc$10346$auto$opt_dff.cc:219:make_patterns_logic$1164, arst=\wb_rst_i, srst={ }
  208 cells in clk=\wb_clk_i, en={ }, arst=\wb_rst_i, srst={ }
  142 cells in clk=\wb_clk_i, en=$abc$13111$abc$10895$auto$opt_dff.cc:219:make_patterns_logic$1262, arst=\wb_rst_i, srst={ }

3.103.2. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11051$abc$10220$auto$opt_dff.cc:219:make_patterns_logic$1431, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 12 inputs and 5 outputs.

3.103.2.1. Executing ABC.

3.103.3. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11061$abc$10151$auto$opt_dff.cc:219:make_patterns_logic$2237, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.103.3.1. Executing ABC.

3.103.4. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11070$abc$10067$auto$opt_dff.cc:219:make_patterns_logic$1639, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.103.4.1. Executing ABC.

3.103.5. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11083$abc$9986$auto$opt_dff.cc:219:make_patterns_logic$1743, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.5.1. Executing ABC.

3.103.6. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11093$abc$9899$auto$opt_dff.cc:219:make_patterns_logic$2198, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.103.6.1. Executing ABC.

3.103.7. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11103$abc$9812$auto$opt_dff.cc:219:make_patterns_logic$2107, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.103.7.1. Executing ABC.

3.103.8. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11115$abc$9734$auto$opt_dff.cc:219:make_patterns_logic$1951, asynchronously reset by \wb_rst_i
Extracted 13 gates and 29 wires to a netlist network with 16 inputs and 7 outputs.

3.103.8.1. Executing ABC.

3.103.9. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11128$abc$9752$auto$opt_dff.cc:219:make_patterns_logic$1925, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.9.1. Executing ABC.

3.103.10. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11137$abc$9834$auto$opt_dff.cc:219:make_patterns_logic$2081, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.103.10.1. Executing ABC.

3.103.11. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11148$abc$9920$auto$opt_dff.cc:219:make_patterns_logic$2029, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.103.11.1. Executing ABC.

3.103.12. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11161$abc$9792$auto$opt_dff.cc:219:make_patterns_logic$2133, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.12.1. Executing ABC.

3.103.13. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11171$abc$9876$auto$opt_dff.cc:219:make_patterns_logic$2224, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 5 outputs.

3.103.13.1. Executing ABC.

3.103.14. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11184$abc$10241$auto$opt_dff.cc:219:make_patterns_logic$1405, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 5 outputs.

3.103.14.1. Executing ABC.

3.103.15. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11196$abc$10129$auto$opt_dff.cc:219:make_patterns_logic$2263, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 5 outputs.

3.103.15.1. Executing ABC.

3.103.16. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11208$abc$9965$auto$opt_dff.cc:219:make_patterns_logic$1561, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.16.1. Executing ABC.

3.103.17. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11217$abc$10192$auto$opt_dff.cc:219:make_patterns_logic$1470, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.103.17.1. Executing ABC.

3.103.18. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11228$abc$10111$auto$opt_dff.cc:219:make_patterns_logic$2276, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.103.18.1. Executing ABC.

3.103.19. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11236$abc$10026$auto$opt_dff.cc:219:make_patterns_logic$1691, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 4 outputs.

3.103.19.1. Executing ABC.

3.103.20. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11247$abc$9942$auto$opt_dff.cc:219:make_patterns_logic$1574, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.103.20.1. Executing ABC.

3.103.21. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11254$abc$9855$auto$opt_dff.cc:219:make_patterns_logic$2055, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.103.21.1. Executing ABC.

3.103.22. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11267$abc$9773$auto$opt_dff.cc:219:make_patterns_logic$2159, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.22.1. Executing ABC.

3.103.23. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11277$abc$9698$auto$opt_dff.cc:219:make_patterns_logic$2003, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.23.1. Executing ABC.

3.103.24. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11286$abc$8782$auto$opt_dff.cc:219:make_patterns_logic$2848, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.24.1. Executing ABC.

3.103.25. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11295$abc$8814$auto$opt_dff.cc:219:make_patterns_logic$2809, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.25.1. Executing ABC.

3.103.26. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11304$abc$8845$auto$opt_dff.cc:219:make_patterns_logic$2770, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.26.1. Executing ABC.

3.103.27. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11313$abc$8881$auto$opt_dff.cc:219:make_patterns_logic$2731, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.103.27.1. Executing ABC.

3.103.28. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11322$abc$10173$auto$opt_dff.cc:219:make_patterns_logic$1769, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 5 outputs.

3.103.28.1. Executing ABC.

3.103.29. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11335$abc$10046$auto$opt_dff.cc:219:make_patterns_logic$1665, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 12 inputs and 4 outputs.

3.103.29.1. Executing ABC.

3.103.30. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11346$abc$10210$auto$opt_dff.cc:219:make_patterns_logic$1444, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.103.30.1. Executing ABC.

3.103.31. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11356$abc$10087$auto$opt_dff.cc:219:make_patterns_logic$1600, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.31.1. Executing ABC.

3.103.32. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11365$abc$10005$auto$opt_dff.cc:219:make_patterns_logic$1717, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.103.32.1. Executing ABC.

3.103.33. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11377$abc$10141$auto$opt_dff.cc:219:make_patterns_logic$2250, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.103.33.1. Executing ABC.

3.103.34. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11385$abc$10056$auto$opt_dff.cc:219:make_patterns_logic$1652, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.103.34.1. Executing ABC.

3.103.35. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11395$abc$9976$auto$opt_dff.cc:219:make_patterns_logic$1756, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.103.35.1. Executing ABC.

3.103.36. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11403$abc$9886$auto$opt_dff.cc:219:make_patterns_logic$2185, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 3 outputs.

3.103.36.1. Executing ABC.

3.103.37. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11414$abc$9801$auto$opt_dff.cc:219:make_patterns_logic$2120, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 2 outputs.

3.103.37.1. Executing ABC.

3.103.38. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11423$abc$9724$auto$opt_dff.cc:219:make_patterns_logic$1964, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.103.38.1. Executing ABC.

3.103.39. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11433$abc$9642$auto$opt_dff.cc:219:make_patterns_logic$1821, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.103.39.1. Executing ABC.

3.103.40. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11442$abc$10886$auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.103.40.1. Executing ABC.

3.103.41. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11454$abc$8793$auto$opt_dff.cc:219:make_patterns_logic$2835, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.103.41.1. Executing ABC.

3.103.42. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11461$abc$8803$auto$opt_dff.cc:219:make_patterns_logic$2822, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.103.42.1. Executing ABC.

3.103.43. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11469$abc$8824$auto$opt_dff.cc:219:make_patterns_logic$2796, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.43.1. Executing ABC.

3.103.44. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11478$abc$8835$auto$opt_dff.cc:219:make_patterns_logic$2783, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.103.44.1. Executing ABC.

3.103.45. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11486$abc$8856$auto$opt_dff.cc:219:make_patterns_logic$2757, asynchronously reset by \wb_rst_i
Extracted 11 gates and 22 wires to a netlist network with 11 inputs and 6 outputs.

3.103.45.1. Executing ABC.

3.103.46. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11499$abc$8871$auto$opt_dff.cc:219:make_patterns_logic$2744, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.103.46.1. Executing ABC.

3.103.47. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11506$abc$9630$auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.103.47.1. Executing ABC.

3.103.48. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11516$abc$10271$auto$opt_dff.cc:219:make_patterns_logic$1366, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.103.48.1. Executing ABC.

3.103.49. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11527$abc$9665$auto$opt_dff.cc:219:make_patterns_logic$1795, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.103.49.1. Executing ABC.

3.103.50. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11539$abc$8888$auto$opt_dff.cc:219:make_patterns_logic$2718, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.103.50.1. Executing ABC.

3.103.51. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11548$abc$10324$auto$opt_dff.cc:219:make_patterns_logic$1236, asynchronously reset by \wb_rst_i
Extracted 14 gates and 29 wires to a netlist network with 15 inputs and 8 outputs.

3.103.51.1. Executing ABC.

3.103.52. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11562$abc$8897$auto$opt_dff.cc:219:make_patterns_logic$2705, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.103.52.1. Executing ABC.

3.103.53. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11569$abc$10309$auto$opt_dff.cc:219:make_patterns_logic$1314, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.103.53.1. Executing ABC.

3.103.54. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11579$abc$9619$auto$opt_dff.cc:219:make_patterns_logic$1548, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 4 outputs.

3.103.54.1. Executing ABC.

3.103.55. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11588$abc$9608$auto$opt_dff.cc:219:make_patterns_logic$1847, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.103.55.1. Executing ABC.

3.103.56. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11598$abc$9595$auto$opt_dff.cc:219:make_patterns_logic$1860, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.103.56.1. Executing ABC.

3.103.57. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11606$abc$10262$auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.103.57.1. Executing ABC.

3.103.58. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11616$abc$10228$auto$opt_dff.cc:219:make_patterns_logic$1418, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.103.58.1. Executing ABC.

3.103.59. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11624$abc$10202$auto$opt_dff.cc:219:make_patterns_logic$1457, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.103.59.1. Executing ABC.

3.103.60. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11631$abc$10161$auto$opt_dff.cc:219:make_patterns_logic$1496, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.103.60.1. Executing ABC.

3.103.61. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11643$abc$10121$auto$opt_dff.cc:219:make_patterns_logic$2302, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.103.61.1. Executing ABC.

3.103.62. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11652$abc$10076$auto$opt_dff.cc:219:make_patterns_logic$1626, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.103.62.1. Executing ABC.

3.103.63. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11665$abc$10035$auto$opt_dff.cc:219:make_patterns_logic$1678, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.103.63.1. Executing ABC.

3.103.64. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11675$abc$9995$auto$opt_dff.cc:219:make_patterns_logic$1730, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.103.64.1. Executing ABC.

3.103.65. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11683$abc$9954$auto$opt_dff.cc:219:make_patterns_logic$1613, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.103.65.1. Executing ABC.

3.103.66. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11693$abc$9909$auto$opt_dff.cc:219:make_patterns_logic$2042, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 5 outputs.

3.103.66.1. Executing ABC.

3.103.67. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11705$abc$9864$auto$opt_dff.cc:219:make_patterns_logic$2211, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 2 outputs.

3.103.67.1. Executing ABC.

3.103.68. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11715$abc$9823$auto$opt_dff.cc:219:make_patterns_logic$2094, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 6 outputs.

3.103.68.1. Executing ABC.

3.103.69. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11728$abc$9782$auto$opt_dff.cc:219:make_patterns_logic$2146, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.103.69.1. Executing ABC.

3.103.70. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11736$abc$9742$auto$opt_dff.cc:219:make_patterns_logic$1938, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.103.70.1. Executing ABC.

3.103.71. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11744$abc$9706$auto$opt_dff.cc:219:make_patterns_logic$1990, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.103.71.1. Executing ABC.

3.103.72. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11753$abc$9655$auto$opt_dff.cc:219:make_patterns_logic$1808, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 3 outputs.

3.103.72.1. Executing ABC.

3.103.73. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11762$abc$10863$auto$opt_dff.cc:219:make_patterns_logic$1249, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.103.73.1. Executing ABC.

3.103.74. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11775$abc$10300$auto$opt_dff.cc:219:make_patterns_logic$1327, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.103.74.1. Executing ABC.

3.103.75. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11785$abc$10290$auto$opt_dff.cc:219:make_patterns_logic$1340, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.103.75.1. Executing ABC.

3.103.76. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11794$abc$10847$auto$opt_dff.cc:219:make_patterns_logic$1301, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.103.76.1. Executing ABC.

3.103.77. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11847$abc$10337$auto$opt_dff.cc:219:make_patterns_logic$1223, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 6 outputs.

3.103.77.1. Executing ABC.

3.103.78. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11860$abc$10384$auto$opt_dff.cc:219:make_patterns_logic$1509, asynchronously reset by \wb_rst_i
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.103.78.1. Executing ABC.

3.103.79. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11937$abc$10401$auto$opt_dff.cc:194:make_patterns_logic$1183, asynchronously reset by \wb_rst_i
Extracted 15 gates and 28 wires to a netlist network with 13 inputs and 10 outputs.

3.103.79.1. Executing ABC.

3.103.80. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11954$abc$9582$auto$opt_dff.cc:219:make_patterns_logic$1873, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 6 outputs.

3.103.80.1. Executing ABC.

3.103.81. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11965$abc$9568$auto$opt_dff.cc:219:make_patterns_logic$1886, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.103.81.1. Executing ABC.

3.103.82. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11974$abc$9553$auto$opt_dff.cc:219:make_patterns_logic$1899, asynchronously reset by \wb_rst_i
Extracted 12 gates and 25 wires to a netlist network with 13 inputs and 8 outputs.

3.103.82.1. Executing ABC.

3.103.83. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12864$abc$9548$auto$opt_dff.cc:194:make_patterns_logic$1158, asynchronously reset by \wb_rst_i
Extracted 4 gates and 8 wires to a netlist network with 4 inputs and 2 outputs.

3.103.83.1. Executing ABC.

3.103.84. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11991$abc$9538$auto$opt_dff.cc:219:make_patterns_logic$1210, asynchronously reset by \wb_rst_i
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.103.84.1. Executing ABC.

3.103.85. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12007$abc$9525$auto$opt_dff.cc:219:make_patterns_logic$1535, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.103.85.1. Executing ABC.

3.103.86. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12015$abc$9506$flatten\clgen.$verific$n118$407, asynchronously reset by \wb_rst_i
Extracted 9 gates and 15 wires to a netlist network with 6 inputs and 6 outputs.

3.103.86.1. Executing ABC.

3.103.87. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11876$abc$10419$auto$opt_dff.cc:219:make_patterns_logic$1170, asynchronously reset by \wb_rst_i
Extracted 55 gates and 92 wires to a netlist network with 37 inputs and 45 outputs.

3.103.87.1. Executing ABC.

3.103.88. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12026$abc$9438$auto$opt_dff.cc:219:make_patterns_logic$1180, asynchronously reset by \wb_rst_i
Extracted 17 gates and 35 wires to a netlist network with 18 inputs and 7 outputs.

3.103.88.1. Executing ABC.

3.103.89. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12044$abc$9335$auto$opt_dff.cc:219:make_patterns_logic$1522, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.103.89.1. Executing ABC.

3.103.90. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12052$abc$9320$auto$opt_dff.cc:219:make_patterns_logic$1197, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.103.90.1. Executing ABC.

3.103.91. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12062$abc$9206$flatten\shift.$verific$n338$492, asynchronously reset by \wb_rst_i
Extracted 89 gates and 162 wires to a netlist network with 73 inputs and 2 outputs.

3.103.91.1. Executing ABC.

3.103.92. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12153$abc$9196$auto$opt_dff.cc:219:make_patterns_logic$2315, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 17 inputs and 7 outputs.

3.103.92.1. Executing ABC.

3.103.93. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12167$abc$9186$auto$opt_dff.cc:219:make_patterns_logic$2328, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.103.93.1. Executing ABC.

3.103.94. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12177$abc$9069$auto$opt_dff.cc:219:make_patterns_logic$2471, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.103.94.1. Executing ABC.

3.103.95. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12186$abc$9087$auto$opt_dff.cc:219:make_patterns_logic$2445, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.103.95.1. Executing ABC.

3.103.96. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12195$abc$9110$auto$opt_dff.cc:219:make_patterns_logic$2419, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.103.96.1. Executing ABC.

3.103.97. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12205$abc$9131$auto$opt_dff.cc:219:make_patterns_logic$2393, asynchronously reset by \wb_rst_i
Extracted 13 gates and 28 wires to a netlist network with 15 inputs and 9 outputs.

3.103.97.1. Executing ABC.

3.103.98. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12219$abc$9152$auto$opt_dff.cc:219:make_patterns_logic$2367, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.103.98.1. Executing ABC.

3.103.99. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12229$abc$9173$auto$opt_dff.cc:219:make_patterns_logic$2341, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.103.99.1. Executing ABC.

3.103.100. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12239$abc$8904$auto$opt_dff.cc:219:make_patterns_logic$2692, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.103.100.1. Executing ABC.

3.103.101. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12248$abc$8913$auto$opt_dff.cc:219:make_patterns_logic$2679, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.103.101.1. Executing ABC.

3.103.102. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12258$abc$8920$auto$opt_dff.cc:219:make_patterns_logic$2666, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.103.102.1. Executing ABC.

3.103.103. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12267$abc$8929$auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 7 outputs.

3.103.103.1. Executing ABC.

3.103.104. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12281$abc$8940$auto$opt_dff.cc:219:make_patterns_logic$2640, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.103.104.1. Executing ABC.

3.103.105. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12293$abc$8951$auto$opt_dff.cc:219:make_patterns_logic$2627, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 8 outputs.

3.103.105.1. Executing ABC.

3.103.106. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12307$abc$8960$auto$opt_dff.cc:219:make_patterns_logic$2614, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 7 outputs.

3.103.106.1. Executing ABC.

3.103.107. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12320$abc$8970$auto$opt_dff.cc:219:make_patterns_logic$2601, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.103.107.1. Executing ABC.

3.103.108. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12332$abc$8979$auto$opt_dff.cc:219:make_patterns_logic$2588, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 17 inputs and 8 outputs.

3.103.108.1. Executing ABC.

3.103.109. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12346$abc$8989$auto$opt_dff.cc:219:make_patterns_logic$2575, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.103.109.1. Executing ABC.

3.103.110. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12355$abc$8998$auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 7 outputs.

3.103.110.1. Executing ABC.

3.103.111. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12368$abc$9008$auto$opt_dff.cc:219:make_patterns_logic$2549, asynchronously reset by \wb_rst_i
Extracted 10 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.103.111.1. Executing ABC.

3.103.112. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12381$abc$9021$auto$opt_dff.cc:219:make_patterns_logic$2536, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.103.112.1. Executing ABC.

3.103.113. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12391$abc$9033$auto$opt_dff.cc:219:make_patterns_logic$2523, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.103.113.1. Executing ABC.

3.103.114. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12399$abc$9041$auto$opt_dff.cc:219:make_patterns_logic$2510, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.103.114.1. Executing ABC.

3.103.115. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12409$abc$9051$auto$opt_dff.cc:219:make_patterns_logic$2497, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.103.115.1. Executing ABC.

3.103.116. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12417$abc$9059$auto$opt_dff.cc:219:make_patterns_logic$2484, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.103.116.1. Executing ABC.

3.103.117. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12425$abc$9077$auto$opt_dff.cc:219:make_patterns_logic$2458, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 4 outputs.

3.103.117.1. Executing ABC.

3.103.118. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12437$abc$9099$auto$opt_dff.cc:219:make_patterns_logic$2432, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.103.118.1. Executing ABC.

3.103.119. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12445$abc$9120$auto$opt_dff.cc:219:make_patterns_logic$2406, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.103.119.1. Executing ABC.

3.103.120. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12453$abc$9141$auto$opt_dff.cc:219:make_patterns_logic$2380, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.103.120.1. Executing ABC.

3.103.121. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12460$abc$9162$auto$opt_dff.cc:219:make_patterns_logic$2354, asynchronously reset by \wb_rst_i
Extracted 9 gates and 19 wires to a netlist network with 10 inputs and 4 outputs.

3.103.121.1. Executing ABC.

3.103.122. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12471$abc$10794$auto$opt_dff.cc:219:make_patterns_logic$1912, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 4 outputs.

3.103.122.1. Executing ABC.

3.103.123. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12481$abc$9716$auto$opt_dff.cc:219:make_patterns_logic$1977, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.103.123.1. Executing ABC.

3.103.124. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12489$abc$9684$auto$opt_dff.cc:219:make_patterns_logic$2016, asynchronously reset by \wb_rst_i
Extracted 13 gates and 27 wires to a netlist network with 14 inputs and 8 outputs.

3.103.124.1. Executing ABC.

3.103.125. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12504$abc$10281$auto$opt_dff.cc:219:make_patterns_logic$1353, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.103.125.1. Executing ABC.

3.103.126. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12513$abc$10874$auto$opt_dff.cc:219:make_patterns_logic$1288, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 6 outputs.

3.103.126.1. Executing ABC.

3.103.127. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12526$abc$10252$auto$opt_dff.cc:219:make_patterns_logic$1392, asynchronously reset by \wb_rst_i
Extracted 12 gates and 24 wires to a netlist network with 12 inputs and 6 outputs.

3.103.127.1. Executing ABC.

3.103.128. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12540$abc$10184$auto$opt_dff.cc:219:make_patterns_logic$1483, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 9 outputs.

3.103.128.1. Executing ABC.

3.103.129. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12554$abc$10101$auto$opt_dff.cc:219:make_patterns_logic$2289, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 5 outputs.

3.103.129.1. Executing ABC.

3.103.130. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12568$abc$10015$auto$opt_dff.cc:219:make_patterns_logic$1704, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.103.130.1. Executing ABC.

3.103.131. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12578$abc$9930$auto$opt_dff.cc:219:make_patterns_logic$1587, asynchronously reset by \wb_rst_i
Extracted 14 gates and 29 wires to a netlist network with 15 inputs and 5 outputs.

3.103.131.1. Executing ABC.

3.103.132. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12595$abc$9844$auto$opt_dff.cc:219:make_patterns_logic$2068, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 6 outputs.

3.103.132.1. Executing ABC.

3.103.133. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12608$abc$9763$auto$opt_dff.cc:219:make_patterns_logic$2172, asynchronously reset by \wb_rst_i
Extracted 10 gates and 21 wires to a netlist network with 11 inputs and 5 outputs.

3.103.133.1. Executing ABC.

3.103.134. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12619$abc$9674$auto$opt_dff.cc:219:make_patterns_logic$1782, asynchronously reset by \wb_rst_i
Extracted 13 gates and 27 wires to a netlist network with 14 inputs and 5 outputs.

3.103.134.1. Executing ABC.

3.103.135. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12635$abc$9348$auto$opt_dff.cc:219:make_patterns_logic$1173, asynchronously reset by \wb_rst_i
Extracted 76 gates and 134 wires to a netlist network with 58 inputs and 35 outputs.

3.103.135.1. Executing ABC.

3.103.136. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$11806$abc$10490$auto$opt_dff.cc:219:make_patterns_logic$1161, asynchronously reset by \wb_rst_i
Extracted 31 gates and 56 wires to a netlist network with 25 inputs and 18 outputs.

3.103.136.1. Executing ABC.

3.103.137. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12718$abc$10531$auto$opt_dff.cc:194:make_patterns_logic$2851, asynchronously reset by \wb_rst_i
Extracted 50 gates and 66 wires to a netlist network with 16 inputs and 34 outputs.

3.103.137.1. Executing ABC.

3.103.138. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12784$abc$10809$auto$opt_dff.cc:219:make_patterns_logic$1167, asynchronously reset by \wb_rst_i
Extracted 25 gates and 38 wires to a netlist network with 13 inputs and 21 outputs.

3.103.138.1. Executing ABC.

3.103.139. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$12822$abc$10346$auto$opt_dff.cc:219:make_patterns_logic$1164, asynchronously reset by \wb_rst_i
Extracted 27 gates and 44 wires to a netlist network with 17 inputs and 23 outputs.

3.103.139.1. Executing ABC.

3.103.140. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by \wb_rst_i
Extracted 208 gates and 320 wires to a netlist network with 112 inputs and 48 outputs.

3.103.140.1. Executing ABC.

3.103.141. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13111$abc$10895$auto$opt_dff.cc:219:make_patterns_logic$1262, asynchronously reset by \wb_rst_i
Extracted 142 gates and 231 wires to a netlist network with 89 inputs and 7 outputs.

3.103.141.1. Executing ABC.

yosys> abc -dff

3.104. Executing ABC pass (technology mapping using ABC).

3.104.1. Summary of detected clock domains:
  9 cells in clk=\wb_clk_i, en=$abc$13250$abc$11051$abc$10220$auto$opt_dff.cc:219:make_patterns_logic$1431, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13260$abc$11061$abc$10151$auto$opt_dff.cc:219:make_patterns_logic$2237, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$13269$abc$11070$abc$10067$auto$opt_dff.cc:219:make_patterns_logic$1639, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13282$abc$11083$abc$9986$auto$opt_dff.cc:219:make_patterns_logic$1743, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$13292$abc$11093$abc$9899$auto$opt_dff.cc:219:make_patterns_logic$2198, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13302$abc$11103$abc$9812$auto$opt_dff.cc:219:make_patterns_logic$2107, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$13314$abc$11115$abc$9734$auto$opt_dff.cc:219:make_patterns_logic$1951, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13328$abc$11128$abc$9752$auto$opt_dff.cc:219:make_patterns_logic$1925, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13337$abc$11137$abc$9834$auto$opt_dff.cc:219:make_patterns_logic$2081, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$13349$abc$11148$abc$9920$auto$opt_dff.cc:219:make_patterns_logic$2029, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13362$abc$11161$abc$9792$auto$opt_dff.cc:219:make_patterns_logic$2133, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$13372$abc$11171$abc$9876$auto$opt_dff.cc:219:make_patterns_logic$2224, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13385$abc$11184$abc$10241$auto$opt_dff.cc:219:make_patterns_logic$1405, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13397$abc$11196$abc$10129$auto$opt_dff.cc:219:make_patterns_logic$2263, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13409$abc$11208$abc$9965$auto$opt_dff.cc:219:make_patterns_logic$1561, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13418$abc$11217$abc$10192$auto$opt_dff.cc:219:make_patterns_logic$1470, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13427$abc$11228$abc$10111$auto$opt_dff.cc:219:make_patterns_logic$2276, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$13435$abc$11236$abc$10026$auto$opt_dff.cc:219:make_patterns_logic$1691, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$13446$abc$11247$abc$9942$auto$opt_dff.cc:219:make_patterns_logic$1574, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$13453$abc$11254$abc$9855$auto$opt_dff.cc:219:make_patterns_logic$2055, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13466$abc$11267$abc$9773$auto$opt_dff.cc:219:make_patterns_logic$2159, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13476$abc$11277$abc$9698$auto$opt_dff.cc:219:make_patterns_logic$2003, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13485$abc$11286$abc$8782$auto$opt_dff.cc:219:make_patterns_logic$2848, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13494$abc$11295$abc$8814$auto$opt_dff.cc:219:make_patterns_logic$2809, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13503$abc$11304$abc$8845$auto$opt_dff.cc:219:make_patterns_logic$2770, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13512$abc$11313$abc$8881$auto$opt_dff.cc:219:make_patterns_logic$2731, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$13521$abc$11322$abc$10173$auto$opt_dff.cc:219:make_patterns_logic$1769, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$13534$abc$11335$abc$10046$auto$opt_dff.cc:219:make_patterns_logic$1665, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13545$abc$11346$abc$10210$auto$opt_dff.cc:219:make_patterns_logic$1444, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13555$abc$11356$abc$10087$auto$opt_dff.cc:219:make_patterns_logic$1600, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13564$abc$11365$abc$10005$auto$opt_dff.cc:219:make_patterns_logic$1717, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13576$abc$11377$abc$10141$auto$opt_dff.cc:219:make_patterns_logic$2250, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13584$abc$11385$abc$10056$auto$opt_dff.cc:219:make_patterns_logic$1652, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13594$abc$11395$abc$9976$auto$opt_dff.cc:219:make_patterns_logic$1756, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$13602$abc$11403$abc$9886$auto$opt_dff.cc:219:make_patterns_logic$2185, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$13613$abc$11414$abc$9801$auto$opt_dff.cc:219:make_patterns_logic$2120, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13622$abc$11423$abc$9724$auto$opt_dff.cc:219:make_patterns_logic$1964, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$13632$abc$11433$abc$9642$auto$opt_dff.cc:219:make_patterns_logic$1821, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13641$abc$11442$abc$10886$auto$opt_dff.cc:219:make_patterns_logic$1275, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$13653$abc$11454$abc$8793$auto$opt_dff.cc:219:make_patterns_logic$2835, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13660$abc$11461$abc$8803$auto$opt_dff.cc:219:make_patterns_logic$2822, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13668$abc$11469$abc$8824$auto$opt_dff.cc:219:make_patterns_logic$2796, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13677$abc$11478$abc$8835$auto$opt_dff.cc:219:make_patterns_logic$2783, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13685$abc$11486$abc$8856$auto$opt_dff.cc:219:make_patterns_logic$2757, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$13698$abc$11499$abc$8871$auto$opt_dff.cc:219:make_patterns_logic$2744, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13705$abc$11506$abc$9630$auto$opt_dff.cc:219:make_patterns_logic$1834, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13713$abc$11516$abc$10271$auto$opt_dff.cc:219:make_patterns_logic$1366, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$13725$abc$11527$abc$9665$auto$opt_dff.cc:219:make_patterns_logic$1795, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$13737$abc$11539$abc$8888$auto$opt_dff.cc:219:make_patterns_logic$2718, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$13746$abc$11548$abc$10324$auto$opt_dff.cc:219:make_patterns_logic$1236, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$13761$abc$11562$abc$8897$auto$opt_dff.cc:219:make_patterns_logic$2705, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$13768$abc$11569$abc$10309$auto$opt_dff.cc:219:make_patterns_logic$1314, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$13778$abc$11579$abc$9619$auto$opt_dff.cc:219:make_patterns_logic$1548, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13787$abc$11588$abc$9608$auto$opt_dff.cc:219:make_patterns_logic$1847, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13797$abc$11598$abc$9595$auto$opt_dff.cc:219:make_patterns_logic$1860, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13805$abc$11606$abc$10262$auto$opt_dff.cc:219:make_patterns_logic$1379, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13815$abc$11616$abc$10228$auto$opt_dff.cc:219:make_patterns_logic$1418, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$13823$abc$11624$abc$10202$auto$opt_dff.cc:219:make_patterns_logic$1457, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$13830$abc$11631$abc$10161$auto$opt_dff.cc:219:make_patterns_logic$1496, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13842$abc$11643$abc$10121$auto$opt_dff.cc:219:make_patterns_logic$2302, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$13851$abc$11652$abc$10076$auto$opt_dff.cc:219:make_patterns_logic$1626, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13864$abc$11665$abc$10035$auto$opt_dff.cc:219:make_patterns_logic$1678, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13874$abc$11675$abc$9995$auto$opt_dff.cc:219:make_patterns_logic$1730, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13882$abc$11683$abc$9954$auto$opt_dff.cc:219:make_patterns_logic$1613, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$13892$abc$11693$abc$9909$auto$opt_dff.cc:219:make_patterns_logic$2042, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$13904$abc$11705$abc$9864$auto$opt_dff.cc:219:make_patterns_logic$2211, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$13914$abc$11715$abc$9823$auto$opt_dff.cc:219:make_patterns_logic$2094, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13927$abc$11728$abc$9782$auto$opt_dff.cc:219:make_patterns_logic$2146, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$13935$abc$11736$abc$9742$auto$opt_dff.cc:219:make_patterns_logic$1938, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$13943$abc$11744$abc$9706$auto$opt_dff.cc:219:make_patterns_logic$1990, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$13954$abc$11753$abc$9655$auto$opt_dff.cc:219:make_patterns_logic$1808, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$13963$abc$11762$abc$10863$auto$opt_dff.cc:219:make_patterns_logic$1249, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$13976$abc$11775$abc$10300$auto$opt_dff.cc:219:make_patterns_logic$1327, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$13986$abc$11785$abc$10290$auto$opt_dff.cc:219:make_patterns_logic$1340, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$13995$abc$11794$abc$10847$auto$opt_dff.cc:219:make_patterns_logic$1301, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$14007$abc$11847$abc$10337$auto$opt_dff.cc:219:make_patterns_logic$1223, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$14020$abc$11860$abc$10384$auto$opt_dff.cc:219:make_patterns_logic$1509, arst=\wb_rst_i, srst={ }
  20 cells in clk=\wb_clk_i, en=$abc$14036$abc$11937$abc$10401$auto$opt_dff.cc:194:make_patterns_logic$1183, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$14053$abc$11954$abc$9582$auto$opt_dff.cc:219:make_patterns_logic$1873, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14064$abc$11965$abc$9568$auto$opt_dff.cc:219:make_patterns_logic$1886, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$14072$abc$11974$abc$9553$auto$opt_dff.cc:219:make_patterns_logic$1899, arst=\wb_rst_i, srst={ }
  3 cells in clk=\wb_clk_i, en=$abc$14086$abc$12864$abc$9548$auto$opt_dff.cc:194:make_patterns_logic$1158, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$14092$abc$11991$abc$9538$auto$opt_dff.cc:219:make_patterns_logic$1210, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14108$abc$12007$abc$9525$auto$opt_dff.cc:219:make_patterns_logic$1535, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$14116$abc$12015$abc$9506$flatten\clgen.$verific$n118$407, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$14193$abc$12026$abc$9438$auto$opt_dff.cc:219:make_patterns_logic$1180, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14212$abc$12044$abc$9335$auto$opt_dff.cc:219:make_patterns_logic$1522, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14220$abc$12052$abc$9320$auto$opt_dff.cc:219:make_patterns_logic$1197, arst=\wb_rst_i, srst={ }
  98 cells in clk=\wb_clk_i, en=$abc$14230$abc$12062$abc$9206$flatten\shift.$verific$n338$492, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$14330$abc$12153$abc$9196$auto$opt_dff.cc:219:make_patterns_logic$2315, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14344$abc$12167$abc$9186$auto$opt_dff.cc:219:make_patterns_logic$2328, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14354$abc$12177$abc$9069$auto$opt_dff.cc:219:make_patterns_logic$2471, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14363$abc$12186$abc$9087$auto$opt_dff.cc:219:make_patterns_logic$2445, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14372$abc$12195$abc$9110$auto$opt_dff.cc:219:make_patterns_logic$2419, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$14382$abc$12205$abc$9131$auto$opt_dff.cc:219:make_patterns_logic$2393, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14396$abc$12219$abc$9152$auto$opt_dff.cc:219:make_patterns_logic$2367, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14406$abc$12229$abc$9173$auto$opt_dff.cc:219:make_patterns_logic$2341, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$14416$abc$12239$abc$8904$auto$opt_dff.cc:219:make_patterns_logic$2692, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14425$abc$12248$abc$8913$auto$opt_dff.cc:219:make_patterns_logic$2679, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$14435$abc$12258$abc$8920$auto$opt_dff.cc:219:make_patterns_logic$2666, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$14444$abc$12267$abc$8929$auto$opt_dff.cc:219:make_patterns_logic$2653, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$14458$abc$12281$abc$8940$auto$opt_dff.cc:219:make_patterns_logic$2640, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$14470$abc$12293$abc$8951$auto$opt_dff.cc:219:make_patterns_logic$2627, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$14484$abc$12307$abc$8960$auto$opt_dff.cc:219:make_patterns_logic$2614, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$14497$abc$12320$abc$8970$auto$opt_dff.cc:219:make_patterns_logic$2601, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$14509$abc$12332$abc$8979$auto$opt_dff.cc:219:make_patterns_logic$2588, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$14523$abc$12346$abc$8989$auto$opt_dff.cc:219:make_patterns_logic$2575, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$14532$abc$12355$abc$8998$auto$opt_dff.cc:219:make_patterns_logic$2562, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$14545$abc$12368$abc$9008$auto$opt_dff.cc:219:make_patterns_logic$2549, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14557$abc$12381$abc$9021$auto$opt_dff.cc:219:make_patterns_logic$2536, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14567$abc$12391$abc$9033$auto$opt_dff.cc:219:make_patterns_logic$2523, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$14575$abc$12399$abc$9041$auto$opt_dff.cc:219:make_patterns_logic$2510, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14585$abc$12409$abc$9051$auto$opt_dff.cc:219:make_patterns_logic$2497, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14593$abc$12417$abc$9059$auto$opt_dff.cc:219:make_patterns_logic$2484, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$14601$abc$12425$abc$9077$auto$opt_dff.cc:219:make_patterns_logic$2458, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14612$abc$12437$abc$9099$auto$opt_dff.cc:219:make_patterns_logic$2432, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14620$abc$12445$abc$9120$auto$opt_dff.cc:219:make_patterns_logic$2406, arst=\wb_rst_i, srst={ }
  5 cells in clk=\wb_clk_i, en=$abc$14628$abc$12453$abc$9141$auto$opt_dff.cc:219:make_patterns_logic$2380, arst=\wb_rst_i, srst={ }
  9 cells in clk=\wb_clk_i, en=$abc$14635$abc$12460$abc$9162$auto$opt_dff.cc:219:make_patterns_logic$2354, arst=\wb_rst_i, srst={ }
  56 cells in clk=\wb_clk_i, en=$abc$14127$abc$11876$abc$10419$auto$opt_dff.cc:219:make_patterns_logic$1170, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14646$abc$12471$abc$10794$auto$opt_dff.cc:219:make_patterns_logic$1912, arst=\wb_rst_i, srst={ }
  6 cells in clk=\wb_clk_i, en=$abc$14657$abc$12481$abc$9716$auto$opt_dff.cc:219:make_patterns_logic$1977, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$14665$abc$12489$abc$9684$auto$opt_dff.cc:219:make_patterns_logic$2016, arst=\wb_rst_i, srst={ }
  7 cells in clk=\wb_clk_i, en=$abc$14680$abc$12504$abc$10281$auto$opt_dff.cc:219:make_patterns_logic$1353, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$14689$abc$12513$abc$10874$auto$opt_dff.cc:219:make_patterns_logic$1288, arst=\wb_rst_i, srst={ }
  13 cells in clk=\wb_clk_i, en=$abc$14702$abc$12526$abc$10252$auto$opt_dff.cc:219:make_patterns_logic$1392, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$14716$abc$12540$abc$10184$auto$opt_dff.cc:219:make_patterns_logic$1483, arst=\wb_rst_i, srst={ }
  12 cells in clk=\wb_clk_i, en=$abc$14730$abc$12554$abc$10101$auto$opt_dff.cc:219:make_patterns_logic$2289, arst=\wb_rst_i, srst={ }
  8 cells in clk=\wb_clk_i, en=$abc$14744$abc$12568$abc$10015$auto$opt_dff.cc:219:make_patterns_logic$1704, arst=\wb_rst_i, srst={ }
  15 cells in clk=\wb_clk_i, en=$abc$14754$abc$12578$abc$9930$auto$opt_dff.cc:219:make_patterns_logic$1587, arst=\wb_rst_i, srst={ }
  11 cells in clk=\wb_clk_i, en=$abc$14770$abc$12595$abc$9844$auto$opt_dff.cc:219:make_patterns_logic$2068, arst=\wb_rst_i, srst={ }
  10 cells in clk=\wb_clk_i, en=$abc$14783$abc$12608$abc$9763$auto$opt_dff.cc:219:make_patterns_logic$2172, arst=\wb_rst_i, srst={ }
  14 cells in clk=\wb_clk_i, en=$abc$14795$abc$12619$abc$9674$auto$opt_dff.cc:219:make_patterns_logic$1782, arst=\wb_rst_i, srst={ }
  76 cells in clk=\wb_clk_i, en=$abc$14810$abc$12635$abc$9348$auto$opt_dff.cc:219:make_patterns_logic$1173, arst=\wb_rst_i, srst={ }
  31 cells in clk=\wb_clk_i, en=$abc$14895$abc$11806$abc$10490$auto$opt_dff.cc:219:make_patterns_logic$1161, arst=\wb_rst_i, srst={ }
  48 cells in clk=\wb_clk_i, en=$abc$14935$abc$12718$abc$10531$auto$opt_dff.cc:194:make_patterns_logic$2851, arst=\wb_rst_i, srst={ }
  24 cells in clk=\wb_clk_i, en=$abc$14994$abc$12784$abc$10809$auto$opt_dff.cc:219:make_patterns_logic$1167, arst=\wb_rst_i, srst={ }
  25 cells in clk=\wb_clk_i, en=$abc$15032$abc$12822$abc$10346$auto$opt_dff.cc:219:make_patterns_logic$1164, arst=\wb_rst_i, srst={ }
  210 cells in clk=\wb_clk_i, en={ }, arst=\wb_rst_i, srst={ }
  111 cells in clk=\wb_clk_i, en=$abc$15319$abc$13111$abc$10895$auto$opt_dff.cc:219:make_patterns_logic$1262, arst=\wb_rst_i, srst={ }

3.104.2. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13250$abc$11051$abc$10220$auto$opt_dff.cc:219:make_patterns_logic$1431, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 12 inputs and 5 outputs.

3.104.2.1. Executing ABC.

3.104.3. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13260$abc$11061$abc$10151$auto$opt_dff.cc:219:make_patterns_logic$2237, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.104.3.1. Executing ABC.

3.104.4. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13269$abc$11070$abc$10067$auto$opt_dff.cc:219:make_patterns_logic$1639, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.104.4.1. Executing ABC.

3.104.5. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13282$abc$11083$abc$9986$auto$opt_dff.cc:219:make_patterns_logic$1743, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.5.1. Executing ABC.

3.104.6. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13292$abc$11093$abc$9899$auto$opt_dff.cc:219:make_patterns_logic$2198, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.104.6.1. Executing ABC.

3.104.7. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13302$abc$11103$abc$9812$auto$opt_dff.cc:219:make_patterns_logic$2107, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.104.7.1. Executing ABC.

3.104.8. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13314$abc$11115$abc$9734$auto$opt_dff.cc:219:make_patterns_logic$1951, asynchronously reset by \wb_rst_i
Extracted 13 gates and 29 wires to a netlist network with 16 inputs and 7 outputs.

3.104.8.1. Executing ABC.

3.104.9. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13328$abc$11128$abc$9752$auto$opt_dff.cc:219:make_patterns_logic$1925, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.9.1. Executing ABC.

3.104.10. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13337$abc$11137$abc$9834$auto$opt_dff.cc:219:make_patterns_logic$2081, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.104.10.1. Executing ABC.

3.104.11. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13349$abc$11148$abc$9920$auto$opt_dff.cc:219:make_patterns_logic$2029, asynchronously reset by \wb_rst_i
Extracted 13 gates and 29 wires to a netlist network with 16 inputs and 7 outputs.

3.104.11.1. Executing ABC.

3.104.12. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13362$abc$11161$abc$9792$auto$opt_dff.cc:219:make_patterns_logic$2133, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.12.1. Executing ABC.

3.104.13. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13372$abc$11171$abc$9876$auto$opt_dff.cc:219:make_patterns_logic$2224, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 5 outputs.

3.104.13.1. Executing ABC.

3.104.14. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13385$abc$11184$abc$10241$auto$opt_dff.cc:219:make_patterns_logic$1405, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 5 outputs.

3.104.14.1. Executing ABC.

3.104.15. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13397$abc$11196$abc$10129$auto$opt_dff.cc:219:make_patterns_logic$2263, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 5 outputs.

3.104.15.1. Executing ABC.

3.104.16. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13409$abc$11208$abc$9965$auto$opt_dff.cc:219:make_patterns_logic$1561, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.16.1. Executing ABC.

3.104.17. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13418$abc$11217$abc$10192$auto$opt_dff.cc:219:make_patterns_logic$1470, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.104.17.1. Executing ABC.

3.104.18. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13427$abc$11228$abc$10111$auto$opt_dff.cc:219:make_patterns_logic$2276, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.104.18.1. Executing ABC.

3.104.19. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13435$abc$11236$abc$10026$auto$opt_dff.cc:219:make_patterns_logic$1691, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 4 outputs.

3.104.19.1. Executing ABC.

3.104.20. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13446$abc$11247$abc$9942$auto$opt_dff.cc:219:make_patterns_logic$1574, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.104.20.1. Executing ABC.

3.104.21. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13453$abc$11254$abc$9855$auto$opt_dff.cc:219:make_patterns_logic$2055, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.104.21.1. Executing ABC.

3.104.22. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13466$abc$11267$abc$9773$auto$opt_dff.cc:219:make_patterns_logic$2159, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.22.1. Executing ABC.

3.104.23. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13476$abc$11277$abc$9698$auto$opt_dff.cc:219:make_patterns_logic$2003, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.23.1. Executing ABC.

3.104.24. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13485$abc$11286$abc$8782$auto$opt_dff.cc:219:make_patterns_logic$2848, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.24.1. Executing ABC.

3.104.25. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13494$abc$11295$abc$8814$auto$opt_dff.cc:219:make_patterns_logic$2809, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.25.1. Executing ABC.

3.104.26. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13503$abc$11304$abc$8845$auto$opt_dff.cc:219:make_patterns_logic$2770, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.26.1. Executing ABC.

3.104.27. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13512$abc$11313$abc$8881$auto$opt_dff.cc:219:make_patterns_logic$2731, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.104.27.1. Executing ABC.

3.104.28. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13521$abc$11322$abc$10173$auto$opt_dff.cc:219:make_patterns_logic$1769, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 5 outputs.

3.104.28.1. Executing ABC.

3.104.29. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13534$abc$11335$abc$10046$auto$opt_dff.cc:219:make_patterns_logic$1665, asynchronously reset by \wb_rst_i
Extracted 9 gates and 21 wires to a netlist network with 12 inputs and 4 outputs.

3.104.29.1. Executing ABC.

3.104.30. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13545$abc$11346$abc$10210$auto$opt_dff.cc:219:make_patterns_logic$1444, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.104.30.1. Executing ABC.

3.104.31. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13555$abc$11356$abc$10087$auto$opt_dff.cc:219:make_patterns_logic$1600, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.31.1. Executing ABC.

3.104.32. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13564$abc$11365$abc$10005$auto$opt_dff.cc:219:make_patterns_logic$1717, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.104.32.1. Executing ABC.

3.104.33. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13576$abc$11377$abc$10141$auto$opt_dff.cc:219:make_patterns_logic$2250, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.104.33.1. Executing ABC.

3.104.34. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13584$abc$11385$abc$10056$auto$opt_dff.cc:219:make_patterns_logic$1652, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.104.34.1. Executing ABC.

3.104.35. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13594$abc$11395$abc$9976$auto$opt_dff.cc:219:make_patterns_logic$1756, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.104.35.1. Executing ABC.

3.104.36. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13602$abc$11403$abc$9886$auto$opt_dff.cc:219:make_patterns_logic$2185, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 3 outputs.

3.104.36.1. Executing ABC.

3.104.37. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13613$abc$11414$abc$9801$auto$opt_dff.cc:219:make_patterns_logic$2120, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 2 outputs.

3.104.37.1. Executing ABC.

3.104.38. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13622$abc$11423$abc$9724$auto$opt_dff.cc:219:make_patterns_logic$1964, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.104.38.1. Executing ABC.

3.104.39. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13632$abc$11433$abc$9642$auto$opt_dff.cc:219:make_patterns_logic$1821, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.104.39.1. Executing ABC.

3.104.40. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13641$abc$11442$abc$10886$auto$opt_dff.cc:219:make_patterns_logic$1275, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 5 outputs.

3.104.40.1. Executing ABC.

3.104.41. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13653$abc$11454$abc$8793$auto$opt_dff.cc:219:make_patterns_logic$2835, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.104.41.1. Executing ABC.

3.104.42. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13660$abc$11461$abc$8803$auto$opt_dff.cc:219:make_patterns_logic$2822, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.104.42.1. Executing ABC.

3.104.43. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13668$abc$11469$abc$8824$auto$opt_dff.cc:219:make_patterns_logic$2796, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.43.1. Executing ABC.

3.104.44. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13677$abc$11478$abc$8835$auto$opt_dff.cc:219:make_patterns_logic$2783, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.104.44.1. Executing ABC.

3.104.45. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13685$abc$11486$abc$8856$auto$opt_dff.cc:219:make_patterns_logic$2757, asynchronously reset by \wb_rst_i
Extracted 11 gates and 22 wires to a netlist network with 11 inputs and 6 outputs.

3.104.45.1. Executing ABC.

3.104.46. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13698$abc$11499$abc$8871$auto$opt_dff.cc:219:make_patterns_logic$2744, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.104.46.1. Executing ABC.

3.104.47. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13705$abc$11506$abc$9630$auto$opt_dff.cc:219:make_patterns_logic$1834, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.104.47.1. Executing ABC.

3.104.48. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13713$abc$11516$abc$10271$auto$opt_dff.cc:219:make_patterns_logic$1366, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.104.48.1. Executing ABC.

3.104.49. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13725$abc$11527$abc$9665$auto$opt_dff.cc:219:make_patterns_logic$1795, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.104.49.1. Executing ABC.

3.104.50. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13737$abc$11539$abc$8888$auto$opt_dff.cc:219:make_patterns_logic$2718, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.104.50.1. Executing ABC.

3.104.51. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13746$abc$11548$abc$10324$auto$opt_dff.cc:219:make_patterns_logic$1236, asynchronously reset by \wb_rst_i
Extracted 13 gates and 29 wires to a netlist network with 16 inputs and 7 outputs.

3.104.51.1. Executing ABC.

3.104.52. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13761$abc$11562$abc$8897$auto$opt_dff.cc:219:make_patterns_logic$2705, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.104.52.1. Executing ABC.

3.104.53. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13768$abc$11569$abc$10309$auto$opt_dff.cc:219:make_patterns_logic$1314, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.104.53.1. Executing ABC.

3.104.54. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13778$abc$11579$abc$9619$auto$opt_dff.cc:219:make_patterns_logic$1548, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 4 outputs.

3.104.54.1. Executing ABC.

3.104.55. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13787$abc$11588$abc$9608$auto$opt_dff.cc:219:make_patterns_logic$1847, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.104.55.1. Executing ABC.

3.104.56. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13797$abc$11598$abc$9595$auto$opt_dff.cc:219:make_patterns_logic$1860, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.104.56.1. Executing ABC.

3.104.57. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13805$abc$11606$abc$10262$auto$opt_dff.cc:219:make_patterns_logic$1379, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 4 outputs.

3.104.57.1. Executing ABC.

3.104.58. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13815$abc$11616$abc$10228$auto$opt_dff.cc:219:make_patterns_logic$1418, asynchronously reset by \wb_rst_i
Extracted 6 gates and 15 wires to a netlist network with 9 inputs and 3 outputs.

3.104.58.1. Executing ABC.

3.104.59. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13823$abc$11624$abc$10202$auto$opt_dff.cc:219:make_patterns_logic$1457, asynchronously reset by \wb_rst_i
Extracted 5 gates and 12 wires to a netlist network with 7 inputs and 2 outputs.

3.104.59.1. Executing ABC.

3.104.60. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13830$abc$11631$abc$10161$auto$opt_dff.cc:219:make_patterns_logic$1496, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.104.60.1. Executing ABC.

3.104.61. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13842$abc$11643$abc$10121$auto$opt_dff.cc:219:make_patterns_logic$2302, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.104.61.1. Executing ABC.

3.104.62. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13851$abc$11652$abc$10076$auto$opt_dff.cc:219:make_patterns_logic$1626, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 6 outputs.

3.104.62.1. Executing ABC.

3.104.63. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13864$abc$11665$abc$10035$auto$opt_dff.cc:219:make_patterns_logic$1678, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.104.63.1. Executing ABC.

3.104.64. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13874$abc$11675$abc$9995$auto$opt_dff.cc:219:make_patterns_logic$1730, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.104.64.1. Executing ABC.

3.104.65. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13882$abc$11683$abc$9954$auto$opt_dff.cc:219:make_patterns_logic$1613, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.104.65.1. Executing ABC.

3.104.66. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13892$abc$11693$abc$9909$auto$opt_dff.cc:219:make_patterns_logic$2042, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 5 outputs.

3.104.66.1. Executing ABC.

3.104.67. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13904$abc$11705$abc$9864$auto$opt_dff.cc:219:make_patterns_logic$2211, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 2 outputs.

3.104.67.1. Executing ABC.

3.104.68. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13914$abc$11715$abc$9823$auto$opt_dff.cc:219:make_patterns_logic$2094, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 6 outputs.

3.104.68.1. Executing ABC.

3.104.69. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13927$abc$11728$abc$9782$auto$opt_dff.cc:219:make_patterns_logic$2146, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 2 outputs.

3.104.69.1. Executing ABC.

3.104.70. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13935$abc$11736$abc$9742$auto$opt_dff.cc:219:make_patterns_logic$1938, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.104.70.1. Executing ABC.

3.104.71. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13943$abc$11744$abc$9706$auto$opt_dff.cc:219:make_patterns_logic$1990, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.104.71.1. Executing ABC.

3.104.72. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13954$abc$11753$abc$9655$auto$opt_dff.cc:219:make_patterns_logic$1808, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 3 outputs.

3.104.72.1. Executing ABC.

3.104.73. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13963$abc$11762$abc$10863$auto$opt_dff.cc:219:make_patterns_logic$1249, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 17 inputs and 7 outputs.

3.104.73.1. Executing ABC.

3.104.74. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13976$abc$11775$abc$10300$auto$opt_dff.cc:219:make_patterns_logic$1327, asynchronously reset by \wb_rst_i
Extracted 9 gates and 22 wires to a netlist network with 13 inputs and 4 outputs.

3.104.74.1. Executing ABC.

3.104.75. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13986$abc$11785$abc$10290$auto$opt_dff.cc:219:make_patterns_logic$1340, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.104.75.1. Executing ABC.

3.104.76. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$13995$abc$11794$abc$10847$auto$opt_dff.cc:219:make_patterns_logic$1301, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 4 outputs.

3.104.76.1. Executing ABC.

3.104.77. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14007$abc$11847$abc$10337$auto$opt_dff.cc:219:make_patterns_logic$1223, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 6 outputs.

3.104.77.1. Executing ABC.

3.104.78. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14020$abc$11860$abc$10384$auto$opt_dff.cc:219:make_patterns_logic$1509, asynchronously reset by \wb_rst_i
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.104.78.1. Executing ABC.

3.104.79. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14036$abc$11937$abc$10401$auto$opt_dff.cc:194:make_patterns_logic$1183, asynchronously reset by \wb_rst_i
Extracted 20 gates and 39 wires to a netlist network with 19 inputs and 13 outputs.

3.104.79.1. Executing ABC.

3.104.80. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14053$abc$11954$abc$9582$auto$opt_dff.cc:219:make_patterns_logic$1873, asynchronously reset by \wb_rst_i
Extracted 10 gates and 24 wires to a netlist network with 14 inputs and 6 outputs.

3.104.80.1. Executing ABC.

3.104.81. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14064$abc$11965$abc$9568$auto$opt_dff.cc:219:make_patterns_logic$1886, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.104.81.1. Executing ABC.

3.104.82. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14072$abc$11974$abc$9553$auto$opt_dff.cc:219:make_patterns_logic$1899, asynchronously reset by \wb_rst_i
Extracted 11 gates and 24 wires to a netlist network with 13 inputs and 7 outputs.

3.104.82.1. Executing ABC.

3.104.83. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14086$abc$12864$abc$9548$auto$opt_dff.cc:194:make_patterns_logic$1158, asynchronously reset by \wb_rst_i
Extracted 3 gates and 6 wires to a netlist network with 3 inputs and 2 outputs.

3.104.83.1. Executing ABC.

3.104.84. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14092$abc$11991$abc$9538$auto$opt_dff.cc:219:make_patterns_logic$1210, asynchronously reset by \wb_rst_i
Extracted 14 gates and 30 wires to a netlist network with 16 inputs and 9 outputs.

3.104.84.1. Executing ABC.

3.104.85. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14108$abc$12007$abc$9525$auto$opt_dff.cc:219:make_patterns_logic$1535, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.104.85.1. Executing ABC.

3.104.86. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14116$abc$12015$abc$9506$flatten\clgen.$verific$n118$407, asynchronously reset by \wb_rst_i
Extracted 9 gates and 15 wires to a netlist network with 6 inputs and 6 outputs.

3.104.86.1. Executing ABC.

3.104.87. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14193$abc$12026$abc$9438$auto$opt_dff.cc:219:make_patterns_logic$1180, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 5 outputs.

3.104.87.1. Executing ABC.

3.104.88. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14212$abc$12044$abc$9335$auto$opt_dff.cc:219:make_patterns_logic$1522, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.104.88.1. Executing ABC.

3.104.89. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14220$abc$12052$abc$9320$auto$opt_dff.cc:219:make_patterns_logic$1197, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.104.89.1. Executing ABC.

3.104.90. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14230$abc$12062$abc$9206$flatten\shift.$verific$n338$492, asynchronously reset by \wb_rst_i
Extracted 98 gates and 171 wires to a netlist network with 73 inputs and 2 outputs.

3.104.90.1. Executing ABC.

3.104.91. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14330$abc$12153$abc$9196$auto$opt_dff.cc:219:make_patterns_logic$2315, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 17 inputs and 7 outputs.

3.104.91.1. Executing ABC.

3.104.92. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14344$abc$12167$abc$9186$auto$opt_dff.cc:219:make_patterns_logic$2328, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.104.92.1. Executing ABC.

3.104.93. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14354$abc$12177$abc$9069$auto$opt_dff.cc:219:make_patterns_logic$2471, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.104.93.1. Executing ABC.

3.104.94. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14363$abc$12186$abc$9087$auto$opt_dff.cc:219:make_patterns_logic$2445, asynchronously reset by \wb_rst_i
Extracted 8 gates and 20 wires to a netlist network with 12 inputs and 4 outputs.

3.104.94.1. Executing ABC.

3.104.95. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14372$abc$12195$abc$9110$auto$opt_dff.cc:219:make_patterns_logic$2419, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.104.95.1. Executing ABC.

3.104.96. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14382$abc$12205$abc$9131$auto$opt_dff.cc:219:make_patterns_logic$2393, asynchronously reset by \wb_rst_i
Extracted 13 gates and 28 wires to a netlist network with 15 inputs and 9 outputs.

3.104.96.1. Executing ABC.

3.104.97. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14396$abc$12219$abc$9152$auto$opt_dff.cc:219:make_patterns_logic$2367, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.104.97.1. Executing ABC.

3.104.98. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14406$abc$12229$abc$9173$auto$opt_dff.cc:219:make_patterns_logic$2341, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.104.98.1. Executing ABC.

3.104.99. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14416$abc$12239$abc$8904$auto$opt_dff.cc:219:make_patterns_logic$2692, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.104.99.1. Executing ABC.

3.104.100. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14425$abc$12248$abc$8913$auto$opt_dff.cc:219:make_patterns_logic$2679, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 5 outputs.

3.104.100.1. Executing ABC.

3.104.101. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14435$abc$12258$abc$8920$auto$opt_dff.cc:219:make_patterns_logic$2666, asynchronously reset by \wb_rst_i
Extracted 7 gates and 17 wires to a netlist network with 10 inputs and 4 outputs.

3.104.101.1. Executing ABC.

3.104.102. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14444$abc$12267$abc$8929$auto$opt_dff.cc:219:make_patterns_logic$2653, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 7 outputs.

3.104.102.1. Executing ABC.

3.104.103. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14458$abc$12281$abc$8940$auto$opt_dff.cc:219:make_patterns_logic$2640, asynchronously reset by \wb_rst_i
Extracted 11 gates and 26 wires to a netlist network with 15 inputs and 6 outputs.

3.104.103.1. Executing ABC.

3.104.104. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14470$abc$12293$abc$8951$auto$opt_dff.cc:219:make_patterns_logic$2627, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 8 outputs.

3.104.104.1. Executing ABC.

3.104.105. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14484$abc$12307$abc$8960$auto$opt_dff.cc:219:make_patterns_logic$2614, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 7 outputs.

3.104.105.1. Executing ABC.

3.104.106. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14497$abc$12320$abc$8970$auto$opt_dff.cc:219:make_patterns_logic$2601, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.104.106.1. Executing ABC.

3.104.107. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14509$abc$12332$abc$8979$auto$opt_dff.cc:219:make_patterns_logic$2588, asynchronously reset by \wb_rst_i
Extracted 13 gates and 30 wires to a netlist network with 17 inputs and 8 outputs.

3.104.107.1. Executing ABC.

3.104.108. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14523$abc$12346$abc$8989$auto$opt_dff.cc:219:make_patterns_logic$2575, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.104.108.1. Executing ABC.

3.104.109. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14532$abc$12355$abc$8998$auto$opt_dff.cc:219:make_patterns_logic$2562, asynchronously reset by \wb_rst_i
Extracted 12 gates and 28 wires to a netlist network with 16 inputs and 7 outputs.

3.104.109.1. Executing ABC.

3.104.110. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14545$abc$12368$abc$9008$auto$opt_dff.cc:219:make_patterns_logic$2549, asynchronously reset by \wb_rst_i
Extracted 10 gates and 22 wires to a netlist network with 12 inputs and 4 outputs.

3.104.110.1. Executing ABC.

3.104.111. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14557$abc$12381$abc$9021$auto$opt_dff.cc:219:make_patterns_logic$2536, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 5 outputs.

3.104.111.1. Executing ABC.

3.104.112. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14567$abc$12391$abc$9033$auto$opt_dff.cc:219:make_patterns_logic$2523, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.104.112.1. Executing ABC.

3.104.113. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14575$abc$12399$abc$9041$auto$opt_dff.cc:219:make_patterns_logic$2510, asynchronously reset by \wb_rst_i
Extracted 10 gates and 23 wires to a netlist network with 13 inputs and 6 outputs.

3.104.113.1. Executing ABC.

3.104.114. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14585$abc$12409$abc$9051$auto$opt_dff.cc:219:make_patterns_logic$2497, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.104.114.1. Executing ABC.

3.104.115. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14593$abc$12417$abc$9059$auto$opt_dff.cc:219:make_patterns_logic$2484, asynchronously reset by \wb_rst_i
Extracted 6 gates and 14 wires to a netlist network with 8 inputs and 3 outputs.

3.104.115.1. Executing ABC.

3.104.116. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14601$abc$12425$abc$9077$auto$opt_dff.cc:219:make_patterns_logic$2458, asynchronously reset by \wb_rst_i
Extracted 9 gates and 20 wires to a netlist network with 11 inputs and 4 outputs.

3.104.116.1. Executing ABC.

3.104.117. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14612$abc$12437$abc$9099$auto$opt_dff.cc:219:make_patterns_logic$2432, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.104.117.1. Executing ABC.

3.104.118. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14620$abc$12445$abc$9120$auto$opt_dff.cc:219:make_patterns_logic$2406, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.104.118.1. Executing ABC.

3.104.119. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14628$abc$12453$abc$9141$auto$opt_dff.cc:219:make_patterns_logic$2380, asynchronously reset by \wb_rst_i
Extracted 5 gates and 11 wires to a netlist network with 6 inputs and 2 outputs.

3.104.119.1. Executing ABC.

3.104.120. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14635$abc$12460$abc$9162$auto$opt_dff.cc:219:make_patterns_logic$2354, asynchronously reset by \wb_rst_i
Extracted 9 gates and 19 wires to a netlist network with 10 inputs and 4 outputs.

3.104.120.1. Executing ABC.

3.104.121. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14127$abc$11876$abc$10419$auto$opt_dff.cc:219:make_patterns_logic$1170, asynchronously reset by \wb_rst_i
Extracted 56 gates and 93 wires to a netlist network with 37 inputs and 45 outputs.

3.104.121.1. Executing ABC.

3.104.122. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14646$abc$12471$abc$10794$auto$opt_dff.cc:219:make_patterns_logic$1912, asynchronously reset by \wb_rst_i
Extracted 8 gates and 19 wires to a netlist network with 11 inputs and 3 outputs.

3.104.122.1. Executing ABC.

3.104.123. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14657$abc$12481$abc$9716$auto$opt_dff.cc:219:make_patterns_logic$1977, asynchronously reset by \wb_rst_i
Extracted 6 gates and 13 wires to a netlist network with 7 inputs and 3 outputs.

3.104.123.1. Executing ABC.

3.104.124. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14665$abc$12489$abc$9684$auto$opt_dff.cc:219:make_patterns_logic$2016, asynchronously reset by \wb_rst_i
Extracted 13 gates and 27 wires to a netlist network with 14 inputs and 8 outputs.

3.104.124.1. Executing ABC.

3.104.125. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14680$abc$12504$abc$10281$auto$opt_dff.cc:219:make_patterns_logic$1353, asynchronously reset by \wb_rst_i
Extracted 7 gates and 16 wires to a netlist network with 9 inputs and 3 outputs.

3.104.125.1. Executing ABC.

3.104.126. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14689$abc$12513$abc$10874$auto$opt_dff.cc:219:make_patterns_logic$1288, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 6 outputs.

3.104.126.1. Executing ABC.

3.104.127. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14702$abc$12526$abc$10252$auto$opt_dff.cc:219:make_patterns_logic$1392, asynchronously reset by \wb_rst_i
Extracted 13 gates and 25 wires to a netlist network with 12 inputs and 7 outputs.

3.104.127.1. Executing ABC.

3.104.128. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14716$abc$12540$abc$10184$auto$opt_dff.cc:219:make_patterns_logic$1483, asynchronously reset by \wb_rst_i
Extracted 12 gates and 27 wires to a netlist network with 15 inputs and 9 outputs.

3.104.128.1. Executing ABC.

3.104.129. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14730$abc$12554$abc$10101$auto$opt_dff.cc:219:make_patterns_logic$2289, asynchronously reset by \wb_rst_i
Extracted 12 gates and 26 wires to a netlist network with 14 inputs and 5 outputs.

3.104.129.1. Executing ABC.

3.104.130. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14744$abc$12568$abc$10015$auto$opt_dff.cc:219:make_patterns_logic$1704, asynchronously reset by \wb_rst_i
Extracted 8 gates and 18 wires to a netlist network with 10 inputs and 3 outputs.

3.104.130.1. Executing ABC.

3.104.131. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14754$abc$12578$abc$9930$auto$opt_dff.cc:219:make_patterns_logic$1587, asynchronously reset by \wb_rst_i
Extracted 15 gates and 30 wires to a netlist network with 15 inputs and 6 outputs.

3.104.131.1. Executing ABC.

3.104.132. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14770$abc$12595$abc$9844$auto$opt_dff.cc:219:make_patterns_logic$2068, asynchronously reset by \wb_rst_i
Extracted 11 gates and 25 wires to a netlist network with 14 inputs and 6 outputs.

3.104.132.1. Executing ABC.

3.104.133. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14783$abc$12608$abc$9763$auto$opt_dff.cc:219:make_patterns_logic$2172, asynchronously reset by \wb_rst_i
Extracted 10 gates and 21 wires to a netlist network with 11 inputs and 5 outputs.

3.104.133.1. Executing ABC.

3.104.134. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14795$abc$12619$abc$9674$auto$opt_dff.cc:219:make_patterns_logic$1782, asynchronously reset by \wb_rst_i
Extracted 14 gates and 28 wires to a netlist network with 14 inputs and 6 outputs.

3.104.134.1. Executing ABC.

3.104.135. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14810$abc$12635$abc$9348$auto$opt_dff.cc:219:make_patterns_logic$1173, asynchronously reset by \wb_rst_i
Extracted 76 gates and 137 wires to a netlist network with 61 inputs and 35 outputs.

3.104.135.1. Executing ABC.

3.104.136. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14895$abc$11806$abc$10490$auto$opt_dff.cc:219:make_patterns_logic$1161, asynchronously reset by \wb_rst_i
Extracted 31 gates and 56 wires to a netlist network with 25 inputs and 18 outputs.

3.104.136.1. Executing ABC.

3.104.137. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14935$abc$12718$abc$10531$auto$opt_dff.cc:194:make_patterns_logic$2851, asynchronously reset by \wb_rst_i
Extracted 48 gates and 63 wires to a netlist network with 15 inputs and 35 outputs.

3.104.137.1. Executing ABC.

3.104.138. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$14994$abc$12784$abc$10809$auto$opt_dff.cc:219:make_patterns_logic$1167, asynchronously reset by \wb_rst_i
Extracted 24 gates and 36 wires to a netlist network with 12 inputs and 21 outputs.

3.104.138.1. Executing ABC.

3.104.139. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$15032$abc$12822$abc$10346$auto$opt_dff.cc:219:make_patterns_logic$1164, asynchronously reset by \wb_rst_i
Extracted 25 gates and 40 wires to a netlist network with 15 inputs and 22 outputs.

3.104.139.1. Executing ABC.

3.104.140. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, asynchronously reset by \wb_rst_i
Extracted 210 gates and 323 wires to a netlist network with 113 inputs and 47 outputs.

3.104.140.1. Executing ABC.

3.104.141. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \wb_clk_i, enabled by $abc$15319$abc$13111$abc$10895$auto$opt_dff.cc:219:make_patterns_logic$1262, asynchronously reset by \wb_rst_i
Extracted 111 gates and 200 wires to a netlist network with 89 inputs and 6 outputs.

3.104.141.1. Executing ABC.

yosys> opt_ffinv

3.105. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
<suppressed ~10 debug messages>

yosys> opt_merge -nomux

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
<suppressed ~228 debug messages>
Removed a total of 76 cells.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 15076 unused wires.
<suppressed ~25 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.115. Executing BMUXMAP pass.

yosys> demuxmap

3.116. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_jrDQHY/abc_tmp_1.scr

3.117. Executing ABC pass (technology mapping using ABC).

3.117.1. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Extracted 1555 gates and 1793 wires to a netlist network with 238 inputs and 340 outputs.

3.117.1.1. Executing ABC.
DE:   #PIs = 238  #Luts =   601  Max Lvl =   7  Avg Lvl =   5.10  [   0.22 sec. at Pass 0]{firstMap}
DE:   #PIs = 238  #Luts =   553  Max Lvl =   9  Avg Lvl =   6.68  [   4.42 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 238  #Luts =   545  Max Lvl =   8  Avg Lvl =   6.45  [   0.83 sec. at Pass 2]{map}
DE:   #PIs = 238  #Luts =   539  Max Lvl =   8  Avg Lvl =   6.05  [   2.21 sec. at Pass 3]{postMap}
DE:   #PIs = 238  #Luts =   534  Max Lvl =   8  Avg Lvl =   6.29  [   1.00 sec. at Pass 4]{map}
DE:   #PIs = 238  #Luts =   534  Max Lvl =   8  Avg Lvl =   6.29  [   3.38 sec. at Pass 5]{postMap}
DE:   #PIs = 238  #Luts =   534  Max Lvl =   8  Avg Lvl =   6.29  [   1.08 sec. at Pass 6]{map}
DE:   #PIs = 238  #Luts =   533  Max Lvl =   9  Avg Lvl =   6.30  [   3.39 sec. at Pass 7]{postMap}
DE:   #PIs = 238  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.96  [   1.32 sec. at Pass 8]{map}
DE:   #PIs = 238  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.96  [   2.98 sec. at Pass 9]{postMap}
DE:   #PIs = 238  #Luts =   526  Max Lvl =   8  Avg Lvl =   5.94  [   1.66 sec. at Pass 10]{map}
DE:   #PIs = 238  #Luts =   526  Max Lvl =   8  Avg Lvl =   5.94  [   2.92 sec. at Pass 11]{postMap}
DE:   #PIs = 238  #Luts =   526  Max Lvl =   8  Avg Lvl =   5.94  [   1.52 sec. at Pass 12]{map}
DE:   #PIs = 238  #Luts =   526  Max Lvl =   8  Avg Lvl =   5.94  [   2.68 sec. at Pass 13]{postMap}
DE:   #PIs = 238  #Luts =   526  Max Lvl =   8  Avg Lvl =   5.94  [   6.22 sec. at Pass 14]{pushMap}
DE:   #PIs = 238  #Luts =   526  Max Lvl =   8  Avg Lvl =   5.94  [   0.53 sec. at Pass 15]{finalMap}

yosys> opt_expr

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_merge -nomux

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.120. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.121. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.122. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.123. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.124. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.125. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 1745 unused wires.
<suppressed ~2 debug messages>

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.127. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.128. Printing statistics.

=== spi_top ===

   Number of wires:                686
   Number of wire bits:           1253
   Number of public wires:          47
   Number of public wire bits:     614
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                755
     $_DFFE_PP0P_                  178
     $_DFF_PP0_                     51
     $lut                          526


yosys> shregmap -minlen 8 -maxlen 20

3.129. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.130. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.131. Printing statistics.

=== spi_top ===

   Number of wires:                686
   Number of wire bits:           1253
   Number of public wires:          47
   Number of public wire bits:     614
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                755
     $_DFFE_PP0P_                  178
     $_DFF_PP0_                     51
     $lut                          526


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.132. Executing TECHMAP pass (map to technology primitives).

3.132.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.132.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.132.3. Continuing TECHMAP pass.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1120 debug messages>

yosys> opt_expr -mux_undef

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
<suppressed ~14116 debug messages>

yosys> simplemap

3.134. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.135. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
<suppressed ~10140 debug messages>
Removed a total of 3380 cells.

yosys> opt_dff -nodffe -nosdff

3.137. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.138. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 2635 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.139. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
<suppressed ~735 debug messages>

yosys> opt_merge -nomux

3.140. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_muxtree

3.141. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.142. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.144. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 169 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_jrDQHY/abc_tmp_2.scr

3.148. Executing ABC pass (technology mapping using ABC).

3.148.1. Extracting gate netlist of module `\spi_top' to `<abc-temp-dir>/input.blif'..
Extracted 1732 gates and 1973 wires to a netlist network with 239 inputs and 341 outputs.

3.148.1.1. Executing ABC.
DE:   #PIs = 239  #Luts =   530  Max Lvl =   8  Avg Lvl =   5.81  [   0.19 sec. at Pass 0]{firstMap}
DE:   #PIs = 239  #Luts =   530  Max Lvl =   8  Avg Lvl =   5.81  [   5.27 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 239  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.91  [   1.31 sec. at Pass 2]{map}
DE:   #PIs = 239  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.91  [   2.59 sec. at Pass 3]{postMap}
DE:   #PIs = 239  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.91  [   1.76 sec. at Pass 4]{map}
DE:   #PIs = 239  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.91  [   2.60 sec. at Pass 5]{postMap}
DE:   #PIs = 239  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.91  [   4.80 sec. at Pass 6]{pushMap}
DE:   #PIs = 239  #Luts =   529  Max Lvl =   8  Avg Lvl =   5.91  [   0.42 sec. at Pass 7]{finalMap}

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.

yosys> opt_merge -nomux

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.151. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \spi_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.152. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \spi_top.
Performed a total of 0 changes.

yosys> opt_merge

3.153. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\spi_top'.
Removed a total of 0 cells.

yosys> opt_share

3.154. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.155. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.156. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 1735 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.157. Executing OPT_EXPR pass (perform const folding).
Optimizing module spi_top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.158. Executing HIERARCHY pass (managing design hierarchy).

3.158.1. Analyzing design hierarchy..
Top module:  \spi_top

3.158.2. Analyzing design hierarchy..
Top module:  \spi_top
Removed 0 unused modules.

yosys> stat

3.159. Printing statistics.

=== spi_top ===

   Number of wires:                689
   Number of wire bits:           1256
   Number of public wires:          47
   Number of public wire bits:     614
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                758
     $lut                          529
     dffsre                        229


yosys> opt_clean -purge

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \spi_top..
Removed 0 unused cells and 24 unused wires.
<suppressed ~24 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.161. Executing Verilog backend.
Dumping module `\spi_top'.

Warnings: 51 unique messages, 51 total
End of script. Logfile hash: ab199eae2d, CPU: user 12.23s system 0.41s, MEM: 74.72 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 97% 6x abc (248 sec), 0% 34x opt_expr (2 sec), ...
real 174.47
user 238.49
sys 17.07
