
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl diffPhaseEncoder.vhd dataConverter.vhd TETRA_phy.vhd d_encoder_d_decoder.vhd diffPhaseDecoder.vhd

yosys> verific -vhdl diffPhaseEncoder.vhd dataConverter.vhd TETRA_phy.vhd d_encoder_d_decoder.vhd diffPhaseDecoder.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'diffPhaseEncoder.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-INFO [VHDL-1012] diffPhaseEncoder.vhd:22: analyzing entity 'diffphaseencoder'
VERIFIC-INFO [VHDL-1010] diffPhaseEncoder.vhd:32: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'dataConverter.vhd'
VERIFIC-INFO [VHDL-1012] dataConverter.vhd:22: analyzing entity 'dataconverter'
VERIFIC-INFO [VHDL-1010] dataConverter.vhd:31: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'TETRA_phy.vhd'
VERIFIC-INFO [VHDL-1012] TETRA_phy.vhd:22: analyzing entity 'tetra_phy'
VERIFIC-INFO [VHDL-1010] TETRA_phy.vhd:36: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'd_encoder_d_decoder.vhd'
VERIFIC-INFO [VHDL-1012] d_encoder_d_decoder.vhd:22: analyzing entity 'd_encoder_d_decoder'
VERIFIC-INFO [VHDL-1010] d_encoder_d_decoder.vhd:41: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'diffPhaseDecoder.vhd'
VERIFIC-INFO [VHDL-1012] diffPhaseDecoder.vhd:22: analyzing entity 'diffphasedecoder'
VERIFIC-INFO [VHDL-1010] diffPhaseDecoder.vhd:32: analyzing architecture 'behavioral'

yosys> synth_rs -top d_encoder_d_decoder -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top d_encoder_d_decoder

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] d_encoder_d_decoder.vhd:22: processing 'd_encoder_d_decoder(Behavioral)'
VERIFIC-INFO [VHDL-1067] TETRA_phy.vhd:22: processing 'TETRA_phy(Behavioral)'
VERIFIC-INFO [VHDL-1067] dataConverter.vhd:22: processing 'dataConverter(Behavioral)'
VERIFIC-WARNING [VHDL-1251] dataConverter.vhd:40: 'valid_input' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1613] dataConverter.vhd:46: incomplete sensitivity list specified; assuming completeness
VERIFIC-INFO [VHDL-1067] diffPhaseEncoder.vhd:22: processing 'diffPhaseEncoder(Behavioral)'
VERIFIC-WARNING [VHDL-1251] TETRA_phy.vhd:93: 'tetra_clk_36_khz' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1613] TETRA_phy.vhd:98: incomplete sensitivity list specified; assuming completeness
VERIFIC-WARNING [VHDL-1251] TETRA_phy.vhd:103: 'tetra_clk_36_khz' should be on the sensitivity list of the process
VERIFIC-WARNING [VHDL-1613] TETRA_phy.vhd:108: incomplete sensitivity list specified; assuming completeness
VERIFIC-INFO [VHDL-1067] diffPhaseDecoder.vhd:22: processing 'diffPhaseDecoder(Behavioral)'
Importing module d_encoder_d_decoder.
Importing module TETRA_phy(Behavioral).
Importing module dataConverter(Behavioral).
Importing module diffPhaseDecoder(Behavioral).
Importing module diffPhaseEncoder(Behavioral).

3.4.1. Analyzing design hierarchy..
Top module:  \d_encoder_d_decoder
Used module:     \diffPhaseDecoder(Behavioral)
Used module:     \TETRA_phy(Behavioral)
Used module:         \diffPhaseEncoder(Behavioral)
Used module:         \dataConverter(Behavioral)

3.4.2. Analyzing design hierarchy..
Top module:  \d_encoder_d_decoder
Used module:     \diffPhaseDecoder(Behavioral)
Used module:     \TETRA_phy(Behavioral)
Used module:         \diffPhaseEncoder(Behavioral)
Used module:         \dataConverter(Behavioral)
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module diffPhaseEncoder(Behavioral).
<suppressed ~5 debug messages>
Optimizing module diffPhaseDecoder(Behavioral).
Optimizing module dataConverter(Behavioral).
Optimizing module TETRA_phy(Behavioral).
Optimizing module d_encoder_d_decoder.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module TETRA_phy(Behavioral).
Deleting now unused module dataConverter(Behavioral).
Deleting now unused module diffPhaseDecoder(Behavioral).
Deleting now unused module diffPhaseEncoder(Behavioral).
<suppressed ~4 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 4 unused cells and 100 unused wires.
<suppressed ~22 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module d_encoder_d_decoder...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
<suppressed ~12 debug messages>
Removed a total of 4 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $flatten\TETRA_TX.\PHENC.$verific$pr_state_reg$diffPhaseEncoder.vhd:65$205 ($aldff) from module d_encoder_d_decoder.
Changing const-value async load to async reset on $flatten\TETRA_TX.\DCONV.$verific$shift_reg.s_reg_v_reg$dataConverter.vhd:43$52 ($aldff) from module d_encoder_d_decoder.
Removing never-active async load on $flatten\TETRA_RX.$verific$phase_decoder.q_k_old_reg$diffPhaseDecoder.vhd:53$100 ($aldff) from module d_encoder_d_decoder.
Removing never-active async load on $flatten\TETRA_RX.$verific$phase_decoder.i_k_old_reg$diffPhaseDecoder.vhd:53$98 ($aldff) from module d_encoder_d_decoder.
Removing never-active async load on $flatten\TETRA_RX.$verific$phase_decoder.b_k_tmp_reg$diffPhaseDecoder.vhd:53$104 ($aldff) from module d_encoder_d_decoder.
Removing never-active async load on $flatten\TETRA_RX.$verific$phase_decoder.a_k_tmp_reg$diffPhaseDecoder.vhd:53$102 ($aldff) from module d_encoder_d_decoder.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~13 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking d_encoder_d_decoder.TETRA_TX.PHENC.pr_state as FSM state register:
    Users of register don't seem to benefit from recoding.

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~13 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\TETRA_TX.\DCONV.$verific$shift_reg.s_reg_v_reg$dataConverter.vhd:43$52 ($adff) from module d_encoder_d_decoder (D = { \TETRA_TX.DCONV.shift_reg.s_reg_v [0] \tx_tetra_bit_stream_input }, Q = \TETRA_TX.DCONV.shift_reg.s_reg_v).
Adding EN signal on $flatten\TETRA_RX.$verific$phase_decoder.q_k_old_reg$diffPhaseDecoder.vhd:53$100 ($dff) from module d_encoder_d_decoder (D = $flatten\TETRA_RX.$verific$n173$71, Q = \TETRA_RX.phase_decoder.q_k_old).
Adding EN signal on $flatten\TETRA_RX.$verific$phase_decoder.i_k_old_reg$diffPhaseDecoder.vhd:53$98 ($dff) from module d_encoder_d_decoder (D = $flatten\TETRA_RX.$verific$n164$70, Q = \TETRA_RX.phase_decoder.i_k_old).
Adding EN signal on $flatten\TETRA_RX.$verific$phase_decoder.b_k_tmp_reg$diffPhaseDecoder.vhd:53$104 ($dff) from module d_encoder_d_decoder (D = $flatten\TETRA_RX.$verific$n111$66 [15:0], Q = \TETRA_RX.phase_decoder.b_k_tmp).
Adding EN signal on $flatten\TETRA_RX.$verific$phase_decoder.a_k_tmp_reg$diffPhaseDecoder.vhd:53$102 ($dff) from module d_encoder_d_decoder (D = $flatten\TETRA_RX.$verific$n43$62, Q = \TETRA_RX.phase_decoder.a_k_tmp).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 7 unused cells and 7 unused wires.
<suppressed ~8 debug messages>

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_muxtree

3.49. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.50. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.52. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.53. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 3

yosys> wreduce -keepdc

3.56. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 24) from mux cell d_encoder_d_decoder.$flatten\TETRA_TX.\PHENC.$verific$mux_171$diffPhaseEncoder.vhd:211$215 ($mux).
Removed top 1 bits (of 8) from mux cell d_encoder_d_decoder.$flatten\TETRA_TX.\PHENC.$auto$bmuxmap.cc:60:execute$237 ($mux).
Removed top 2 bits (of 8) from mux cell d_encoder_d_decoder.$flatten\TETRA_TX.\PHENC.$auto$bmuxmap.cc:60:execute$236 ($mux).
Removed top 2 bits (of 8) from mux cell d_encoder_d_decoder.$flatten\TETRA_TX.\PHENC.$auto$bmuxmap.cc:60:execute$234 ($mux).
Removed top 8 bits (of 16) from FF cell d_encoder_d_decoder.$auto$ff.cc:262:slice$261 ($dffe).
Removed top 8 bits (of 16) from FF cell d_encoder_d_decoder.$auto$ff.cc:262:slice$256 ($dffe).
Removed top 9 bits (of 17) from port Y of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$sub_13$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:974$88 ($sub).
Removed top 9 bits (of 17) from port A of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$sub_13$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:974$88 ($sub).
Removed top 9 bits (of 17) from port B of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$sub_13$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:974$88 ($sub).
Removed top 8 bits (of 16) from port Y of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$add_9$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:720$84 ($add).
Removed top 8 bits (of 16) from port A of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$add_9$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:720$84 ($add).
Removed top 8 bits (of 16) from port B of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$add_9$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:720$84 ($add).
Removed top 8 bits (of 16) from port Y of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$mult_11$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$86 ($mul).
Removed top 8 bits (of 16) from port Y of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$mult_12$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$87 ($mul).
Removed top 8 bits (of 16) from port Y of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$mult_5$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$82 ($mul).
Removed top 8 bits (of 16) from port Y of cell d_encoder_d_decoder.$flatten\TETRA_RX.$verific$mult_6$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$83 ($mul).
Removed top 9 bits (of 17) from wire d_encoder_d_decoder.$flatten\TETRA_RX.$verific$n111$66.
Removed top 8 bits (of 16) from wire d_encoder_d_decoder.$flatten\TETRA_RX.$verific$n23$61.
Removed top 8 bits (of 16) from wire d_encoder_d_decoder.$flatten\TETRA_RX.$verific$n43$62.
Removed top 8 bits (of 16) from wire d_encoder_d_decoder.$flatten\TETRA_RX.$verific$n6$60.
Removed top 8 bits (of 16) from wire d_encoder_d_decoder.$flatten\TETRA_RX.$verific$n77$64.
Removed top 8 bits (of 16) from wire d_encoder_d_decoder.$flatten\TETRA_RX.$verific$n94$65.
Removed top 1 bits (of 32) from wire d_encoder_d_decoder.$flatten\TETRA_TX.\PHENC.$auto$bmuxmap.cc:58:execute$233.
Removed top 1 bits (of 3) from wire d_encoder_d_decoder.$flatten\TETRA_TX.\PHENC.$verific$n490$194.

yosys> peepopt

3.57. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.58. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 9 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.59. Executing BMUXMAP pass.

yosys> demuxmap

3.60. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.61. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module d_encoder_d_decoder:
  creating $macc model for $flatten\TETRA_RX.$verific$add_9$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:720$84 ($add).
  creating $macc model for $flatten\TETRA_RX.$verific$mult_11$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$86 ($mul).
  creating $macc model for $flatten\TETRA_RX.$verific$mult_12$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$87 ($mul).
  creating $macc model for $flatten\TETRA_RX.$verific$mult_5$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$82 ($mul).
  creating $macc model for $flatten\TETRA_RX.$verific$mult_6$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$83 ($mul).
  creating $macc model for $flatten\TETRA_RX.$verific$sub_13$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:974$88 ($sub).
  merging $macc model for $flatten\TETRA_RX.$verific$mult_11$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$86 into $flatten\TETRA_RX.$verific$sub_13$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:974$88.
  merging $macc model for $flatten\TETRA_RX.$verific$mult_12$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$87 into $flatten\TETRA_RX.$verific$sub_13$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:974$88.
  merging $macc model for $flatten\TETRA_RX.$verific$mult_5$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$82 into $flatten\TETRA_RX.$verific$add_9$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:720$84.
  merging $macc model for $flatten\TETRA_RX.$verific$mult_6$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:653$83 into $flatten\TETRA_RX.$verific$add_9$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:720$84.
  creating $macc cell for $flatten\TETRA_RX.$verific$sub_13$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:974$88: $auto$alumacc.cc:365:replace_macc$274
  creating $macc cell for $flatten\TETRA_RX.$verific$add_9$../vhdl_packages/vhdl_2008/src/syn_arit.vhd:720$84: $auto$alumacc.cc:365:replace_macc$275
  created 0 $alu and 2 $macc cells.

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge -nomux

3.63. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.64. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.65. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.66. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.67. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.68. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.69. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 4 unused cells and 4 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_muxtree

3.71. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~10 debug messages>

yosys> opt_reduce

3.72. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.74. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.75. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> opt_expr

3.77. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 2

yosys> stat

3.78. Printing statistics.

=== d_encoder_d_decoder ===

   Number of wires:                106
   Number of wire bits:            460
   Number of public wires:          57
   Number of public wire bits:     223
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 41
     $adffe                          1
     $and                            3
     $dff                            3
     $dffe                           4
     $macc                           2
     $mux                           24
     $not                            3
     $reduce_and                     1


yosys> memory -nomap

3.79. Executing MEMORY pass.

yosys> opt_mem

3.79.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.79.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.79.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.79.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.79.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.79.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> memory_share

3.79.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.79.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.79.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> memory_collect

3.79.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.80. Printing statistics.

=== d_encoder_d_decoder ===

   Number of wires:                106
   Number of wire bits:            460
   Number of public wires:          57
   Number of public wire bits:     223
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 41
     $adffe                          1
     $and                            3
     $dff                            3
     $dffe                           4
     $macc                           2
     $mux                           24
     $not                            3
     $reduce_and                     1


yosys> muxpack

3.81. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~22 debug messages>

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> pmuxtree

3.83. Executing PMUXTREE pass.

yosys> muxpack

3.84. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~22 debug messages>

yosys> memory_map

3.85. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.86. Printing statistics.

=== d_encoder_d_decoder ===

   Number of wires:                106
   Number of wire bits:            460
   Number of public wires:          57
   Number of public wire bits:     223
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                 41
     $adffe                          1
     $and                            3
     $dff                            3
     $dffe                           4
     $macc                           2
     $mux                           24
     $not                            3
     $reduce_and                     1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.87. Executing TECHMAP pass (map to technology primitives).

3.87.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.87.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.87.3. Continuing TECHMAP pass.
Using extmapper maccmap for cells of type $macc.
  add \TETRA_RX.phase_decoder.i_k_old * \rx_q_k (8x8 bits, signed)
  sub \rx_i_k * \TETRA_RX.phase_decoder.q_k_old (8x8 bits, signed)
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $dffe.
  add \rx_i_k * \TETRA_RX.phase_decoder.i_k_old (8x8 bits, signed)
  add \rx_q_k * \TETRA_RX.phase_decoder.q_k_old (8x8 bits, signed)
Using template $paramod\_90_fa\WIDTH=32'00000000000000000000000000001000 for cells of type $fa.
Using template $paramod$a1bc51c02ce12ac21eb18988e83292af48ed7d72\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001000 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~656 debug messages>

yosys> stat

3.88. Printing statistics.

=== d_encoder_d_decoder ===

   Number of wires:                728
   Number of wire bits:           7209
   Number of public wires:          57
   Number of public wire bits:     223
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2006
     $_AND_                        820
     $_DFFE_NP0P_                    2
     $_DFFE_NP_                     32
     $_DFF_N_                        5
     $_MUX_                        226
     $_NOT_                         95
     $_OR_                         280
     $_XOR_                        546


yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
<suppressed ~982 debug messages>

yosys> opt_merge -nomux

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
<suppressed ~210 debug messages>
Removed a total of 70 cells.

yosys> opt_muxtree

3.91. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.92. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.93. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.94. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.95. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.96. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 120 unused cells and 477 unused wires.
<suppressed ~121 debug messages>

yosys> opt_expr

3.97. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
<suppressed ~3 debug messages>

yosys> opt_muxtree

3.98. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.99. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.100. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.101. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.102. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.103. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> opt_expr

3.104. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.105. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
<suppressed ~28 debug messages>

yosys> techmap -map +/techmap.v

3.106. Executing TECHMAP pass (map to technology primitives).

3.106.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.106.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.107. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge -nomux

3.108. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.109. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.110. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.111. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 1

yosys> abc -dff

3.115. Executing ABC pass (technology mapping using ABC).

3.115.1. Summary of detected clock domains:
  622 cells in clk=!\rx_clk_18_KHz, en=$auto$opt_dff.cc:219:make_patterns_logic$259, arst={ }, srst={ }
  33 cells in clk=!\tx_tetra_clk_18_KHz, en={ }, arst={ }, srst={ }
  182 cells in clk=!\rx_clk_18_KHz, en=\rx_en, arst={ }, srst={ }
  26 cells in clk=!\tx_tetra_clk_36_KHz, en={ }, arst={ }, srst={ }
  6 cells in clk=!\tx_tetra_clk_36_KHz, en=\tx_tetra_valid_input, arst=\tx_tetra_rst, srst={ }

3.115.2. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by $auto$opt_dff.cc:219:make_patterns_logic$259
Extracted 622 gates and 769 wires to a netlist network with 147 inputs and 17 outputs.

3.115.2.1. Executing ABC.

3.115.3. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_18_KHz
Extracted 33 gates and 48 wires to a netlist network with 13 inputs and 8 outputs.

3.115.3.1. Executing ABC.

3.115.4. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by \rx_en
Extracted 182 gates and 200 wires to a netlist network with 17 inputs and 144 outputs.

3.115.4.1. Executing ABC.

3.115.5. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz
Extracted 26 gates and 33 wires to a netlist network with 5 inputs and 12 outputs.

3.115.5.1. Executing ABC.

3.115.6. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz, enabled by \tx_tetra_valid_input, asynchronously reset by \tx_tetra_rst
Extracted 6 gates and 7 wires to a netlist network with 1 inputs and 6 outputs.

3.115.6.1. Executing ABC.

yosys> abc -dff

3.116. Executing ABC pass (technology mapping using ABC).

3.116.1. Summary of detected clock domains:
  14 cells in clk=!\tx_tetra_clk_36_KHz, en={ }, arst={ }, srst={ }
  46 cells in clk=!\tx_tetra_clk_18_KHz, en={ }, arst={ }, srst={ }
  561 cells in clk=!\rx_clk_18_KHz, en=$abc$2767$auto$opt_dff.cc:219:make_patterns_logic$259, arst={ }, srst={ }
  177 cells in clk=!\rx_clk_18_KHz, en=\rx_en, arst={ }, srst={ }
  6 cells in clk=!\tx_tetra_clk_36_KHz, en=\tx_tetra_valid_input, arst=\tx_tetra_rst, srst={ }

3.116.2. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz
Extracted 14 gates and 20 wires to a netlist network with 6 inputs and 9 outputs.

3.116.2.1. Executing ABC.

3.116.3. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_18_KHz
Extracted 46 gates and 58 wires to a netlist network with 12 inputs and 9 outputs.

3.116.3.1. Executing ABC.

3.116.4. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by $abc$2767$auto$opt_dff.cc:219:make_patterns_logic$259
Extracted 561 gates and 709 wires to a netlist network with 148 inputs and 17 outputs.

3.116.4.1. Executing ABC.

3.116.5. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by \rx_en
Extracted 177 gates and 194 wires to a netlist network with 17 inputs and 145 outputs.

3.116.5.1. Executing ABC.

3.116.6. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz, enabled by \tx_tetra_valid_input, asynchronously reset by \tx_tetra_rst
Extracted 6 gates and 7 wires to a netlist network with 1 inputs and 6 outputs.

3.116.6.1. Executing ABC.

yosys> abc -dff

3.117. Executing ABC pass (technology mapping using ABC).

3.117.1. Summary of detected clock domains:
  14 cells in clk=!\tx_tetra_clk_36_KHz, en={ }, arst={ }, srst={ }
  47 cells in clk=!\tx_tetra_clk_18_KHz, en={ }, arst={ }, srst={ }
  561 cells in clk=!\rx_clk_18_KHz, en=$abc$3665$abc$2767$auto$opt_dff.cc:219:make_patterns_logic$259, arst={ }, srst={ }
  177 cells in clk=!\rx_clk_18_KHz, en=\rx_en, arst={ }, srst={ }
  6 cells in clk=!\tx_tetra_clk_36_KHz, en=\tx_tetra_valid_input, arst=\tx_tetra_rst, srst={ }

3.117.2. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz
Extracted 14 gates and 20 wires to a netlist network with 6 inputs and 9 outputs.

3.117.2.1. Executing ABC.

3.117.3. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_18_KHz
Extracted 47 gates and 59 wires to a netlist network with 12 inputs and 9 outputs.

3.117.3.1. Executing ABC.

3.117.4. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by $abc$3665$abc$2767$auto$opt_dff.cc:219:make_patterns_logic$259
Extracted 561 gates and 709 wires to a netlist network with 148 inputs and 17 outputs.

3.117.4.1. Executing ABC.

3.117.5. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by \rx_en
Extracted 177 gates and 194 wires to a netlist network with 17 inputs and 145 outputs.

3.117.5.1. Executing ABC.

3.117.6. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz, enabled by \tx_tetra_valid_input, asynchronously reset by \tx_tetra_rst
Extracted 6 gates and 7 wires to a netlist network with 1 inputs and 6 outputs.

3.117.6.1. Executing ABC.

yosys> abc -dff

3.118. Executing ABC pass (technology mapping using ABC).

3.118.1. Summary of detected clock domains:
  561 cells in clk=!\rx_clk_18_KHz, en=$abc$4489$abc$3665$abc$2767$auto$opt_dff.cc:219:make_patterns_logic$259, arst={ }, srst={ }
  14 cells in clk=!\tx_tetra_clk_36_KHz, en={ }, arst={ }, srst={ }
  38 cells in clk=!\tx_tetra_clk_18_KHz, en={ }, arst={ }, srst={ }
  177 cells in clk=!\rx_clk_18_KHz, en=\rx_en, arst={ }, srst={ }
  6 cells in clk=!\tx_tetra_clk_36_KHz, en=\tx_tetra_valid_input, arst=\tx_tetra_rst, srst={ }

3.118.2. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by $abc$4489$abc$3665$abc$2767$auto$opt_dff.cc:219:make_patterns_logic$259
Extracted 561 gates and 709 wires to a netlist network with 148 inputs and 17 outputs.

3.118.2.1. Executing ABC.

3.118.3. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz
Extracted 14 gates and 20 wires to a netlist network with 6 inputs and 9 outputs.

3.118.3.1. Executing ABC.

3.118.4. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_18_KHz
Extracted 38 gates and 50 wires to a netlist network with 12 inputs and 9 outputs.

3.118.4.1. Executing ABC.

3.118.5. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \rx_clk_18_KHz, enabled by \rx_en
Extracted 177 gates and 194 wires to a netlist network with 17 inputs and 145 outputs.

3.118.5.1. Executing ABC.

3.118.6. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Found matching negedge clock domain: \tx_tetra_clk_36_KHz, enabled by \tx_tetra_valid_input, asynchronously reset by \tx_tetra_rst
Extracted 6 gates and 7 wires to a netlist network with 1 inputs and 6 outputs.

3.118.6.1. Executing ABC.

yosys> opt_ffinv

3.119. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.120. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge -nomux

3.121. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.122. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.123. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.124. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.125. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.126. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.127. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 3577 unused wires.
<suppressed ~8 debug messages>

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.129. Executing BMUXMAP pass.

yosys> demuxmap

3.130. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_WQdUhg/abc_tmp_1.scr

3.131. Executing ABC pass (technology mapping using ABC).

3.131.1. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Extracted 757 gates and 798 wires to a netlist network with 41 inputs and 44 outputs.

3.131.1.1. Executing ABC.
DE:   #PIs =  41  #Luts =   245  Max Lvl =   6  Avg Lvl =   2.09  [   0.11 sec. at Pass 0]{firstMap}
DE:   #PIs =  41  #Luts =   230  Max Lvl =   8  Avg Lvl =   2.59  [   3.29 sec. at Pass 1]{initMapFlow}
DE:   #PIs =  41  #Luts =   224  Max Lvl =   8  Avg Lvl =   2.59  [   0.52 sec. at Pass 2]{map}
DE:   #PIs =  41  #Luts =   222  Max Lvl =   8  Avg Lvl =   2.59  [   1.39 sec. at Pass 3]{postMap}
DE:   #PIs =  41  #Luts =   219  Max Lvl =   8  Avg Lvl =   2.55  [   1.61 sec. at Pass 4]{map}
DE:   #PIs =  41  #Luts =   219  Max Lvl =   8  Avg Lvl =   2.55  [   2.34 sec. at Pass 5]{postMap}
DE:   #PIs =  41  #Luts =   216  Max Lvl =   8  Avg Lvl =   2.41  [   1.18 sec. at Pass 6]{map}
DE:   #PIs =  41  #Luts =   216  Max Lvl =   8  Avg Lvl =   2.41  [   2.53 sec. at Pass 7]{postMap}
DE:   #PIs =  41  #Luts =   213  Max Lvl =   9  Avg Lvl =   2.48  [   1.39 sec. at Pass 8]{map}
DE:   #PIs =  41  #Luts =   213  Max Lvl =   9  Avg Lvl =   2.48  [   3.04 sec. at Pass 9]{postMap}
DE:   #PIs =  41  #Luts =   213  Max Lvl =   9  Avg Lvl =   2.48  [   1.50 sec. at Pass 10]{map}
DE:   #PIs =  41  #Luts =   213  Max Lvl =   9  Avg Lvl =   2.48  [   2.49 sec. at Pass 11]{postMap}
DE:   #PIs =  41  #Luts =   210  Max Lvl =   8  Avg Lvl =   2.48  [   6.72 sec. at Pass 12]{pushMap}
DE:   #PIs =  41  #Luts =   210  Max Lvl =   8  Avg Lvl =   2.48  [   1.45 sec. at Pass 13]{map}
DE:   #PIs =  41  #Luts =   210  Max Lvl =   8  Avg Lvl =   2.48  [   2.48 sec. at Pass 14]{postMap}
DE:   #PIs =  41  #Luts =   210  Max Lvl =   8  Avg Lvl =   2.48  [   1.64 sec. at Pass 15]{map}
DE:   #PIs =  41  #Luts =   210  Max Lvl =   8  Avg Lvl =   2.48  [   8.69 sec. at Pass 16]{pushMap}
DE:   #PIs =  41  #Luts =   210  Max Lvl =   8  Avg Lvl =   2.48  [   0.49 sec. at Pass 17]{finalMap}

yosys> opt_expr

3.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge -nomux

3.133. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.134. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.135. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.137. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.138. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 720 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.141. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.142. Printing statistics.

=== d_encoder_d_decoder ===

   Number of wires:                271
   Number of wire bits:            419
   Number of public wires:          48
   Number of public wire bits:     196
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                249
     $_DFFE_NP0P_                    2
     $_DFFE_NP_                     32
     $_DFF_N_                        5
     $lut                          210


yosys> shregmap -minlen 8 -maxlen 20

3.143. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.144. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.145. Printing statistics.

=== d_encoder_d_decoder ===

   Number of wires:                271
   Number of wire bits:            419
   Number of public wires:          48
   Number of public wire bits:     196
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                249
     $_DFFE_NP0P_                   34
     $_DFF_N_                        5
     $lut                          210


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.146. Executing TECHMAP pass (map to technology primitives).

3.146.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.146.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.146.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template $paramod\$_DFF_N_\_TECHMAP_WIREINIT_Q_=1'0 for cells of type $_DFF_N_.
Using template $paramod\$_DFFE_NP0P_\_TECHMAP_WIREINIT_Q_=1'0 for cells of type $_DFFE_NP0P_.
Using template $paramod\$_DFF_N_\_TECHMAP_WIREINIT_Q_=1'x for cells of type $_DFF_N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~452 debug messages>

yosys> opt_expr -mux_undef

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
<suppressed ~4373 debug messages>

yosys> simplemap

3.148. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
<suppressed ~5913 debug messages>
Removed a total of 1971 cells.

yosys> opt_dff -nodffe -nosdff

3.151. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.152. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 587 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.153. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
<suppressed ~169 debug messages>

yosys> opt_merge -nomux

3.154. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.155. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.156. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.158. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.159. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..

yosys> opt_expr

3.161. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_WQdUhg/abc_tmp_2.scr

3.162. Executing ABC pass (technology mapping using ABC).

3.162.1. Extracting gate netlist of module `\d_encoder_d_decoder' to `<abc-temp-dir>/input.blif'..
Extracted 1612 gates and 1655 wires to a netlist network with 41 inputs and 45 outputs.

3.162.1.1. Executing ABC.
DE:   #PIs =  41  #Luts =   211  Max Lvl =   7  Avg Lvl =   2.20  [   0.20 sec. at Pass 0]{firstMap}
DE:   #PIs =  41  #Luts =   211  Max Lvl =   7  Avg Lvl =   2.20  [   3.54 sec. at Pass 1]{initMapFlow}
DE:   #PIs =  41  #Luts =   211  Max Lvl =   7  Avg Lvl =   2.20  [   0.80 sec. at Pass 2]{map}
DE:   #PIs =  41  #Luts =   211  Max Lvl =   7  Avg Lvl =   2.20  [   1.63 sec. at Pass 3]{postMap}
DE:   #PIs =  41  #Luts =   211  Max Lvl =   7  Avg Lvl =   2.20  [   1.28 sec. at Pass 4]{map}
DE:   #PIs =  41  #Luts =   211  Max Lvl =   7  Avg Lvl =   2.20  [   2.25 sec. at Pass 5]{postMap}
DE:   #PIs =  41  #Luts =   207  Max Lvl =   9  Avg Lvl =   2.44  [   6.36 sec. at Pass 6]{pushMap}
DE:   #PIs =  41  #Luts =   207  Max Lvl =   9  Avg Lvl =   2.44  [   0.86 sec. at Pass 7]{map}
DE:   #PIs =  41  #Luts =   207  Max Lvl =   9  Avg Lvl =   2.44  [   1.75 sec. at Pass 8]{postMap}
DE:   #PIs =  41  #Luts =   207  Max Lvl =   9  Avg Lvl =   2.44  [   1.42 sec. at Pass 9]{map}
DE:   #PIs =  41  #Luts =   207  Max Lvl =   9  Avg Lvl =   2.44  [   8.54 sec. at Pass 10]{pushMap}
DE:   #PIs =  41  #Luts =   207  Max Lvl =   9  Avg Lvl =   2.44  [   0.50 sec. at Pass 11]{finalMap}

yosys> opt_expr

3.163. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.

yosys> opt_merge -nomux

3.164. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.165. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \d_encoder_d_decoder..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.166. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \d_encoder_d_decoder.
Performed a total of 0 changes.

yosys> opt_merge

3.167. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\d_encoder_d_decoder'.
Removed a total of 0 cells.

yosys> opt_share

3.168. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.169. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.170. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 885 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.171. Executing OPT_EXPR pass (perform const folding).
Optimizing module d_encoder_d_decoder.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.172. Executing HIERARCHY pass (managing design hierarchy).

3.172.1. Analyzing design hierarchy..
Top module:  \d_encoder_d_decoder

3.172.2. Analyzing design hierarchy..
Top module:  \d_encoder_d_decoder
Removed 0 unused modules.

yosys> stat

3.173. Printing statistics.

=== d_encoder_d_decoder ===

   Number of wires:                268
   Number of wire bits:            416
   Number of public wires:          48
   Number of public wire bits:     196
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                246
     $lut                          207
     dffnsre                        39


yosys> opt_clean -purge

3.174. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \d_encoder_d_decoder..
Removed 0 unused cells and 31 unused wires.
<suppressed ~31 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.175. Executing Verilog backend.
Dumping module `\d_encoder_d_decoder'.

Warnings: 6 unique messages, 6 total
End of script. Logfile hash: ffc8fd6b61, CPU: user 2.97s system 0.06s, MEM: 49.34 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 99% 6x abc (384 sec), 0% 30x opt_expr (1 sec), ...
real 85.74
user 367.37
sys 19.92
