
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k arbiter.v

yosys> verific -vlog2k arbiter.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'arbiter.v'

yosys> synth_rs -top top -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top top

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] arbiter.v:1: compiling module 'top'
Importing module top.

3.4.1. Analyzing design hierarchy..
Top module:  \top

3.4.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 11839 unused wires.
<suppressed ~11840 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module top...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.25. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.25.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.25.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.25.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.25.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> fsm_opt

3.25.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.25.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.25.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.25.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.26. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.29. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.30. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.31. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.32. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.33. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.35. Executing WREDUCE pass (reducing word size of cells).

yosys> peepopt

3.36. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> bmuxmap

3.38. Executing BMUXMAP pass.

yosys> demuxmap

3.39. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.40. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module top:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.42. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.43. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.44. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.46. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.47. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> stat

3.50. Printing statistics.

=== top ===

   Number of wires:              23489
   Number of wire bits:          23489
   Number of public wires:       12095
   Number of public wire bits:   12095
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              23233
     $and                        11838
     $not                        11394
     $or                             1


yosys> memory -nomap

3.51. Executing MEMORY pass.

yosys> opt_mem

3.51.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.51.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.51.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.51.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.51.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.51.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_share

3.51.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.51.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.51.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> memory_collect

3.51.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.52. Printing statistics.

=== top ===

   Number of wires:              23489
   Number of wire bits:          23489
   Number of public wires:       12095
   Number of public wire bits:   12095
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              23233
     $and                        11838
     $not                        11394
     $or                             1


yosys> muxpack

3.53. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> pmuxtree

3.55. Executing PMUXTREE pass.

yosys> muxpack

3.56. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.

yosys> memory_map

3.57. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.58. Printing statistics.

=== top ===

   Number of wires:              23489
   Number of wire bits:          23489
   Number of public wires:       12095
   Number of public wire bits:   12095
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              23233
     $and                        11838
     $not                        11394
     $or                             1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.59. Executing TECHMAP pass (map to technology primitives).

3.59.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.59.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.59.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~23304 debug messages>

yosys> stat

3.60. Printing statistics.

=== top ===

   Number of wires:              23489
   Number of wire bits:          23489
   Number of public wires:       12095
   Number of public wire bits:   12095
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              23233
     $_AND_                      11838
     $_NOT_                      11394
     $_OR_                           1


yosys> opt_expr

3.61. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.62. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.63. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.64. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.65. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.66. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.67. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.69. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> opt_expr -full

3.70. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> techmap -map +/techmap.v

3.71. Executing TECHMAP pass (map to technology primitives).

3.71.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.71.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.72. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.74. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.75. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.77. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.78. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.79. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> abc -dff

3.80. Executing ABC pass (technology mapping using ABC).

3.80.1. Summary of detected clock domains:
  23233 cells in clk={ }, en={ }, arst={ }, srst={ }

3.80.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 23233 gates and 23489 wires to a netlist network with 256 inputs and 129 outputs.

3.80.2.1. Executing ABC.

yosys> abc -dff

3.81. Executing ABC pass (technology mapping using ABC).

3.81.1. Summary of detected clock domains:
  11849 cells in clk={ }, en={ }, arst={ }, srst={ }

3.81.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 11849 gates and 12105 wires to a netlist network with 256 inputs and 129 outputs.

3.81.2.1. Executing ABC.

yosys> abc -dff

3.82. Executing ABC pass (technology mapping using ABC).

3.82.1. Summary of detected clock domains:
  11841 cells in clk={ }, en={ }, arst={ }, srst={ }

3.82.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 11841 gates and 12097 wires to a netlist network with 256 inputs and 129 outputs.

3.82.2.1. Executing ABC.

yosys> abc -dff

3.83. Executing ABC pass (technology mapping using ABC).

3.83.1. Summary of detected clock domains:
  11842 cells in clk={ }, en={ }, arst={ }, srst={ }

3.83.2. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 11842 gates and 12098 wires to a netlist network with 256 inputs and 129 outputs.

3.83.2.1. Executing ABC.

yosys> opt_ffinv

3.84. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.85. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.87. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.88. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.89. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.90. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 59789 unused wires.
<suppressed ~11711 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.94. Executing BMUXMAP pass.

yosys> demuxmap

3.95. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_ObouPJ/abc_tmp_1.scr

3.96. Executing ABC pass (technology mapping using ABC).

3.96.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 11842 gates and 12098 wires to a netlist network with 256 inputs and 129 outputs.

3.96.1.1. Executing ABC.
DE:   #PIs = 256  #Luts =  2722  Max Lvl =  18  Avg Lvl =  17.90  [   0.70 sec. at Pass 0]{firstMap}
DE:   #PIs = 256  #Luts =  1661  Max Lvl =  10  Avg Lvl =   7.48  [  54.89 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 256  #Luts =  1485  Max Lvl =  11  Avg Lvl =   8.60  [   4.20 sec. at Pass 2]{map}
DE:   #PIs = 256  #Luts =  1220  Max Lvl =  12  Avg Lvl =   8.94  [  11.20 sec. at Pass 3]{postMap}
DE:   #PIs = 256  #Luts =  1192  Max Lvl =  13  Avg Lvl =   9.35  [   2.83 sec. at Pass 4]{map}
DE:   #PIs = 256  #Luts =  1098  Max Lvl =  12  Avg Lvl =   9.22  [   6.79 sec. at Pass 5]{postMap}
DE:   #PIs = 256  #Luts =  1084  Max Lvl =  14  Avg Lvl =   9.90  [   2.39 sec. at Pass 6]{map}
DE:   #PIs = 256  #Luts =   995  Max Lvl =  15  Avg Lvl =  10.06  [   5.06 sec. at Pass 7]{postMap}
DE:   #PIs = 256  #Luts =   995  Max Lvl =  15  Avg Lvl =  10.06  [   1.89 sec. at Pass 8]{map}
DE:   #PIs = 256  #Luts =   955  Max Lvl =  13  Avg Lvl =  10.16  [   5.00 sec. at Pass 9]{postMap}
DE:   #PIs = 256  #Luts =   955  Max Lvl =  13  Avg Lvl =  10.16  [   1.80 sec. at Pass 10]{map}
DE:   #PIs = 256  #Luts =   930  Max Lvl =  14  Avg Lvl =  10.17  [   4.66 sec. at Pass 11]{postMap}
DE:   #PIs = 256  #Luts =   929  Max Lvl =  14  Avg Lvl =  10.50  [   1.67 sec. at Pass 12]{map}
DE:   #PIs = 256  #Luts =   910  Max Lvl =  14  Avg Lvl =  10.19  [   4.10 sec. at Pass 13]{postMap}
DE:   #PIs = 256  #Luts =   905  Max Lvl =  14  Avg Lvl =  10.49  [   1.35 sec. at Pass 14]{map}
DE:   #PIs = 256  #Luts =   876  Max Lvl =  15  Avg Lvl =  10.91  [   3.14 sec. at Pass 15]{postMap}
DE:   #PIs = 256  #Luts =   876  Max Lvl =  15  Avg Lvl =  10.91  [   1.98 sec. at Pass 16]{map}
DE:   #PIs = 256  #Luts =   860  Max Lvl =  15  Avg Lvl =  11.50  [   3.05 sec. at Pass 17]{postMap}
DE:   #PIs = 256  #Luts =   857  Max Lvl =  15  Avg Lvl =  11.17  [   1.35 sec. at Pass 18]{map}
DE:   #PIs = 256  #Luts =   836  Max Lvl =  15  Avg Lvl =  11.76  [   3.47 sec. at Pass 19]{postMap}
DE:   #PIs = 256  #Luts =   835  Max Lvl =  16  Avg Lvl =  11.46  [   1.29 sec. at Pass 20]{map}
DE:   #PIs = 256  #Luts =   820  Max Lvl =  16  Avg Lvl =  11.59  [   3.34 sec. at Pass 21]{postMap}
DE:   #PIs = 256  #Luts =   820  Max Lvl =  16  Avg Lvl =  11.59  [   1.27 sec. at Pass 22]{map}
DE:   #PIs = 256  #Luts =   807  Max Lvl =  14  Avg Lvl =  11.22  [   3.34 sec. at Pass 23]{postMap}
DE:   #PIs = 256  #Luts =   807  Max Lvl =  14  Avg Lvl =  11.22  [   1.31 sec. at Pass 24]{map}
DE:   #PIs = 256  #Luts =   790  Max Lvl =  15  Avg Lvl =  11.48  [   3.06 sec. at Pass 25]{postMap}
DE:   #PIs = 256  #Luts =   787  Max Lvl =  15  Avg Lvl =  11.43  [   1.30 sec. at Pass 26]{map}
DE:   #PIs = 256  #Luts =   773  Max Lvl =  14  Avg Lvl =  11.29  [   3.22 sec. at Pass 27]{postMap}
DE:   #PIs = 256  #Luts =   773  Max Lvl =  14  Avg Lvl =  11.29  [   1.18 sec. at Pass 28]{map}
DE:   #PIs = 256  #Luts =   762  Max Lvl =  16  Avg Lvl =  11.26  [   3.37 sec. at Pass 29]{postMap}
DE:   #PIs = 256  #Luts =   762  Max Lvl =  16  Avg Lvl =  11.26  [   1.64 sec. at Pass 30]{map}
DE:   #PIs = 256  #Luts =   759  Max Lvl =  15  Avg Lvl =  11.91  [   3.44 sec. at Pass 31]{postMap}
DE:   #PIs = 256  #Luts =   754  Max Lvl =  13  Avg Lvl =  10.70  [   1.60 sec. at Pass 32]{map}
DE:   #PIs = 256  #Luts =   749  Max Lvl =  16  Avg Lvl =  11.76  [   3.23 sec. at Pass 33]{postMap}
DE:   #PIs = 256  #Luts =   746  Max Lvl =  16  Avg Lvl =  11.98  [   1.76 sec. at Pass 34]{map}
DE:   #PIs = 256  #Luts =   731  Max Lvl =  16  Avg Lvl =  11.70  [   3.14 sec. at Pass 35]{postMap}
DE:   #PIs = 256  #Luts =   731  Max Lvl =  16  Avg Lvl =  11.70  [   2.03 sec. at Pass 36]{map}
DE:   #PIs = 256  #Luts =   726  Max Lvl =  16  Avg Lvl =  11.88  [   4.89 sec. at Pass 37]{postMap}
DE:   #PIs = 256  #Luts =   722  Max Lvl =  15  Avg Lvl =  11.64  [   1.94 sec. at Pass 38]{map}
DE:   #PIs = 256  #Luts =   713  Max Lvl =  16  Avg Lvl =  11.71  [   4.47 sec. at Pass 39]{postMap}
DE:   #PIs = 256  #Luts =   713  Max Lvl =  16  Avg Lvl =  11.71  [   2.00 sec. at Pass 40]{map}
DE:   #PIs = 256  #Luts =   710  Max Lvl =  16  Avg Lvl =  11.91  [   4.41 sec. at Pass 41]{postMap}
DE:   #PIs = 256  #Luts =   710  Max Lvl =  16  Avg Lvl =  11.91  [   2.04 sec. at Pass 42]{map}
DE:   #PIs = 256  #Luts =   704  Max Lvl =  16  Avg Lvl =  12.12  [   4.78 sec. at Pass 43]{postMap}
DE:   #PIs = 256  #Luts =   702  Max Lvl =  15  Avg Lvl =  11.43  [   2.68 sec. at Pass 44]{map}
DE:   #PIs = 256  #Luts =   702  Max Lvl =  15  Avg Lvl =  11.43  [   4.56 sec. at Pass 45]{postMap}
DE:   #PIs = 256  #Luts =   698  Max Lvl =  17  Avg Lvl =  11.71  [   2.12 sec. at Pass 46]{map}
DE:   #PIs = 256  #Luts =   688  Max Lvl =  17  Avg Lvl =  12.23  [   4.48 sec. at Pass 47]{postMap}
DE:   #PIs = 256  #Luts =   688  Max Lvl =  17  Avg Lvl =  12.23  [   1.87 sec. at Pass 48]{map}
DE:   #PIs = 256  #Luts =   679  Max Lvl =  17  Avg Lvl =  11.85  [   4.17 sec. at Pass 49]{postMap}
DE:   #PIs = 256  #Luts =   679  Max Lvl =  17  Avg Lvl =  11.85  [   2.24 sec. at Pass 50]{map}
DE:   #PIs = 256  #Luts =   666  Max Lvl =  18  Avg Lvl =  12.39  [   3.85 sec. at Pass 51]{postMap}
DE:   #PIs = 256  #Luts =   656  Max Lvl =  16  Avg Lvl =  11.91  [   2.20 sec. at Pass 52]{map}
DE:   #PIs = 256  #Luts =   652  Max Lvl =  16  Avg Lvl =  11.88  [   5.49 sec. at Pass 53]{postMap}
DE:   #PIs = 256  #Luts =   652  Max Lvl =  16  Avg Lvl =  11.88  [   2.54 sec. at Pass 54]{map}
DE:   #PIs = 256  #Luts =   639  Max Lvl =  18  Avg Lvl =  12.53  [   4.46 sec. at Pass 55]{postMap}
DE:   #PIs = 256  #Luts =   639  Max Lvl =  18  Avg Lvl =  12.53  [   2.64 sec. at Pass 56]{map}
DE:   #PIs = 256  #Luts =   621  Max Lvl =  18  Avg Lvl =  12.18  [   4.13 sec. at Pass 57]{postMap}
DE:   #PIs = 256  #Luts =   617  Max Lvl =  17  Avg Lvl =  12.43  [   2.37 sec. at Pass 58]{map}
DE:   #PIs = 256  #Luts =   614  Max Lvl =  18  Avg Lvl =  12.50  [   4.03 sec. at Pass 59]{postMap}
DE:   #PIs = 256  #Luts =   609  Max Lvl =  16  Avg Lvl =  11.64  [   1.86 sec. at Pass 60]{map}
DE:   #PIs = 256  #Luts =   604  Max Lvl =  17  Avg Lvl =  11.51  [   3.66 sec. at Pass 61]{postMap}
DE:   #PIs = 256  #Luts =   604  Max Lvl =  17  Avg Lvl =  11.51  [   1.78 sec. at Pass 62]{map}
DE:   #PIs = 256  #Luts =   602  Max Lvl =  17  Avg Lvl =  12.63  [   3.03 sec. at Pass 63]{postMap}
DE:   #PIs = 256  #Luts =   602  Max Lvl =  17  Avg Lvl =  12.63  [   1.77 sec. at Pass 64]{map}
DE:   #PIs = 256  #Luts =   598  Max Lvl =  18  Avg Lvl =  13.01  [   2.83 sec. at Pass 65]{postMap}
DE:   #PIs = 256  #Luts =   598  Max Lvl =  18  Avg Lvl =  13.01  [   1.10 sec. at Pass 66]{map}
DE:   #PIs = 256  #Luts =   594  Max Lvl =  16  Avg Lvl =  12.12  [   2.33 sec. at Pass 67]{postMap}
DE:   #PIs = 256  #Luts =   594  Max Lvl =  16  Avg Lvl =  12.12  [   1.01 sec. at Pass 68]{map}
DE:   #PIs = 256  #Luts =   591  Max Lvl =  17  Avg Lvl =  12.08  [   2.14 sec. at Pass 69]{postMap}
DE:   #PIs = 256  #Luts =   591  Max Lvl =  17  Avg Lvl =  12.08  [   0.73 sec. at Pass 70]{map}
DE:   #PIs = 256  #Luts =   591  Max Lvl =  17  Avg Lvl =  12.08  [   2.23 sec. at Pass 71]{postMap}
DE:   #PIs = 256  #Luts =   591  Max Lvl =  17  Avg Lvl =  12.08  [   1.48 sec. at Pass 72]{map}
DE:   #PIs = 256  #Luts =   585  Max Lvl =  17  Avg Lvl =  12.38  [   2.67 sec. at Pass 73]{pushMap}
DE:   #PIs = 256  #Luts =   585  Max Lvl =  17  Avg Lvl =  12.38  [   3.73 sec. at Pass 74]{postMap}
DE:   #PIs = 256  #Luts =   580  Max Lvl =  17  Avg Lvl =  12.43  [   2.04 sec. at Pass 75]{map}
DE:   #PIs = 256  #Luts =   580  Max Lvl =  17  Avg Lvl =  12.43  [   4.53 sec. at Pass 76]{postMap}
DE:   #PIs = 256  #Luts =   578  Max Lvl =  17  Avg Lvl =  12.31  [   2.04 sec. at Pass 77]{map}
DE:   #PIs = 256  #Luts =   578  Max Lvl =  17  Avg Lvl =  12.31  [   4.37 sec. at Pass 78]{postMap}
DE:   #PIs = 256  #Luts =   576  Max Lvl =  18  Avg Lvl =  12.42  [   2.42 sec. at Pass 79]{map}
DE:   #PIs = 256  #Luts =   573  Max Lvl =  16  Avg Lvl =  11.89  [   4.82 sec. at Pass 80]{postMap}
DE:   #PIs = 256  #Luts =   572  Max Lvl =  18  Avg Lvl =  12.74  [   1.93 sec. at Pass 81]{map}
DE:   #PIs = 256  #Luts =   563  Max Lvl =  17  Avg Lvl =  12.18  [   4.50 sec. at Pass 82]{postMap}
DE:   #PIs = 256  #Luts =   562  Max Lvl =  17  Avg Lvl =  12.22  [   1.89 sec. at Pass 83]{map}
DE:   #PIs = 256  #Luts =   554  Max Lvl =  17  Avg Lvl =  12.12  [   4.40 sec. at Pass 84]{postMap}
DE:   #PIs = 256  #Luts =   554  Max Lvl =  17  Avg Lvl =  12.12  [   2.00 sec. at Pass 85]{map}
DE:   #PIs = 256  #Luts =   552  Max Lvl =  18  Avg Lvl =  12.57  [   3.94 sec. at Pass 86]{postMap}
DE:   #PIs = 256  #Luts =   552  Max Lvl =  18  Avg Lvl =  12.57  [   1.87 sec. at Pass 87]{map}
DE:   #PIs = 256  #Luts =   552  Max Lvl =  18  Avg Lvl =  12.57  [   3.94 sec. at Pass 88]{postMap}
DE:   #PIs = 256  #Luts =   549  Max Lvl =  16  Avg Lvl =  12.02  [   1.84 sec. at Pass 89]{map}
DE:   #PIs = 256  #Luts =   541  Max Lvl =  18  Avg Lvl =  12.44  [   3.68 sec. at Pass 90]{postMap}
DE:   #PIs = 256  #Luts =   539  Max Lvl =  18  Avg Lvl =  12.41  [   1.82 sec. at Pass 91]{map}
DE:   #PIs = 256  #Luts =   539  Max Lvl =  18  Avg Lvl =  12.41  [   3.96 sec. at Pass 92]{postMap}
DE:   #PIs = 256  #Luts =   539  Max Lvl =  18  Avg Lvl =  12.41  [   1.75 sec. at Pass 93]{map}
DE:   #PIs = 256  #Luts =   532  Max Lvl =  17  Avg Lvl =  12.31  [   3.46 sec. at Pass 94]{postMap}
DE:   #PIs = 256  #Luts =   532  Max Lvl =  17  Avg Lvl =  12.31  [   1.79 sec. at Pass 95]{map}
DE:   #PIs = 256  #Luts =   532  Max Lvl =  17  Avg Lvl =  12.31  [   3.48 sec. at Pass 96]{postMap}
DE:   #PIs = 256  #Luts =   530  Max Lvl =  17  Avg Lvl =  12.83  [   1.89 sec. at Pass 97]{map}
DE:   #PIs = 256  #Luts =   524  Max Lvl =  18  Avg Lvl =  12.56  [   3.30 sec. at Pass 98]{postMap}
DE:   #PIs = 256  #Luts =   523  Max Lvl =  17  Avg Lvl =  12.27  [   1.63 sec. at Pass 99]{map}
DE:   #PIs = 256  #Luts =   523  Max Lvl =  17  Avg Lvl =  12.27  [   3.46 sec. at Pass 100]{postMap}
DE:   #PIs = 256  #Luts =   520  Max Lvl =  18  Avg Lvl =  12.14  [   0.77 sec. at Pass 101]{finalMap}

yosys> opt_expr

3.97. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.98. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.99. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.100. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.102. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.103. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.104. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 12098 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.105. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.106. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.107. Printing statistics.

=== top ===

   Number of wires:                776
   Number of wire bits:            776
   Number of public wires:         385
   Number of public wire bits:     385
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                520
     $lut                          520


yosys> shregmap -minlen 8 -maxlen 20

3.108. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.109. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.110. Printing statistics.

=== top ===

   Number of wires:                776
   Number of wire bits:            776
   Number of public wires:         385
   Number of public wire bits:     385
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                520
     $lut                          520


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.111. Executing TECHMAP pass (map to technology primitives).

3.111.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.111.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.111.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
No more expansions possible.
<suppressed ~656 debug messages>

yosys> opt_expr -mux_undef

3.112. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~15046 debug messages>

yosys> simplemap

3.113. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge

3.115. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
<suppressed ~1215 debug messages>
Removed a total of 405 cells.

yosys> opt_dff -nodffe -nosdff

3.116. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.117. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 901 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
<suppressed ~52 debug messages>

yosys> opt_merge -nomux

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.120. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.121. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.122. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.123. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.124. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.125. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_ObouPJ/abc_tmp_2.scr

3.127. Executing ABC pass (technology mapping using ABC).

3.127.1. Extracting gate netlist of module `\top' to `<abc-temp-dir>/input.blif'..
Extracted 2117 gates and 2375 wires to a netlist network with 256 inputs and 129 outputs.

3.127.1.1. Executing ABC.
DE:   #PIs = 256  #Luts =   535  Max Lvl =  14  Avg Lvl =  10.12  [   0.19 sec. at Pass 0]{firstMap}
DE:   #PIs = 256  #Luts =   535  Max Lvl =  14  Avg Lvl =  10.12  [   3.76 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 256  #Luts =   525  Max Lvl =  19  Avg Lvl =  13.05  [   1.38 sec. at Pass 2]{map}
DE:   #PIs = 256  #Luts =   506  Max Lvl =  17  Avg Lvl =  12.68  [   2.92 sec. at Pass 3]{postMap}
DE:   #PIs = 256  #Luts =   506  Max Lvl =  17  Avg Lvl =  12.68  [   1.27 sec. at Pass 4]{map}
DE:   #PIs = 256  #Luts =   506  Max Lvl =  17  Avg Lvl =  12.68  [   3.28 sec. at Pass 5]{postMap}
DE:   #PIs = 256  #Luts =   502  Max Lvl =  18  Avg Lvl =  12.70  [   2.21 sec. at Pass 6]{map}
DE:   #PIs = 256  #Luts =   497  Max Lvl =  19  Avg Lvl =  13.09  [   3.32 sec. at Pass 7]{postMap}
DE:   #PIs = 256  #Luts =   495  Max Lvl =  21  Avg Lvl =  14.53  [   1.76 sec. at Pass 8]{map}
DE:   #PIs = 256  #Luts =   488  Max Lvl =  18  Avg Lvl =  13.30  [   3.17 sec. at Pass 9]{postMap}
DE:   #PIs = 256  #Luts =   486  Max Lvl =  20  Avg Lvl =  13.71  [   1.83 sec. at Pass 10]{map}
DE:   #PIs = 256  #Luts =   479  Max Lvl =  20  Avg Lvl =  14.03  [   3.05 sec. at Pass 11]{postMap}
DE:   #PIs = 256  #Luts =   479  Max Lvl =  20  Avg Lvl =  14.03  [   1.47 sec. at Pass 12]{map}
DE:   #PIs = 256  #Luts =   479  Max Lvl =  20  Avg Lvl =  14.03  [   3.25 sec. at Pass 13]{postMap}
DE:   #PIs = 256  #Luts =   478  Max Lvl =  19  Avg Lvl =  13.60  [   1.85 sec. at Pass 14]{map}
DE:   #PIs = 256  #Luts =   478  Max Lvl =  19  Avg Lvl =  13.60  [   2.45 sec. at Pass 15]{postMap}
DE:   #PIs = 256  #Luts =   478  Max Lvl =  19  Avg Lvl =  13.60  [   1.16 sec. at Pass 16]{map}
DE:   #PIs = 256  #Luts =   477  Max Lvl =  18  Avg Lvl =  12.51  [   2.23 sec. at Pass 17]{postMap}
DE:   #PIs = 256  #Luts =   476  Max Lvl =  18  Avg Lvl =  12.57  [   1.39 sec. at Pass 18]{map}
DE:   #PIs = 256  #Luts =   476  Max Lvl =  17  Avg Lvl =  12.59  [   3.21 sec. at Pass 19]{postMap}
DE:   #PIs = 256  #Luts =   474  Max Lvl =  17  Avg Lvl =  12.47  [   1.96 sec. at Pass 20]{map}
DE:   #PIs = 256  #Luts =   472  Max Lvl =  20  Avg Lvl =  13.07  [   3.88 sec. at Pass 21]{postMap}
DE:   #PIs = 256  #Luts =   472  Max Lvl =  20  Avg Lvl =  13.07  [   1.92 sec. at Pass 22]{map}
DE:   #PIs = 256  #Luts =   472  Max Lvl =  20  Avg Lvl =  13.07  [   3.00 sec. at Pass 23]{postMap}
DE:   #PIs = 256  #Luts =   472  Max Lvl =  18  Avg Lvl =  13.32  [   1.98 sec. at Pass 24]{map}
DE:   #PIs = 256  #Luts =   469  Max Lvl =  20  Avg Lvl =  12.69  [   3.24 sec. at Pass 25]{postMap}
DE:   #PIs = 256  #Luts =   469  Max Lvl =  20  Avg Lvl =  12.69  [   1.88 sec. at Pass 26]{map}
DE:   #PIs = 256  #Luts =   466  Max Lvl =  18  Avg Lvl =  12.53  [   3.15 sec. at Pass 27]{postMap}
DE:   #PIs = 256  #Luts =   465  Max Lvl =  18  Avg Lvl =  12.53  [   1.65 sec. at Pass 28]{map}
DE:   #PIs = 256  #Luts =   465  Max Lvl =  18  Avg Lvl =  12.53  [   3.15 sec. at Pass 29]{postMap}
DE:   #PIs = 256  #Luts =   463  Max Lvl =  17  Avg Lvl =  12.30  [   1.27 sec. at Pass 30]{map}
DE:   #PIs = 256  #Luts =   463  Max Lvl =  17  Avg Lvl =  12.30  [   3.32 sec. at Pass 31]{postMap}
DE:   #PIs = 256  #Luts =   460  Max Lvl =  19  Avg Lvl =  12.74  [   1.84 sec. at Pass 32]{map}
DE:   #PIs = 256  #Luts =   460  Max Lvl =  19  Avg Lvl =  12.74  [   3.31 sec. at Pass 33]{postMap}
DE:   #PIs = 256  #Luts =   460  Max Lvl =  18  Avg Lvl =  11.99  [   1.12 sec. at Pass 34]{map}
DE:   #PIs = 256  #Luts =   456  Max Lvl =  19  Avg Lvl =  12.96  [   2.58 sec. at Pass 35]{postMap}
DE:   #PIs = 256  #Luts =   456  Max Lvl =  19  Avg Lvl =  12.96  [   1.35 sec. at Pass 36]{map}
DE:   #PIs = 256  #Luts =   456  Max Lvl =  19  Avg Lvl =  12.96  [   2.16 sec. at Pass 37]{postMap}
DE:   #PIs = 256  #Luts =   456  Max Lvl =  19  Avg Lvl =  12.96  [   2.35 sec. at Pass 38]{map}
DE:   #PIs = 256  #Luts =   454  Max Lvl =  19  Avg Lvl =  13.16  [   2.14 sec. at Pass 39]{pushMap}
DE:   #PIs = 256  #Luts =   449  Max Lvl =  17  Avg Lvl =  12.00  [   4.37 sec. at Pass 40]{postMap}
DE:   #PIs = 256  #Luts =   449  Max Lvl =  17  Avg Lvl =  12.00  [   2.06 sec. at Pass 41]{map}
DE:   #PIs = 256  #Luts =   449  Max Lvl =  17  Avg Lvl =  12.00  [   3.77 sec. at Pass 42]{postMap}
DE:   #PIs = 256  #Luts =   448  Max Lvl =  17  Avg Lvl =  12.42  [   1.61 sec. at Pass 43]{map}
DE:   #PIs = 256  #Luts =   448  Max Lvl =  17  Avg Lvl =  12.42  [   3.71 sec. at Pass 44]{postMap}
DE:   #PIs = 256  #Luts =   448  Max Lvl =  17  Avg Lvl =  12.42  [   1.72 sec. at Pass 45]{map}
DE:   #PIs = 256  #Luts =   448  Max Lvl =  17  Avg Lvl =  12.42  [   3.08 sec. at Pass 46]{postMap}
DE:   #PIs = 256  #Luts =   447  Max Lvl =  18  Avg Lvl =  12.97  [   2.28 sec. at Pass 47]{pushMap}
DE:   #PIs = 256  #Luts =   446  Max Lvl =  18  Avg Lvl =  12.06  [   1.58 sec. at Pass 48]{map}
DE:   #PIs = 256  #Luts =   446  Max Lvl =  18  Avg Lvl =  12.06  [   3.56 sec. at Pass 49]{postMap}
DE:   #PIs = 256  #Luts =   445  Max Lvl =  18  Avg Lvl =  12.28  [   2.01 sec. at Pass 50]{map}
DE:   #PIs = 256  #Luts =   445  Max Lvl =  18  Avg Lvl =  12.28  [   3.37 sec. at Pass 51]{postMap}
DE:   #PIs = 256  #Luts =   443  Max Lvl =  19  Avg Lvl =  12.05  [   1.75 sec. at Pass 52]{map}
DE:   #PIs = 256  #Luts =   443  Max Lvl =  19  Avg Lvl =  12.05  [   3.29 sec. at Pass 53]{postMap}
DE:   #PIs = 256  #Luts =   442  Max Lvl =  19  Avg Lvl =  12.41  [   1.67 sec. at Pass 54]{map}
DE:   #PIs = 256  #Luts =   441  Max Lvl =  19  Avg Lvl =  12.99  [   3.11 sec. at Pass 55]{postMap}
DE:   #PIs = 256  #Luts =   438  Max Lvl =  18  Avg Lvl =  12.50  [   1.57 sec. at Pass 56]{map}
DE:   #PIs = 256  #Luts =   438  Max Lvl =  18  Avg Lvl =  12.50  [   2.81 sec. at Pass 57]{postMap}
DE:   #PIs = 256  #Luts =   438  Max Lvl =  18  Avg Lvl =  12.50  [   1.51 sec. at Pass 58]{map}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  18  Avg Lvl =  12.47  [   2.58 sec. at Pass 59]{postMap}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  18  Avg Lvl =  12.47  [   1.35 sec. at Pass 60]{map}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  18  Avg Lvl =  12.47  [   2.18 sec. at Pass 61]{postMap}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  17  Avg Lvl =  12.11  [   1.34 sec. at Pass 62]{map}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  17  Avg Lvl =  12.11  [   2.72 sec. at Pass 63]{postMap}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  17  Avg Lvl =  12.11  [   1.48 sec. at Pass 64]{map}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  17  Avg Lvl =  12.11  [   2.81 sec. at Pass 65]{postMap}
DE:   #PIs = 256  #Luts =   436  Max Lvl =  17  Avg Lvl =  12.11  [   1.30 sec. at Pass 66]{pushMap}
DE:   #PIs = 256  #Luts =   435  Max Lvl =  17  Avg Lvl =  12.19  [   0.49 sec. at Pass 67]{finalMap}

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.

yosys> opt_merge -nomux

3.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.130. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.131. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \top.
Performed a total of 0 changes.

yosys> opt_merge

3.132. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\top'.
Removed a total of 0 cells.

yosys> opt_share

3.133. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.134. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.135. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..
Removed 0 unused cells and 2303 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.136. Executing OPT_EXPR pass (perform const folding).
Optimizing module top.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.137. Executing HIERARCHY pass (managing design hierarchy).

3.137.1. Analyzing design hierarchy..
Top module:  \top

3.137.2. Analyzing design hierarchy..
Top module:  \top
Removed 0 unused modules.

yosys> stat

3.138. Printing statistics.

=== top ===

   Number of wires:                691
   Number of wire bits:            691
   Number of public wires:         385
   Number of public wire bits:     385
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                435
     $lut                          435


yosys> opt_clean -purge

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \top..

yosys> write_verilog -noattr -nohex synthesized.v

3.140. Executing Verilog backend.
Dumping module `\top'.

End of script. Logfile hash: cdd9ede61b, CPU: user 47.31s system 0.22s, MEM: 166.68 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 98% 6x abc (3015 sec), 0% 23x opt_expr (15 sec), ...
real 622.19
user 2930.90
sys 128.40
