
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k gost89_ecb.v gost89_round.v gost89_sbox.v

yosys> verific -vlog2k gost89_ecb.v gost89_round.v gost89_sbox.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_ecb.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_round.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'gost89_sbox.v'

yosys> synth_rs -top gost89_ecb -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top gost89_ecb

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] gost89_ecb.v:1: compiling module 'gost89_ecb'
VERIFIC-INFO [VERI-1018] gost89_round.v:1: compiling module 'gost89_round'
VERIFIC-INFO [VERI-1018] gost89_sbox.v:1: compiling module 'gost89_sbox'
VERIFIC-WARNING [VERI-1209] gost89_ecb.v:34: expression size 7 truncated to fit in target size 6
Importing module gost89_ecb.
Importing module gost89_round.
Importing module gost89_sbox.

3.4.1. Analyzing design hierarchy..
Top module:  \gost89_ecb
Used module:     \gost89_round
Used module:         \gost89_sbox

3.4.2. Analyzing design hierarchy..
Top module:  \gost89_ecb
Used module:     \gost89_round
Used module:         \gost89_sbox
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_sbox.
Optimizing module gost89_round.
Optimizing module gost89_ecb.
<suppressed ~3 debug messages>

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module gost89_round.
Deleting now unused module gost89_sbox.
<suppressed ~9 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 1467 unused wires.
<suppressed ~21 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module gost89_ecb...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~18 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
    New ctrl vector for $pmux cell $verific$select_186$gost89_ecb.v:117$890: { $auto$opt_reduce.cc:134:opt_pmux$1549 $auto$opt_reduce.cc:134:opt_pmux$1547 $auto$opt_reduce.cc:134:opt_pmux$1545 $auto$opt_reduce.cc:134:opt_pmux$1543 $auto$opt_reduce.cc:134:opt_pmux$1541 $auto$opt_reduce.cc:134:opt_pmux$1539 $auto$opt_reduce.cc:134:opt_pmux$1537 $auto$opt_reduce.cc:134:opt_pmux$1535 $auto$opt_reduce.cc:134:opt_pmux$1533 $auto$opt_reduce.cc:134:opt_pmux$1531 $auto$opt_reduce.cc:134:opt_pmux$1529 $auto$opt_reduce.cc:134:opt_pmux$1527 $auto$opt_reduce.cc:134:opt_pmux$1525 $auto$opt_reduce.cc:134:opt_pmux$1523 $auto$opt_reduce.cc:134:opt_pmux$1521 $auto$opt_reduce.cc:134:opt_pmux$1519 $verific$n1897$50 }
  Optimizing cells in module \gost89_ecb.
Performed a total of 1 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Removing never-active async load on $verific$round_num_reg$gost89_ecb.v:45$853 ($aldff) from module gost89_ecb.
Removing never-active async load on $verific$round_key_reg$gost89_ecb.v:118$893 ($aldff) from module gost89_ecb.
Removing never-active async load on $verific$out_reg$gost89_ecb.v:45$854 ($aldff) from module gost89_ecb.
Removing never-active async load on $verific$n2_reg$gost89_ecb.v:45$851 ($aldff) from module gost89_ecb.
Removing never-active async load on $verific$n1_reg$gost89_ecb.v:45$850 ($aldff) from module gost89_ecb.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~18 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~18 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $verific$round_key_reg$gost89_ecb.v:118$893 ($dff) from module gost89_ecb (D = $verific$n3053$139, Q = \round_key).
Adding EN signal on $verific$out_reg$gost89_ecb.v:45$854 ($dff) from module gost89_ecb (D = { \n1 \rnd.out1 }, Q = \out).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 2 unused cells and 2 unused wires.
<suppressed ~3 debug messages>

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~17 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 2

yosys> wreduce -keepdc

3.49. Executing WREDUCE pass (reducing word size of cells).
Removed top 5 bits (of 6) from port B of cell gost89_ecb.$verific$add_22$gost89_ecb.v:34$833 ($add).
Removed top 5 bits (of 6) from port A of cell gost89_ecb.$verific$LessThan_25$gost89_ecb.v:35$836 ($lt).
Removed top 5 bits (of 6) from port B of cell gost89_ecb.$verific$equal_82$gost89_ecb.v:51$856 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_ecb.$verific$equal_83$gost89_ecb.v:52$857 ($eq).
Removed top 4 bits (of 6) from port B of cell gost89_ecb.$verific$equal_84$gost89_ecb.v:53$858 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_ecb.$verific$equal_85$gost89_ecb.v:54$859 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_ecb.$verific$equal_86$gost89_ecb.v:55$860 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_ecb.$verific$equal_87$gost89_ecb.v:56$861 ($eq).
Removed top 3 bits (of 6) from port B of cell gost89_ecb.$verific$equal_88$gost89_ecb.v:57$862 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_89$gost89_ecb.v:58$863 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_90$gost89_ecb.v:59$864 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_91$gost89_ecb.v:60$865 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_92$gost89_ecb.v:61$866 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_93$gost89_ecb.v:62$867 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_94$gost89_ecb.v:63$868 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_95$gost89_ecb.v:64$869 ($eq).
Removed top 2 bits (of 6) from port B of cell gost89_ecb.$verific$equal_96$gost89_ecb.v:65$870 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_97$gost89_ecb.v:66$871 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_98$gost89_ecb.v:67$872 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_99$gost89_ecb.v:68$873 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_100$gost89_ecb.v:69$874 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_101$gost89_ecb.v:70$875 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_102$gost89_ecb.v:71$876 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_103$gost89_ecb.v:72$877 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_104$gost89_ecb.v:73$878 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_105$gost89_ecb.v:74$879 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_106$gost89_ecb.v:75$880 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_107$gost89_ecb.v:76$881 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_108$gost89_ecb.v:77$882 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_109$gost89_ecb.v:78$883 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_110$gost89_ecb.v:79$884 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_111$gost89_ecb.v:80$885 ($eq).
Removed top 1 bits (of 6) from port B of cell gost89_ecb.$verific$equal_112$gost89_ecb.v:81$886 ($eq).

yosys> peepopt

3.50. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> bmuxmap

3.52. Executing BMUXMAP pass.

yosys> demuxmap

3.53. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.54. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module gost89_ecb:
  creating $macc model for $flatten\rnd.$verific$add_3$gost89_round.v:12$900 ($add).
  creating $macc model for $verific$add_22$gost89_ecb.v:34$833 ($add).
  creating $alu model for $macc $verific$add_22$gost89_ecb.v:34$833.
  creating $alu model for $macc $flatten\rnd.$verific$add_3$gost89_round.v:12$900.
  creating $alu model for $verific$LessThan_21$gost89_ecb.v:33$832 ($lt): new $alu
  creating $alu model for $verific$LessThan_25$gost89_ecb.v:35$836 ($lt): new $alu
  creating $alu model for $verific$equal_32$gost89_ecb.v:39$842 ($eq): merged with $verific$LessThan_21$gost89_ecb.v:33$832.
  creating $alu cell for $verific$LessThan_25$gost89_ecb.v:35$836: $auto$alumacc.cc:485:replace_alu$1562
  creating $alu cell for $verific$LessThan_21$gost89_ecb.v:33$832, $verific$equal_32$gost89_ecb.v:39$842: $auto$alumacc.cc:485:replace_alu$1567
  creating $alu cell for $flatten\rnd.$verific$add_3$gost89_round.v:12$900: $auto$alumacc.cc:485:replace_alu$1578
  creating $alu cell for $verific$add_22$gost89_ecb.v:34$833: $auto$alumacc.cc:485:replace_alu$1581
  created 4 $alu and 0 $macc cells.

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.56. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.57. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~17 debug messages>

yosys> opt_reduce

3.58. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
    New input vector for $reduce_and cell $auto$opt_dff.cc:220:make_patterns_logic$1559: { $auto$alumacc.cc:501:replace_alu$1568 $verific$n237$11 }
  Optimizing cells in module \gost89_ecb.
Performed a total of 1 changes.

yosys> opt_merge

3.59. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.60. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.61. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.63. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 1

yosys> stat

3.64. Printing statistics.

=== gost89_ecb ===

   Number of wires:                164
   Number of wire bits:           3326
   Number of public wires:          48
   Number of public wire bits:    2380
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                211
     $alu                            4
     $and                            3
     $dff                            4
     $dffe                           2
     $eq                            31
     $logic_not                      1
     $mux                          135
     $ne                             2
     $not                            6
     $or                             1
     $pmux                           1
     $reduce_and                     3
     $reduce_or                     17
     $xor                            1


yosys> memory -nomap

3.65. Executing MEMORY pass.

yosys> opt_mem

3.65.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.65.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.65.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.65.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.65.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.65.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> memory_share

3.65.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.65.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.65.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> memory_collect

3.65.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.66. Printing statistics.

=== gost89_ecb ===

   Number of wires:                164
   Number of wire bits:           3326
   Number of public wires:          48
   Number of public wire bits:    2380
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                211
     $alu                            4
     $and                            3
     $dff                            4
     $dffe                           2
     $eq                            31
     $logic_not                      1
     $mux                          135
     $ne                             2
     $not                            6
     $or                             1
     $pmux                           1
     $reduce_and                     3
     $reduce_or                     17
     $xor                            1


yosys> muxpack

3.67. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~136 debug messages>

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> pmuxtree

3.69. Executing PMUXTREE pass.

yosys> muxpack

3.70. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting gost89_ecb.$auto$pmuxtree.cc:65:recursive_mux_generator$1620 ... gost89_ecb.$auto$pmuxtree.cc:65:recursive_mux_generator$1622 to a pmux with 2 cases.
Converting gost89_ecb.$auto$pmuxtree.cc:65:recursive_mux_generator$1598 ... gost89_ecb.$auto$pmuxtree.cc:65:recursive_mux_generator$1600 to a pmux with 2 cases.
Converted 4 (p)mux cells into 2 pmux cells.
<suppressed ~152 debug messages>

yosys> memory_map

3.71. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.72. Printing statistics.

=== gost89_ecb ===

   Number of wires:                190
   Number of wire bits:           4423
   Number of public wires:          48
   Number of public wire bits:    2380
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                234
     $alu                            4
     $and                            3
     $dff                            4
     $dffe                           2
     $eq                            31
     $logic_not                      1
     $mux                          148
     $ne                             2
     $not                            7
     $or                             5
     $pmux                           2
     $reduce_and                     3
     $reduce_or                     21
     $xor                            1


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.73. Executing TECHMAP pass (map to technology primitives).

3.73.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.73.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.73.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $and.
Using template $paramod$00298f3f8094950cb9a5ff2fda48d0d8bde8806c\_90_alu for cells of type $alu.
Using template $paramod$be80489e44a49c29884f59fd81c31ed03229cfc1\_80_rs_alu for cells of type $alu.
Using template $paramod$32efbfac1c4dc57230cf86180788fdfd12e3b511\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $dff.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $dffe.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $or.
Using template $paramod$54a4503cc57b9df40b70c1899504d6aac2650719\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~877 debug messages>

yosys> stat

3.74. Printing statistics.

=== gost89_ecb ===

   Number of wires:                931
   Number of wire bits:          10790
   Number of public wires:          48
   Number of public wire bits:    2380
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               3038
     $_AND_                        319
     $_DFFE_PP_                     96
     $_DFF_P_                       71
     $_MUX_                       1744
     $_NOT_                         89
     $_OR_                         392
     $_XOR_                        295
     adder_carry                    32


yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
<suppressed ~383 debug messages>

yosys> opt_merge -nomux

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
<suppressed ~1602 debug messages>
Removed a total of 534 cells.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 55 unused cells and 765 unused wires.
<suppressed ~56 debug messages>

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
<suppressed ~98 debug messages>

yosys> techmap -map +/techmap.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_merge -nomux

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.98. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 1

yosys> abc -dff

3.101. Executing ABC pass (technology mapping using ABC).

3.101.1. Summary of detected clock domains:
  1269 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1555, arst={ }, srst={ }
  582 cells in clk=\clk, en=$auto$opt_dff.cc:219:make_patterns_logic$1558, arst={ }, srst={ }
  334 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.101.2. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1555
Extracted 1237 gates and 1539 wires to a netlist network with 302 inputs and 64 outputs.

3.101.2.1. Executing ABC.

3.101.3. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $auto$opt_dff.cc:219:make_patterns_logic$1558
Extracted 582 gates and 1197 wires to a netlist network with 615 inputs and 97 outputs.

3.101.3.1. Executing ABC.

3.101.4. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 334 gates and 433 wires to a netlist network with 98 inputs and 79 outputs.

3.101.4.1. Executing ABC.

yosys> abc -dff

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Summary of detected clock domains:
  99 cells in clk=\clk, en=$abc$7023$auto$opt_dff.cc:219:make_patterns_logic$1558, arst={ }, srst={ }
  1484 cells in clk=\clk, en=$abc$5536$auto$opt_dff.cc:219:make_patterns_logic$1555, arst={ }, srst={ }
  961 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.102.2. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$7023$auto$opt_dff.cc:219:make_patterns_logic$1558
Extracted 99 gates and 199 wires to a netlist network with 100 inputs and 65 outputs.

3.102.2.1. Executing ABC.

3.102.3. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$5536$auto$opt_dff.cc:219:make_patterns_logic$1555
Extracted 1453 gates and 1754 wires to a netlist network with 301 inputs and 64 outputs.

3.102.3.1. Executing ABC.

3.102.4. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 960 gates and 1572 wires to a netlist network with 612 inputs and 111 outputs.

3.102.4.1. Executing ABC.

yosys> abc -dff

3.103. Executing ABC pass (technology mapping using ABC).

3.103.1. Summary of detected clock domains:
  1688 cells in clk=\clk, en=$abc$8439$abc$5536$auto$opt_dff.cc:219:make_patterns_logic$1555, arst={ }, srst={ }
  106 cells in clk=\clk, en=$abc$8243$abc$7023$auto$opt_dff.cc:219:make_patterns_logic$1558, arst={ }, srst={ }
  982 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.103.2. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8439$abc$5536$auto$opt_dff.cc:219:make_patterns_logic$1555
Extracted 1657 gates and 1958 wires to a netlist network with 301 inputs and 64 outputs.

3.103.2.1. Executing ABC.

3.103.3. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$8243$abc$7023$auto$opt_dff.cc:219:make_patterns_logic$1558
Extracted 106 gates and 206 wires to a netlist network with 100 inputs and 65 outputs.

3.103.3.1. Executing ABC.

3.103.4. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 981 gates and 1593 wires to a netlist network with 612 inputs and 111 outputs.

3.103.4.1. Executing ABC.

yosys> abc -dff

3.104. Executing ABC pass (technology mapping using ABC).

3.104.1. Summary of detected clock domains:
  1675 cells in clk=\clk, en=$abc$11181$abc$8439$abc$5536$auto$opt_dff.cc:219:make_patterns_logic$1555, arst={ }, srst={ }
  99 cells in clk=\clk, en=$abc$12856$abc$8243$abc$7023$auto$opt_dff.cc:219:make_patterns_logic$1558, arst={ }, srst={ }
  1022 cells in clk=\clk, en={ }, arst={ }, srst={ }

3.104.2. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$11181$abc$8439$abc$5536$auto$opt_dff.cc:219:make_patterns_logic$1555
Extracted 1644 gates and 1945 wires to a netlist network with 301 inputs and 64 outputs.

3.104.2.1. Executing ABC.

3.104.3. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12856$abc$8243$abc$7023$auto$opt_dff.cc:219:make_patterns_logic$1558
Extracted 99 gates and 199 wires to a netlist network with 100 inputs and 65 outputs.

3.104.3.1. Executing ABC.

3.104.4. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk
Extracted 1021 gates and 1633 wires to a netlist network with 612 inputs and 111 outputs.

3.104.4.1. Executing ABC.

yosys> opt_ffinv

3.105. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_merge -nomux

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
<suppressed ~93 debug messages>
Removed a total of 31 cells.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15921 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li30_li30, Q = $abc$15890$lo30).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15920 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li29_li29, Q = $abc$15890$lo29).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15919 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li28_li28, Q = $abc$15890$lo28).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15918 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li27_li27, Q = $abc$15890$lo27).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15917 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li26_li26, Q = $abc$15890$lo26).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15916 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li25_li25, Q = $abc$15890$lo25).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15915 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li24_li24, Q = $abc$15890$lo24).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15914 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li23_li23, Q = $abc$15890$lo23).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15913 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li22_li22, Q = $abc$15890$lo22).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15912 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li21_li21, Q = $abc$15890$lo21).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15911 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li20_li20, Q = $abc$15890$lo20).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15910 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li19_li19, Q = $abc$15890$lo19).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15909 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li18_li18, Q = $abc$15890$lo18).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15908 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li17_li17, Q = $abc$15890$lo17).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15907 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li16_li16, Q = $abc$15890$lo16).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15906 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li15_li15, Q = $abc$15890$lo15).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15905 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li14_li14, Q = $abc$15890$lo14).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15904 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li13_li13, Q = $abc$15890$lo13).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15903 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li12_li12, Q = $abc$15890$lo12).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15902 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li11_li11, Q = $abc$15890$lo11).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15901 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li10_li10, Q = $abc$15890$lo10).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15899 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li08_li08, Q = $abc$15890$lo08).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15898 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li07_li07, Q = $abc$15890$lo07).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15897 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li06_li06, Q = $abc$15890$lo06).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15896 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li05_li05, Q = $abc$15890$lo05).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15895 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li04_li04, Q = $abc$15890$lo04).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15894 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li03_li03, Q = $abc$15890$lo03).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15893 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li02_li02, Q = $abc$15890$lo02).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15892 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li01_li01, Q = $abc$15890$lo01).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15891 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li00_li00, Q = $abc$15890$lo00).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15954 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li63_li63, Q = $abc$15890$lo63).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15953 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li62_li62, Q = $abc$15890$lo62).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15952 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li61_li61, Q = $abc$15890$lo61).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15951 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li60_li60, Q = $abc$15890$lo60).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15950 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li59_li59, Q = $abc$15890$lo59).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15949 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li58_li58, Q = $abc$15890$lo58).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15948 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li57_li57, Q = $abc$15890$lo57).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15947 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li56_li56, Q = $abc$15890$lo56).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15946 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li55_li55, Q = $abc$15890$lo55).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15945 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li54_li54, Q = $abc$15890$lo54).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15944 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li53_li53, Q = $abc$15890$lo53).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15943 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li52_li52, Q = $abc$15890$lo52).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15942 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li51_li51, Q = $abc$15890$lo51).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15941 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li50_li50, Q = $abc$15890$lo50).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15940 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li49_li49, Q = $abc$15890$lo49).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15939 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li48_li48, Q = $abc$15890$lo48).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15938 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li47_li47, Q = $abc$15890$lo47).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15937 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li46_li46, Q = $abc$15890$lo46).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15936 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li45_li45, Q = $abc$15890$lo45).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15935 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li44_li44, Q = $abc$15890$lo44).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15934 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li43_li43, Q = $abc$15890$lo43).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15933 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li42_li42, Q = $abc$15890$lo42).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15932 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li41_li41, Q = $abc$15890$lo41).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15931 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li40_li40, Q = $abc$15890$lo40).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15930 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li39_li39, Q = $abc$15890$lo39).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15929 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li38_li38, Q = $abc$15890$lo38).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15928 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li37_li37, Q = $abc$15890$lo37).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15927 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li36_li36, Q = $abc$15890$lo36).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15926 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li35_li35, Q = $abc$15890$lo35).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15925 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li34_li34, Q = $abc$15890$lo34).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15924 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li33_li33, Q = $abc$15890$lo33).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15923 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li32_li32, Q = $abc$15890$lo32).
Adding EN signal on $abc$15890$auto$blifparse.cc:362:parse_blif$15922 ($_DFF_P_) from module gost89_ecb (D = $abc$15890$li31_li31, Q = $abc$15890$lo31).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 13337 unused wires.
<suppressed ~11 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
<suppressed ~126 debug messages>

yosys> opt_muxtree

3.115. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.116. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.117. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
<suppressed ~372 debug messages>
Removed a total of 124 cells.

yosys> opt_share

3.118. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.119. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.120. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 187 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.121. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_muxtree

3.122. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.123. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.124. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.125. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.126. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.127. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 3

yosys> bmuxmap

3.129. Executing BMUXMAP pass.

yosys> demuxmap

3.130. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_6dV9Z8/abc_tmp_1.scr

3.131. Executing ABC pass (technology mapping using ABC).

3.131.1. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Extracted 2433 gates and 3403 wires to a netlist network with 969 inputs and 168 outputs.

3.131.1.1. Executing ABC.
DE:   #PIs = 969  #Luts =   742  Max Lvl =   5  Avg Lvl =   2.99  [   0.16 sec. at Pass 0]{firstMap}
DE:   #PIs = 969  #Luts =   676  Max Lvl =   8  Avg Lvl =   3.45  [   6.27 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 969  #Luts =   668  Max Lvl =   9  Avg Lvl =   3.43  [   1.88 sec. at Pass 2]{map}
DE:   #PIs = 969  #Luts =   666  Max Lvl =   7  Avg Lvl =   3.29  [   2.80 sec. at Pass 3]{postMap}
DE:   #PIs = 969  #Luts =   656  Max Lvl =   9  Avg Lvl =   3.34  [   2.41 sec. at Pass 4]{map}
DE:   #PIs = 969  #Luts =   656  Max Lvl =   9  Avg Lvl =   3.34  [   3.20 sec. at Pass 5]{postMap}
DE:   #PIs = 969  #Luts =   654  Max Lvl =   7  Avg Lvl =   3.29  [   3.32 sec. at Pass 6]{map}
DE:   #PIs = 969  #Luts =   651  Max Lvl =   9  Avg Lvl =   3.27  [   3.33 sec. at Pass 7]{postMap}
DE:   #PIs = 969  #Luts =   648  Max Lvl =   8  Avg Lvl =   3.43  [   2.47 sec. at Pass 8]{map}
DE:   #PIs = 969  #Luts =   642  Max Lvl =   7  Avg Lvl =   3.29  [   2.89 sec. at Pass 9]{postMap}
DE:   #PIs = 969  #Luts =   642  Max Lvl =   7  Avg Lvl =   3.29  [   2.50 sec. at Pass 10]{map}
DE:   #PIs = 969  #Luts =   642  Max Lvl =   7  Avg Lvl =   3.29  [   2.35 sec. at Pass 11]{postMap}
DE:   #PIs = 969  #Luts =   642  Max Lvl =   7  Avg Lvl =   3.29  [   2.13 sec. at Pass 12]{map}
DE:   #PIs = 969  #Luts =   640  Max Lvl =   7  Avg Lvl =   3.35  [   0.76 sec. at Pass 13]{finalMap}

yosys> opt_expr

3.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_merge -nomux

3.133. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.134. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.135. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.137. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.138. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 3398 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.141. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.142. Printing statistics.

=== gost89_ecb ===

   Number of wires:                659
   Number of wire bits:           2994
   Number of public wires:          38
   Number of public wire bits:    2310
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                839
     $_DFFE_PP_                    159
     $_DFF_P_                        8
     $lut                          640
     adder_carry                    32


yosys> shregmap -minlen 8 -maxlen 20

3.143. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.144. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.145. Printing statistics.

=== gost89_ecb ===

   Number of wires:                659
   Number of wire bits:           2994
   Number of public wires:          38
   Number of public wire bits:    2310
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                839
     $_DFFE_PP0P_                  159
     $_DFF_P_                        8
     $lut                          640
     adder_carry                    32


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.146. Executing TECHMAP pass (map to technology primitives).

3.146.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.146.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.146.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using template \$_DFF_P_ for cells of type $_DFF_P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1102 debug messages>

yosys> opt_expr -mux_undef

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
<suppressed ~21216 debug messages>

yosys> simplemap

3.148. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
<suppressed ~12045 debug messages>
Removed a total of 4015 cells.

yosys> opt_dff -nodffe -nosdff

3.151. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.152. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 2247 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.153. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
<suppressed ~1421 debug messages>

yosys> opt_merge -nomux

3.154. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.155. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.156. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.158. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.159. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 81 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.161. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_6dV9Z8/abc_tmp_2.scr

3.162. Executing ABC pass (technology mapping using ABC).

3.162.1. Extracting gate netlist of module `\gost89_ecb' to `<abc-temp-dir>/input.blif'..
Extracted 3159 gates and 4130 wires to a netlist network with 969 inputs and 168 outputs.

3.162.1.1. Executing ABC.
DE:   #PIs = 969  #Luts =   662  Max Lvl =   4  Avg Lvl =   2.64  [   0.29 sec. at Pass 0]{firstMap}
DE:   #PIs = 969  #Luts =   643  Max Lvl =   8  Avg Lvl =   3.34  [   4.88 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 969  #Luts =   638  Max Lvl =   7  Avg Lvl =   3.31  [   2.57 sec. at Pass 2]{map}
DE:   #PIs = 969  #Luts =   638  Max Lvl =   7  Avg Lvl =   3.31  [   3.23 sec. at Pass 3]{postMap}
DE:   #PIs = 969  #Luts =   638  Max Lvl =   7  Avg Lvl =   3.31  [   2.20 sec. at Pass 4]{map}
DE:   #PIs = 969  #Luts =   638  Max Lvl =   7  Avg Lvl =   3.31  [   3.32 sec. at Pass 5]{postMap}
DE:   #PIs = 969  #Luts =   638  Max Lvl =   6  Avg Lvl =   3.26  [   1.00 sec. at Pass 6]{finalMap}

yosys> opt_expr

3.163. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.

yosys> opt_merge -nomux

3.164. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.165. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \gost89_ecb..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.166. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \gost89_ecb.
Performed a total of 0 changes.

yosys> opt_merge

3.167. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\gost89_ecb'.
Removed a total of 0 cells.

yosys> opt_share

3.168. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.169. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.170. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 3558 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.171. Executing OPT_EXPR pass (perform const folding).
Optimizing module gost89_ecb.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.172. Executing HIERARCHY pass (managing design hierarchy).

3.172.1. Analyzing design hierarchy..
Top module:  \gost89_ecb

3.172.2. Analyzing design hierarchy..
Top module:  \gost89_ecb
Removed 0 unused modules.

yosys> stat

3.173. Printing statistics.

=== gost89_ecb ===

   Number of wires:                657
   Number of wire bits:           2992
   Number of public wires:          38
   Number of public wire bits:    2310
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                837
     $lut                          638
     adder_carry                    32
     dffsre                        167


yosys> opt_clean -purge

3.174. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \gost89_ecb..
Removed 0 unused cells and 18 unused wires.
<suppressed ~18 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.175. Executing Verilog backend.
Dumping module `\gost89_ecb'.

Warnings: 1 unique messages, 1 total
End of script. Logfile hash: 633b1d9a57, CPU: user 8.60s system 0.09s, MEM: 90.54 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 95% 6x abc (163 sec), 1% 30x opt_expr (3 sec), ...
real 80.24
user 157.40
sys 14.58
