
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl twofish.vhd

yosys> verific -vhdl twofish.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'twofish.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-INFO [VHDL-1012] twofish.vhd:44: analyzing entity 'q0'
VERIFIC-INFO [VHDL-1010] twofish.vhd:51: analyzing architecture 'q0_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:199: analyzing entity 'q1'
VERIFIC-INFO [VHDL-1010] twofish.vhd:207: analyzing architecture 'q1_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:355: analyzing entity 'mul_ef'
VERIFIC-INFO [VHDL-1010] twofish.vhd:363: analyzing architecture 'mul_ef_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:391: analyzing entity 'mul_5b'
VERIFIC-INFO [VHDL-1010] twofish.vhd:398: analyzing architecture 'mul_5b_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:423: analyzing entity 'mds'
VERIFIC-INFO [VHDL-1010] twofish.vhd:438: analyzing architecture 'mds_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:544: analyzing entity 'adder'
VERIFIC-INFO [VHDL-1010] twofish.vhd:554: analyzing architecture 'adder_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:576: analyzing entity 'pht'
VERIFIC-INFO [VHDL-1010] twofish.vhd:587: analyzing architecture 'pht_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:681: analyzing entity 'mul01'
VERIFIC-INFO [VHDL-1010] twofish.vhd:688: analyzing architecture 'mul01_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:707: analyzing entity 'mula4'
VERIFIC-INFO [VHDL-1010] twofish.vhd:714: analyzing architecture 'mula4_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:740: analyzing entity 'mul55'
VERIFIC-INFO [VHDL-1010] twofish.vhd:747: analyzing architecture 'mul55_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:773: analyzing entity 'mul87'
VERIFIC-INFO [VHDL-1010] twofish.vhd:780: analyzing architecture 'mul87_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:806: analyzing entity 'mul5a'
VERIFIC-INFO [VHDL-1010] twofish.vhd:813: analyzing architecture 'mul5a_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:839: analyzing entity 'mul58'
VERIFIC-INFO [VHDL-1010] twofish.vhd:846: analyzing architecture 'mul58_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:872: analyzing entity 'muldb'
VERIFIC-INFO [VHDL-1010] twofish.vhd:879: analyzing architecture 'muldb_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:905: analyzing entity 'mul9e'
VERIFIC-INFO [VHDL-1010] twofish.vhd:912: analyzing architecture 'mul9e_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:938: analyzing entity 'mul56'
VERIFIC-INFO [VHDL-1010] twofish.vhd:945: analyzing architecture 'mul56_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:971: analyzing entity 'mul82'
VERIFIC-INFO [VHDL-1010] twofish.vhd:978: analyzing architecture 'mul82_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1004: analyzing entity 'mulf3'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1011: analyzing architecture 'mulf3_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1038: analyzing entity 'mul1e'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1045: analyzing architecture 'mul1e_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1070: analyzing entity 'mulc6'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1077: analyzing architecture 'mulc6_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1103: analyzing entity 'mul68'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1111: analyzing architecture 'mul68_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1137: analyzing entity 'mule5'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1145: analyzing architecture 'mule5_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1171: analyzing entity 'mul02'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1179: analyzing architecture 'mul02_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1205: analyzing entity 'mula1'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1212: analyzing architecture 'mula1_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1238: analyzing entity 'mulfc'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1246: analyzing architecture 'mulfc_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1272: analyzing entity 'mulc1'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1280: analyzing architecture 'mulc1_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1306: analyzing entity 'mul47'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1313: analyzing architecture 'mul47_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1339: analyzing entity 'mulae'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1346: analyzing architecture 'mulae_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1372: analyzing entity 'mul3d'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1379: analyzing architecture 'mul3d_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1405: analyzing entity 'mul19'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1412: analyzing architecture 'mul19_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1438: analyzing entity 'mul03'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1445: analyzing architecture 'mul03_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1471: analyzing entity 'h_128'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1480: analyzing architecture 'h128_arch'
VERIFIC-INFO [VHDL-1012] twofish.vhd:1622: analyzing entity 'twofish_whit_keysched128'
VERIFIC-INFO [VHDL-1010] twofish.vhd:1636: analyzing architecture 'twofish_whit_keysched128_arch'

yosys> synth_rs -top twofish_whit_keysched128 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top twofish_whit_keysched128

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] twofish.vhd:1622: processing 'twofish_whit_keysched128(twofish_whit_keysched128_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:1471: processing 'h_128(h128_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:44: processing 'q0(q0_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:199: processing 'q1(q1_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:423: processing 'mds(mds_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:355: processing 'mul_ef(mul_ef_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:391: processing 'mul_5b(mul_5b_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:576: processing 'pht(pht_arch)'
VERIFIC-INFO [VHDL-1067] twofish.vhd:544: processing 'adder(adder_arch)'
Importing module twofish_whit_keysched128.
Importing module h_128(h128_arch).
Importing module mds(mds_arch).
Importing module mul_5b(mul_5b_arch).
Importing module mul_ef(mul_ef_arch).
Importing module pht(pht_arch).
Importing module adder(adder_arch).
Importing module q0(q0_arch).
Importing module q1(q1_arch).

3.4.1. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched128
Used module:     \pht(pht_arch)
Used module:         \adder(adder_arch)
Used module:     \h_128(h128_arch)
Used module:         \mds(mds_arch)
Used module:             \mul_5b(mul_5b_arch)
Used module:             \mul_ef(mul_ef_arch)
Used module:         \q0(q0_arch)
Used module:         \q1(q1_arch)

3.4.2. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched128
Used module:     \pht(pht_arch)
Used module:         \adder(adder_arch)
Used module:     \h_128(h128_arch)
Used module:         \mds(mds_arch)
Used module:             \mul_5b(mul_5b_arch)
Used module:             \mul_ef(mul_ef_arch)
Used module:         \q0(q0_arch)
Used module:         \q1(q1_arch)
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module q1(q1_arch).
Optimizing module q0(q0_arch).
Optimizing module adder(adder_arch).
Optimizing module pht(pht_arch).
Optimizing module mul_ef(mul_ef_arch).
Optimizing module mul_5b(mul_5b_arch).
Optimizing module mds(mds_arch).
Optimizing module h_128(h128_arch).
Optimizing module twofish_whit_keysched128.
<suppressed ~8 debug messages>

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module adder(adder_arch).
Deleting now unused module h_128(h128_arch).
Deleting now unused module mds(mds_arch).
Deleting now unused module mul_5b(mul_5b_arch).
Deleting now unused module mul_ef(mul_ef_arch).
Deleting now unused module pht(pht_arch).
Deleting now unused module q0(q0_arch).
Deleting now unused module q1(q1_arch).
<suppressed ~97 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~2592 debug messages>

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 32 unused cells and 4162 unused wires.
<suppressed ~1657 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module twofish_whit_keysched128...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~24 debug messages>

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
<suppressed ~24 debug messages>
Removed a total of 8 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~256 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 32 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.25. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.25.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.25.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.25.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.25.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> fsm_opt

3.25.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.25.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.25.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.25.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.26. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_merge -nomux

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~256 debug messages>

yosys> opt_reduce

3.29. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.30. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.31. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.32. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.33. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> opt_expr

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 1

yosys> wreduce -keepdc

3.35. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 32) from port A of cell twofish_whit_keysched128.$flatten\upper_h1.$verific$xor_3$twofish.vhd:1544$99 ($xor).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 32) from port A of cell twofish_whit_keysched128.$flatten\lower_h3.$verific$xor_3$twofish.vhd:1544$99 ($xor).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$762 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$761 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$758 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$757 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$756 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$755 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$743 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$742 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$740 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$736 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$724 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$722 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$721 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$719 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$704 ($mux).
Removed top 3 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:60:execute$701 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$685 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$682 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$665 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$663 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$662 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$661 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$648 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$647 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$645 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$644 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$642 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$641 ($mux).
Removed top 2 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$626 ($mux).
Removed top 1 bits (of 4) from mux cell twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:60:execute$623 ($mux).
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$725.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$744.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 6 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$763.
Removed top 2 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$768.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$725.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$730.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$744.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$749.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$763.
Removed top 2 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$768.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q1_1.$auto$bmuxmap.cc:58:execute$649.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:58:execute$649.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\second_q1_2.$auto$bmuxmap.cc:58:execute$654.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$725.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$744.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 6 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$763.
Removed top 2 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$768.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$725.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$730.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$744.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$749.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 10 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$763.
Removed top 2 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$768.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q1_1.$auto$bmuxmap.cc:58:execute$649.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:58:execute$649.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h1.\third_q1_2.$auto$bmuxmap.cc:58:execute$654.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$725.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$744.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 6 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$763.
Removed top 2 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$768.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$725.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$730.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$744.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$749.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$763.
Removed top 2 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$768.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q1_1.$auto$bmuxmap.cc:58:execute$649.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:58:execute$649.
Removed top 6 bits (of 8) from wire twofish_whit_keysched128.$flatten\lower_h2.\second_q1_2.$auto$bmuxmap.cc:58:execute$654.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 14 bits (of 16) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:58:execute$725.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h2.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h3.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\lower_h4.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h1.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h2.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h3.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\second_q1_2.$auto$bmuxmap.cc:58:execute$640.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q0_1.$auto$bmuxmap.cc:58:execute$754.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:58:execute$716.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:58:execute$735.
Removed top 1 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q0_2.$auto$bmuxmap.cc:58:execute$754.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q1_1.$auto$bmuxmap.cc:58:execute$640.
Removed top 2 bits (of 32) from wire twofish_whit_keysched128.$flatten\upper_h4.\third_q1_2.$auto$bmuxmap.cc:58:execute$640.

yosys> peepopt

3.36. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.37. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 168 unused wires.
<suppressed ~1 debug messages>

yosys> bmuxmap

3.38. Executing BMUXMAP pass.

yosys> demuxmap

3.39. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.40. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module twofish_whit_keysched128:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_merge -nomux

3.42. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.43. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~256 debug messages>

yosys> opt_reduce

3.44. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.45. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
<suppressed ~96 debug messages>
Removed a total of 32 cells.

yosys> opt_share

3.46. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.47. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.48. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> opt_expr

3.49. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_muxtree

3.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~288 debug messages>

yosys> opt_reduce

3.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.53. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> opt_expr

3.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 2

yosys> stat

3.57. Printing statistics.

=== twofish_whit_keysched128 ===

   Number of wires:               5601
   Number of wire bits:          31464
   Number of public wires:        3225
   Number of public wire bits:   14464
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               6288
     $and                          488
     $mux                         3808
     $or                           240
     $xor                         1752


yosys> memory -nomap

3.58. Executing MEMORY pass.

yosys> opt_mem

3.58.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.58.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.58.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.58.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.58.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.58.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> memory_share

3.58.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.58.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.58.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> memory_collect

3.58.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.59. Printing statistics.

=== twofish_whit_keysched128 ===

   Number of wires:               5601
   Number of wire bits:          31464
   Number of public wires:        3225
   Number of public wire bits:   14464
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               6288
     $and                          488
     $mux                         3808
     $or                           240
     $xor                         1752


yosys> muxpack

3.60. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~1811 debug messages>

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> pmuxtree

3.62. Executing PMUXTREE pass.

yosys> muxpack

3.63. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~1811 debug messages>

yosys> memory_map

3.64. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.65. Printing statistics.

=== twofish_whit_keysched128 ===

   Number of wires:               5601
   Number of wire bits:          31464
   Number of public wires:        3225
   Number of public wire bits:   14464
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               6288
     $and                          488
     $mux                         3808
     $or                           240
     $xor                         1752


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.66. Executing TECHMAP pass (map to technology primitives).

3.66.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.66.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.66.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
No more expansions possible.
<suppressed ~6359 debug messages>

yosys> stat

3.67. Printing statistics.

=== twofish_whit_keysched128 ===

   Number of wires:               5601
   Number of wire bits:          31464
   Number of public wires:        3225
   Number of public wire bits:   14464
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              19200
     $_AND_                        488
     $_MUX_                      13728
     $_OR_                         240
     $_XOR_                       4744


yosys> opt_expr

3.68. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~6368 debug messages>

yosys> opt_merge -nomux

3.69. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
<suppressed ~9078 debug messages>
Removed a total of 3026 cells.

yosys> opt_muxtree

3.70. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.71. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.72. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.73. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.74. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.75. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 182 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~220 debug messages>

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 3

yosys> opt_expr -full

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~730 debug messages>

yosys> techmap -map +/techmap.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_merge -nomux

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.98. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 1

yosys> abc -dff

3.101. Executing ABC pass (technology mapping using ABC).

3.101.1. Summary of detected clock domains:
  9738 cells in clk={ }, en={ }, arst={ }, srst={ }

3.101.2. Extracting gate netlist of module `\twofish_whit_keysched128' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 9738 gates and 9868 wires to a netlist network with 128 inputs and 256 outputs.

3.101.2.1. Executing ABC.

yosys> abc -dff

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Summary of detected clock domains:
  8861 cells in clk={ }, en={ }, arst={ }, srst={ }

3.102.2. Extracting gate netlist of module `\twofish_whit_keysched128' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 8861 gates and 8989 wires to a netlist network with 128 inputs and 256 outputs.

3.102.2.1. Executing ABC.

yosys> abc -dff

3.103. Executing ABC pass (technology mapping using ABC).

3.103.1. Summary of detected clock domains:
  8920 cells in clk={ }, en={ }, arst={ }, srst={ }

3.103.2. Extracting gate netlist of module `\twofish_whit_keysched128' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 8920 gates and 9048 wires to a netlist network with 128 inputs and 256 outputs.

3.103.2.1. Executing ABC.

yosys> abc -dff

3.104. Executing ABC pass (technology mapping using ABC).

3.104.1. Summary of detected clock domains:
  8881 cells in clk={ }, en={ }, arst={ }, srst={ }

3.104.2. Extracting gate netlist of module `\twofish_whit_keysched128' to `<abc-temp-dir>/input.blif'..
No matching clock domain found. Not extracting any FF cells.
Extracted 8881 gates and 9009 wires to a netlist network with 128 inputs and 256 outputs.

3.104.2.1. Executing ABC.

yosys> opt_ffinv

3.105. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~12 debug messages>

yosys> opt_merge -nomux

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.
    Found cells that share an operand and can be merged by moving the $_MUX_ $abc$47275$auto$blifparse.cc:381:parse_blif$52022 in front of them:
        $abc$47275$auto$blifparse.cc:381:parse_blif$51997
        $abc$47275$auto$blifparse.cc:381:parse_blif$52021

    Found cells that share an operand and can be merged by moving the $_MUX_ $abc$47275$auto$blifparse.cc:381:parse_blif$52456 in front of them:
        $abc$47275$auto$blifparse.cc:381:parse_blif$52434
        $abc$47275$auto$blifparse.cc:381:parse_blif$52408


yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 31206 unused wires.
<suppressed ~1425 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~2 debug messages>

yosys> opt_muxtree

3.115. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.116. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.117. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.118. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.119. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.120. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.121. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 2

yosys> bmuxmap

3.122. Executing BMUXMAP pass.

yosys> demuxmap

3.123. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_CCBMJX/abc_tmp_1.scr

3.124. Executing ABC pass (technology mapping using ABC).

3.124.1. Extracting gate netlist of module `\twofish_whit_keysched128' to `<abc-temp-dir>/input.blif'..
Extracted 8888 gates and 9018 wires to a netlist network with 130 inputs and 262 outputs.

3.124.1.1. Executing ABC.
DE:   #PIs = 130  #Luts =  2842  Max Lvl =  25  Avg Lvl =  16.24  [   0.35 sec. at Pass 0]{firstMap}
DE:   #PIs = 130  #Luts =  2836  Max Lvl =  46  Avg Lvl =  28.93  [ 126.14 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 130  #Luts =  2524  Max Lvl =  39  Avg Lvl =  23.66  [   6.01 sec. at Pass 2]{map}
DE:   #PIs = 130  #Luts =  2524  Max Lvl =  39  Avg Lvl =  23.66  [ 106.14 sec. at Pass 3]{postMap}
DE:   #PIs = 130  #Luts =  2494  Max Lvl =  36  Avg Lvl =  22.27  [  10.56 sec. at Pass 4]{map}
DE:   #PIs = 130  #Luts =  2494  Max Lvl =  36  Avg Lvl =  22.27  [ 148.68 sec. at Pass 5]{postMap}
DE:   #PIs = 130  #Luts =  2494  Max Lvl =  36  Avg Lvl =  22.27  [  13.90 sec. at Pass 6]{map}
DE:   #PIs = 130  #Luts =  2494  Max Lvl =  36  Avg Lvl =  22.27  [ 161.33 sec. at Pass 7]{postMap}
DE:   #PIs = 130  #Luts =  2494  Max Lvl =  36  Avg Lvl =  22.27  [   1.87 sec. at Pass 8]{finalMap}

yosys> opt_expr

3.125. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_merge -nomux

3.126. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.127. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~2 debug messages>

yosys> opt_reduce

3.128. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.130. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.131. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.132. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 9018 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.134. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.135. Printing statistics.

=== twofish_whit_keysched128 ===

   Number of wires:               4041
   Number of wire bits:           9784
   Number of public wires:        1801
   Number of public wire bits:    7544
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2496
     $lut                         2494
     $mux                            2


yosys> shregmap -minlen 8 -maxlen 20

3.136. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.137. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.138. Printing statistics.

=== twofish_whit_keysched128 ===

   Number of wires:               4041
   Number of wire bits:           9784
   Number of public wires:        1801
   Number of public wire bits:    7544
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2496
     $lut                         2494
     $mux                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.139. Executing TECHMAP pass (map to technology primitives).

3.139.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.139.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.139.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using extmapper simplemap for cells of type $mux.
No more expansions possible.
<suppressed ~2632 debug messages>

yosys> opt_expr -mux_undef

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~31106 debug messages>

yosys> simplemap

3.141. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
<suppressed ~59103 debug messages>
Removed a total of 19701 cells.

yosys> opt_dff -nodffe -nosdff

3.144. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.145. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 4543 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.146. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
<suppressed ~497 debug messages>

yosys> opt_merge -nomux

3.147. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
<suppressed ~114 debug messages>
Removed a total of 38 cells.

yosys> opt_muxtree

3.148. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.149. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.151. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.152. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 97 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.154. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_CCBMJX/abc_tmp_2.scr

3.155. Executing ABC pass (technology mapping using ABC).

3.155.1. Extracting gate netlist of module `\twofish_whit_keysched128' to `<abc-temp-dir>/input.blif'..
Extracted 17182 gates and 17312 wires to a netlist network with 128 inputs and 256 outputs.

3.155.1.1. Executing ABC.
DE:   #PIs = 128  #Luts =  2811  Max Lvl =  32  Avg Lvl =  19.98  [   0.60 sec. at Pass 0]{firstMap}
DE:   #PIs = 128  #Luts =  2604  Max Lvl =  33  Avg Lvl =  21.48  [ 346.67 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 128  #Luts =  2487  Max Lvl =  35  Avg Lvl =  22.26  [   8.41 sec. at Pass 2]{map}
DE:   #PIs = 128  #Luts =  2487  Max Lvl =  35  Avg Lvl =  22.26  [ 132.15 sec. at Pass 3]{postMap}
DE:   #PIs = 128  #Luts =  2487  Max Lvl =  35  Avg Lvl =  22.26  [   7.84 sec. at Pass 4]{map}
DE:   #PIs = 128  #Luts =  2487  Max Lvl =  35  Avg Lvl =  22.26  [ 147.86 sec. at Pass 5]{postMap}
DE:   #PIs = 128  #Luts =  2487  Max Lvl =  35  Avg Lvl =  22.26  [   1.21 sec. at Pass 6]{finalMap}

yosys> opt_expr

3.156. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.

yosys> opt_merge -nomux

3.157. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.158. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \twofish_whit_keysched128..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.159. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \twofish_whit_keysched128.
Performed a total of 0 changes.

yosys> opt_merge

3.160. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\twofish_whit_keysched128'.
Removed a total of 0 cells.

yosys> opt_share

3.161. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.162. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.163. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 8937 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.164. Executing OPT_EXPR pass (perform const folding).
Optimizing module twofish_whit_keysched128.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.165. Executing HIERARCHY pass (managing design hierarchy).

3.165.1. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched128

3.165.2. Analyzing design hierarchy..
Top module:  \twofish_whit_keysched128
Removed 0 unused modules.

yosys> stat

3.166. Printing statistics.

=== twofish_whit_keysched128 ===

   Number of wires:               4032
   Number of wire bits:           9775
   Number of public wires:        1801
   Number of public wire bits:    7544
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2487
     $lut                         2487


yosys> opt_clean -purge

3.167. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \twofish_whit_keysched128..
Removed 0 unused cells and 1536 unused wires.
<suppressed ~1536 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.168. Executing Verilog backend.
Dumping module `\twofish_whit_keysched128'.

End of script. Logfile hash: 24c69de731, CPU: user 35.24s system 0.19s, MEM: 173.68 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 99% 6x abc (4415 sec), 0% 27x opt_expr (13 sec), ...
real 1285.70
user 4393.96
sys 54.64
