
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vlog2k s38584.v GSCLib_3.0.v

yosys> verific -vlog2k s38584.v GSCLib_3.0.v

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 's38584.v'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'GSCLib_3.0.v'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:91: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:92: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:93: undeclared symbol 'I3_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:95: undeclared symbol 'I5_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:161: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:162: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:194: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:195: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:196: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:348: undeclared symbol 'I0_CLEAR', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:349: undeclared symbol 'I0_SET', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:350: undeclared symbol 'NET0131_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:350: undeclared symbol 'D_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:351: undeclared symbol 'P0001_', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:353: undeclared symbol 'NET0131', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:354: undeclared symbol 'P0001', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:357: undeclared symbol 'I12_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:358: undeclared symbol 'D_EQ_0_AN_RN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:359: undeclared symbol 'D_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:360: undeclared symbol 'RN_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:430: undeclared symbol 'P0001', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:431: undeclared symbol 'P0000', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:591: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:618: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:646: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:678: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:711: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:739: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:771: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:805: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:806: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:838: undeclared symbol 'I0_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:839: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:840: undeclared symbol 'I2_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:877: undeclared symbol 'I1_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:878: undeclared symbol 'I3_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:879: undeclared symbol 'I4_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:987: undeclared symbol 'I0_D', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:988: undeclared symbol 'I0_CLEAR', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:989: undeclared symbol 'I0_SET', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:990: undeclared symbol 'P0002', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:991: undeclared symbol 'P0000', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:994: undeclared symbol 'RN_EQ_1_AN_SE_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:995: undeclared symbol 'RN_EQ_1_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:996: undeclared symbol 'I12_out', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:997: undeclared symbol 'RN_EQ_1_AN_SE_EQ_0_AN_SN_EQ_1', assumed default net type 'wire'
VERIFIC-INFO [VERI-2561] GSCLib_3.0.v:1189: undeclared symbol 'I0_out', assumed default net type 'wire'

yosys> synth_rs -top s38584 -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top s38584

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] s38584.v:43: compiling module 's38584'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:334: compiling module 'DFFSRX1'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:58: compiling module 'mdff'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:414: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:556: compiling module 'MX2X1'
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:73: compiling module 'mmux2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:579: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:640: compiling module 'NAND3X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:664: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:706: compiling module 'NOR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:726: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:671: compiling module 'NAND4X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:699: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:155: compiling module 'AOI21X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:180: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:913: compiling module 'OR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:932: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:868: compiling module 'OAI33X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:906: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:939: compiling module 'OR4X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:966: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:799: compiling module 'OAI21X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:824: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:129: compiling module 'AND2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:148: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:468: compiling module 'INVX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:483: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:1213: compiling module 'XOR2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:1232: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:586: compiling module 'NAND2X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:606: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:831: compiling module 'OAI22X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:861: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:187: compiling module 'AOI22X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:217: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:613: compiling module 'NAND2X2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:633: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:733: compiling module 'NOR3X1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:757: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:512: compiling module 'INVX4'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:527: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:490: compiling module 'INVX2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:505: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:268: compiling module 'CLKBUFX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:283: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:290: compiling module 'CLKBUFX2'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:305: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:246: compiling module 'BUFX3'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:261: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:24: compiling module 'ADDHX1'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:51: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:312: compiling module 'CLKBUFX3'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:327: specify block is ignored for synthesis
VERIFIC-INFO [VERI-1018] GSCLib_3.0.v:534: compiling module 'INVX8'
VERIFIC-WARNING [VERI-2199] GSCLib_3.0.v:549: specify block is ignored for synthesis
Importing module s38584.
Importing module ADDHX1.
Importing module AND2X1.
Importing module AOI21X1.
Importing module AOI22X1.
Importing module BUFX3.
Importing module CLKBUFX1.
Importing module CLKBUFX2.
Importing module CLKBUFX3.
Importing module DFFSRX1.
Importing module INVX1.
Importing module INVX2.
Importing module INVX4.
Importing module INVX8.
Importing module MX2X1.
Importing module NAND2X1.
Importing module NAND2X2.
Importing module NAND3X1.
Importing module NAND4X1.
Importing module NOR2X1.
Importing module NOR3X1.
Importing module OAI21X1.
Importing module OAI22X1.
Importing module OAI33X1.
Importing module OR2X1.
Importing module OR4X1.
Importing module XOR2X1.
Importing module mdff.
Importing module mmux2.

3.4.1. Analyzing design hierarchy..
Top module:  \s38584
Used module:     \AND2X1
Used module:     \NOR2X1
Used module:     \AOI21X1
Used module:     \CLKBUFX1
Used module:     \NAND3X1
Used module:     \INVX1
Used module:     \CLKBUFX3
Used module:     \INVX2
Used module:     \BUFX3
Used module:     \INVX4
Used module:     \CLKBUFX2
Used module:     \NAND2X1
Used module:     \OAI21X1
Used module:     \OR2X1
Used module:     \NAND2X2
Used module:     \NAND4X1
Used module:     \AOI22X1
Used module:     \OR4X1
Used module:     \XOR2X1
Used module:     \MX2X1
Used module:         \mmux2
Used module:     \INVX8
Used module:     \OAI22X1
Used module:     \NOR3X1
Used module:     \DFFSRX1
Used module:         \mdff
Used module:     \ADDHX1
Used module:     \OAI33X1

3.4.2. Analyzing design hierarchy..
Top module:  \s38584
Used module:     \AND2X1
Used module:     \NOR2X1
Used module:     \AOI21X1
Used module:     \CLKBUFX1
Used module:     \NAND3X1
Used module:     \INVX1
Used module:     \CLKBUFX3
Used module:     \INVX2
Used module:     \BUFX3
Used module:     \INVX4
Used module:     \CLKBUFX2
Used module:     \NAND2X1
Used module:     \OAI21X1
Used module:     \OR2X1
Used module:     \NAND2X2
Used module:     \NAND4X1
Used module:     \AOI22X1
Used module:     \OR4X1
Used module:     \XOR2X1
Used module:     \MX2X1
Used module:         \mmux2
Used module:     \INVX8
Used module:     \OAI22X1
Used module:     \NOR3X1
Used module:     \DFFSRX1
Used module:         \mdff
Used module:     \ADDHX1
Used module:     \OAI33X1
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module mmux2.
Optimizing module mdff.
Optimizing module XOR2X1.
Optimizing module OR4X1.
Optimizing module OR2X1.
Optimizing module OAI33X1.
Optimizing module OAI22X1.
Optimizing module OAI21X1.
Optimizing module NOR3X1.
Optimizing module NOR2X1.
Optimizing module NAND4X1.
Optimizing module NAND3X1.
Optimizing module NAND2X2.
Optimizing module NAND2X1.
Optimizing module MX2X1.
Optimizing module INVX8.
Optimizing module INVX4.
Optimizing module INVX2.
Optimizing module INVX1.
Optimizing module DFFSRX1.
Optimizing module CLKBUFX3.
Optimizing module CLKBUFX2.
Optimizing module CLKBUFX1.
Optimizing module BUFX3.
Optimizing module AOI22X1.
Optimizing module AOI21X1.
Optimizing module AND2X1.
Optimizing module ADDHX1.
Optimizing module s38584.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module ADDHX1.
Deleting now unused module AND2X1.
Deleting now unused module AOI21X1.
Deleting now unused module AOI22X1.
Deleting now unused module BUFX3.
Deleting now unused module CLKBUFX1.
Deleting now unused module CLKBUFX2.
Deleting now unused module CLKBUFX3.
Deleting now unused module DFFSRX1.
Deleting now unused module INVX1.
Deleting now unused module INVX2.
Deleting now unused module INVX4.
Deleting now unused module INVX8.
Deleting now unused module MX2X1.
Deleting now unused module NAND2X1.
Deleting now unused module NAND2X2.
Deleting now unused module NAND3X1.
Deleting now unused module NAND4X1.
Deleting now unused module NOR2X1.
Deleting now unused module NOR3X1.
Deleting now unused module OAI21X1.
Deleting now unused module OAI22X1.
Deleting now unused module OAI33X1.
Deleting now unused module OR2X1.
Deleting now unused module OR4X1.
Deleting now unused module XOR2X1.
Deleting now unused module mdff.
Deleting now unused module mmux2.
<suppressed ~6727 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~10993 debug messages>

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 8175 unused cells and 81270 unused wires.
<suppressed ~36219 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module s38584...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~698 debug messages>

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~429 debug messages>
Removed a total of 143 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~789 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
    New input vector for $reduce_and cell $flatten\g72601.$verific$i5$GSCLib_3.0.v:678$24557: { \g370_reg.NET0131 \g385_reg.NET0131 \g499_reg.NET0131 \g504_reg.df1.out \g64846.A \g65390.A }
    New input vector for $reduce_and cell $flatten\g72593.$verific$i5$GSCLib_3.0.v:678$24557: { \g51.Y \g64382.Y \g67_dup.C \g72593.A \g72599.A \g72593.B }
    New input vector for $reduce_and cell $flatten\g72484.$verific$i5$GSCLib_3.0.v:678$24557: { \g4322_reg.NET0131 \g4332_reg.NET0131 \g4340_reg.NET0131 \g69702.A \g72484.D \g72484.C \g72484.B }
    New input vector for $reduce_and cell $flatten\g72423.$verific$i5$GSCLib_3.0.v:678$24557: { \g1345_reg.NET0131 \g1367_reg.NET0131 \g1379_reg.NET0131 \g1500_reg.NET0131 \g61034.B \g61062.B0 }
    New input vector for $reduce_and cell $flatten\g72413.$verific$i5$GSCLib_3.0.v:646$24555: { \g69733.Y \g69734.Y \g71267.Y \g71270.I0_out \g71271.Y \g71375.D }
    New input vector for $reduce_and cell $flatten\g70341.$verific$i5$GSCLib_3.0.v:678$24557: { \g63192.Y \g64275.Y \g65473.Y \g70341.C \g70346.B \g70341.A }
    New input vector for $reduce_and cell $flatten\g70161.$verific$i5$GSCLib_3.0.v:646$24555: { \g62809.Y \g64725.Y \g64738.Y \g65450.Y \g70161.B \g70161.C }
    New input vector for $reduce_and cell $flatten\g65038.$verific$i5$GSCLib_3.0.v:678$24557: { \g4843_reg.NET0131 \g4849_reg.NET0131 \g4859_reg.NET0131 \g4933_reg.NET0131 \g4966_reg.NET0131 \g4983_reg.df1.out \g4991_reg.df1.out \g61737.B }
    New input vector for $reduce_and cell $flatten\g65033.$verific$i5$GSCLib_3.0.v:678$24557: { \g4843_reg.NET0131 \g4849_reg.NET0131 \g4859_reg.NET0131 \g4944_reg.NET0131 \g4966_reg.NET0131 \g4983_reg.df1.out \g4991_reg.df1.out \g61640.D }
    New input vector for $reduce_and cell $flatten\g64959.$verific$i5$GSCLib_3.0.v:646$24555: { \g4057_reg.df1.out \g4064_reg.NET0131 \g4076_reg.df1.out \g64681.A1 \g65343.A }
    New input vector for $reduce_and cell $flatten\g64957.$verific$i5$GSCLib_3.0.v:646$24555: { \g4057_reg.NET0131 \g4064_reg.NET0131 \g4076_reg.df1.out \g64681.A1 \g65343.A }
    New input vector for $reduce_and cell $flatten\g64956.$verific$i5$GSCLib_3.0.v:646$24555: { \g4057_reg.NET0131 \g4064_reg.df1.out \g4076_reg.df1.out \g64681.A1 \g65343.A }
    New input vector for $reduce_and cell $flatten\g63958.$verific$i5$GSCLib_3.0.v:646$24555: { \g2509_reg.df2.out \g64342.A0 \g72977.B \g70020_dup.A \g35 }
    New input vector for $reduce_and cell $flatten\g63952.$verific$i5$GSCLib_3.0.v:646$24555: { \g2375_reg.df2.out \g33.Y \g70021.A \g70021.B \g35 }
    New input vector for $reduce_and cell $flatten\g63932.$verific$i5$GSCLib_3.0.v:646$24555: { \g2084_reg.NET0131 \g65945.Y \g70143.A \g64324.A0 \g35 }
    New input vector for $reduce_and cell $flatten\g63928.$verific$i5$GSCLib_3.0.v:646$24555: { \g1950_reg.NET0131 \g26_dup72995.A \g26_dup72995.B \g69893.B \g35 }
    New input vector for $reduce_and cell $flatten\g63911.$verific$i5$GSCLib_3.0.v:646$24555: { \g2724_reg.NET0131 \g2729_reg.NET0131 \g2735_reg.NET0131 \g2741_reg.NET0131 \g2748_reg.NET0131 \g2756_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g63910.$verific$i5$GSCLib_3.0.v:646$24555: { \g2724_reg.df1.out \g2729_reg.NET0131 \g2735_reg.NET0131 \g2741_reg.NET0131 \g2748_reg.NET0131 \g2756_reg.NET0131 }
    New input vector for $reduce_and cell $flatten\g63488.$verific$i5$GSCLib_3.0.v:646$24555: { \g62272.A1 \g63358.mx.in0 \g63951.A \g645_reg.df1.out \g691_reg.df1.out }
    New input vector for $reduce_and cell $flatten\g63481.$verific$i5$GSCLib_3.0.v:646$24555: { \g4688_reg.df2.out \g65022.Y \g70130.A \g63481.A \g35 }
    New input vector for $reduce_and cell $flatten\g63478.$verific$i5$GSCLib_3.0.v:646$24555: { \g4681_reg.NET0131 \g64756.B \g65425.B \g72560.A \g63478.A \g35 }
    New input vector for $reduce_and cell $flatten\g63314.$verific$i5$GSCLib_3.0.v:678$24557: { \g1018_reg.df1.out \g63314.B \g63540.A1 \g64662.D \g969_reg.df1.out \g35 }
    New input vector for $reduce_and cell $flatten\g62670.$verific$i5$GSCLib_3.0.v:678$24557: { \g1030_reg.df1.out \g62670.A \g63540.A1 \g64662.D \g969_reg.df1.out \g35 }
    New input vector for $reduce_and cell $flatten\g62268.$verific$i5$GSCLib_3.0.v:678$24557: { \g62268.A \g63540.A1 \g64662.D \g969_reg.df1.out \g1036_reg.df1.out \g35 }
    New input vector for $reduce_and cell $flatten\g60988.$verific$i5$GSCLib_3.0.v:678$24557: { \g1312_reg.df1.out \g1361_reg.df1.out \g61164.B \g61162.A \g60988.A \g35 }
    New input vector for $reduce_and cell $flatten\g60945.$verific$i5$GSCLib_3.0.v:678$24557: { \g1312_reg.df1.out \g1373_reg.df1.out \g61164.B \g61162.A \g60945.A \g35 }
    New input vector for $reduce_and cell $flatten\g60930.$verific$i5$GSCLib_3.0.v:678$24557: { \g1312_reg.df1.out \g1379_reg.df1.out \g60930.A \g61164.B \g61162.A \g35 }
  Optimizing cells in module \s38584.
Performed a total of 27 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~738 debug messages>
Removed a total of 246 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\g996_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g990_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2815_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g979_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g976_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g969_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g962_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g956_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g94_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g947_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g896_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g890_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g887_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1129_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g884_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g881_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1135_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g878_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g875_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g872_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g86_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g869_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g862_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g859_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2811_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g847_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g843_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g837_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g832_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g827_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g822_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g817_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g812_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g807_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g802_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1152_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g79_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g799_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2807_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g781_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g776_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g772_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g767_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g763_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g758_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g753_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g74_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g749_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g744_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g739_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g736_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1157_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g732_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2389_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2803_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2403_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1178_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1171_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1030_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g117_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1183_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1189_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2370_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2361_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2357_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2351_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2342_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2338_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2331_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1105_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g232_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g121_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1221_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1233_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g728_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1116_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2319_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1236_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1018_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2799_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g128_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1306_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2795_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1056_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1024_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2791_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g278_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g723_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1333_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1395_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2787_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2269_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g718_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g225_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2250_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2783_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2236_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g222_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1041_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1373_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g102_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1211_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2779_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2223_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g703_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2217_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2208_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1246_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1099_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g699_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2204_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1205_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2197_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g691_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g686_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1430_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2775_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1442_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1448_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1459_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g146_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1472_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1478_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2771_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1489_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1495_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1500_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g150_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1061_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1514_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1521_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1526_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1532_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1536_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g136_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1542_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1193_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1548_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1079_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1554_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1559_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1564_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1389_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1570_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1426_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g681_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1576_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1404_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2767_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1322_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g215_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1582_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1351_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1589_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1592_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2763_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2759_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1075_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1008_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1319_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2756_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1624_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1636_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1300_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1644_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1648_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g164_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g106_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1657_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1664_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1668_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1677_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1345_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1216_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2748_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1036_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g168_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1691_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1696_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1710_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2741_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1399_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1724_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1728_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2735_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2729_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g174_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2724_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1002_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1760_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1146_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6741_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6736_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6727_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6723_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2719_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1083_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1361_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g671_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6719_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1772_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1779_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1783_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1792_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1798_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6715_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1087_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1802_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1422_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1811_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1816_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1384_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6711_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1312_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g182_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1830_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2704_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6704_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1844_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1858_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1862_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g269_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g66_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1046_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2697_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6697_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1418_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1894_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1906_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6692_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1913_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6682_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g667_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6675_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6668_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6661_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6657_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6653_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6649_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6645_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6641_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6637_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6633_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6629_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1199_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1367_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6625_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6621_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g661_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6617_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6613_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6609_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6605_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6601_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6597_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6593_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1926_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6589_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6585_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6581_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6573_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6565_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6561_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g655_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1052_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1932_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1936_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6549_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2685_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6537_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6523_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6513_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1945_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g194_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g650_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6509_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6505_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6500_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6486_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1950_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2671_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g645_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g218_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6444_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1964_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6395_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6390_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6381_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6377_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6373_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6369_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6365_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6358_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6351_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2185_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6346_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1978_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6336_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6329_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6322_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6315_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6311_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6307_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6303_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6299_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6295_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6279_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6275_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6271_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1992_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6267_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6263_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6259_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6251_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6247_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6243_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6235_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6219_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6215_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6209_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6203_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1996_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2657_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6177_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6167_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6163_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6159_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6154_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2652_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6140_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1379_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6098_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g1_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6049_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6044_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6035_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6031_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6027_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6023_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6019_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6012_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6005_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g6000_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g59_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5990_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5983_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5976_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5969_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5965_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5961_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5957_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5953_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5949_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5945_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5941_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5937_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5933_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5929_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5925_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5921_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5913_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5909_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5905_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5901_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5897_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5893_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5889_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5881_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5873_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5869_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5863_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5857_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5845_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2638_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5831_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5821_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5817_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5813_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5808_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g262_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5794_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5752_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5703_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5698_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5685_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5681_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5677_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5673_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2629_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5666_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5659_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5654_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5644_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5637_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5630_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5623_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5619_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5615_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5611_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5607_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5603_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5599_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5595_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5591_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5587_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5583_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5579_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5575_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5571_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5567_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5563_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5559_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5551_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g554_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5547_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5543_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5535_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5527_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5523_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5517_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5511_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g550_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2625_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5499_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5485_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2619_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5475_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5471_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g546_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5467_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5462_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5448_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g542_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5406_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g538_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5357_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5352_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g534_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5348_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5343_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5339_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2610_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5335_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5331_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5327_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2028_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5320_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5313_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5308_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5297_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5290_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g528_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5276_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5272_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5268_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5264_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5260_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5256_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5252_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5248_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5244_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5240_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5236_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5232_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5228_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5224_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5220_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5216_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5212_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5208_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5204_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5200_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5196_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g518_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5188_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5180_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5176_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5170_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5164_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5156_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5152_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2606_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g513_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5138_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5128_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5124_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5120_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5115_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2599_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5105_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5097_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5092_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5084_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5080_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5069_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5062_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5057_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5052_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g504_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5046_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5041_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5037_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5033_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5029_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5022_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g5016_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g499_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4991_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4983_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4975_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g496_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4966_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4961_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4955_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4950_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4944_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4939_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4933_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4927_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4922_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4912_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g490_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4907_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4899_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4894_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4888_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2587_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4871_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4864_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4859_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4854_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4849_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4843_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4836_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g482_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4801_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g479_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4793_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4785_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4776_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4771_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4765_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4760_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g475_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4754_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4749_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4743_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4737_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4732_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4727_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4722_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4717_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4709_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4704_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4698_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4681_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4674_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2040_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4669_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4664_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4659_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4653_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4646_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4643_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4639_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4633_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4628_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4621_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4616_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g460_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4608_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4601_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4593_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4584_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4578_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4575_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4572_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4571_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4570_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4564_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4561_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4558_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4537_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4534_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g452_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4527_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4520_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2047_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4519_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4515_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4492_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4489_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4486_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4483_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4477_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4474_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2051_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4473_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g446_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4467_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4462_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4459_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4456_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4452_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4449_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4446_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4443_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4438_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4430_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4427_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4423_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2060_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4420_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g441_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4417_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4414_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4411_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4408_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4405_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4401_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4392_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4388_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4382_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g437_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4375_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4372_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2555_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4358_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4349_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4340_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g433_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4332_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4322_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4311_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4308_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2066_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4304_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4300_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g429_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4297_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4294_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4281_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2070_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4277_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4273_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4269_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4264_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4258_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4253_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g424_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4249_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4245_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4242_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4232_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4229_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4226_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2079_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4222_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4219_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2084_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4216_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4213_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2551_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4210_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4207_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4204_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2093_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4200_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4197_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4194_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2098_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4188_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4185_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4180_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g417_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4176_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4172_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4157_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4153_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4146_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4145_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4141_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g411_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4108_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4104_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4098_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4093_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4087_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4082_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4076_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4064_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g405_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4057_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4054_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4049_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4040_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2537_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4031_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g209_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4027_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4023_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g401_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4019_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4012_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4005_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g4000_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3990_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3983_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3976_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3969_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3965_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3961_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3957_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3953_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3949_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3945_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3941_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3937_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3933_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g392_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3929_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3925_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3921_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3913_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3909_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3905_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3901_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3897_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3893_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3889_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3881_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3873_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3869_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3863_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g385_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3857_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3845_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3831_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3821_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3817_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3813_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2523_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3794_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g376_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3752_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g370_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3703_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3698_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3680_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2112_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3676_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3672_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3668_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3661_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g365_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3654_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3649_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3639_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3632_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3625_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3618_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3614_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3610_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3606_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3602_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3598_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3594_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3590_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g358_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2126_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3586_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3582_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3578_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3574_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3570_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3566_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3562_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g355_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3558_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3554_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3550_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3546_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3542_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3538_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3530_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3522_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2421_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3518_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3512_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3506_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g34_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3494_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3480_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g347_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3470_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3466_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3462_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2504_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g344_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3443_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g341_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3401_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g336_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3352_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3347_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3338_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2495_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3329_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3325_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2130_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3321_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3317_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3310_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2138_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3303_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3298_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3288_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3281_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2145_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3274_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3267_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2153_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3263_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3259_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3255_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3251_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g324_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3247_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3243_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3239_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3235_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3231_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3227_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3223_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3219_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3215_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3211_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3207_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3203_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3199_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3195_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3191_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3187_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3179_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3171_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g316_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3167_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3161_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3155_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2491_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3143_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3129_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2485_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3119_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3115_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3111_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2476_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3092_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g305_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g3050_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2472_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2999_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2994_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2988_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2984_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2980_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2975_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2970_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2960_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2955_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2950_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g294_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2946_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2941_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2936_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g246_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2922_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2912_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2907_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2902_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2465_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2894_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2890_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2886_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g287_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2873_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2868_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2860_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2417_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2852_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2848_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2844_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g283_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2453_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2827_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2823_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.
Changing const-value async load to async reset on $flatten\g2819_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 83 unused cells and 306 unused wires.
<suppressed ~144 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~543 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~543 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\g6533_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g64441.Y, Q = \g6533_reg.df2.out).
Adding EN signal on $flatten\g6519_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g63046.Y, Q = \g6519_reg.df2.out).
Adding EN signal on $flatten\g6187_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g6187_reg.D, Q = \g6187_reg.df2.out).
Adding EN signal on $flatten\g6173_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g6173_reg.D, Q = \g6173_reg.df2.out).
Adding EN signal on $flatten\g5841_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g5841_reg.D, Q = \g5841_reg.df2.out).
Adding EN signal on $flatten\g5827_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g5827_reg.D, Q = \g5827_reg.df2.out).
Adding EN signal on $flatten\g5495_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g5495_reg.D, Q = \g5495_reg.df2.out).
Adding EN signal on $flatten\g5481_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g5481_reg.D, Q = \g5481_reg.df2.out).
Adding EN signal on $flatten\g5148_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g5148_reg.D, Q = \g5148_reg.df2.out).
Adding EN signal on $flatten\g5134_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g5134_reg.D, Q = \g5134_reg.df2.out).
Adding EN signal on $flatten\g5011_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g5011_reg.D, Q = \g5011_reg.df2.out).
Adding EN signal on $flatten\g4831_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g4831_reg.D, Q = \g4831_reg.df2.out).
Adding EN signal on $flatten\g4826_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g4826_reg.D, Q = \g4826_reg.df2.out).
Adding EN signal on $flatten\g3841_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g3841_reg.D, Q = \g3841_reg.df2.out).
Adding EN signal on $flatten\g3827_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g3827_reg.D, Q = \g3827_reg.df2.out).
Adding EN signal on $flatten\g37_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2894_reg.NET0131, Q = \g37_reg.df2.out).
Adding EN signal on $flatten\g3490_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g3490_reg.D, Q = \g3490_reg.df2.out).
Adding EN signal on $flatten\g3476_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g3476_reg.D, Q = \g3476_reg.df2.out).
Adding EN signal on $flatten\g3139_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g3139_reg.D, Q = \g3139_reg.df2.out).
Adding EN signal on $flatten\g3125_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g3125_reg.D, Q = \g3125_reg.df2.out).
Adding EN signal on $flatten\g2681_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2681_reg.D, Q = \g2681_reg.df2.out).
Adding EN signal on $flatten\g2667_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2667_reg.D, Q = \g2667_reg.df2.out).
Adding EN signal on $flatten\g2547_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2547_reg.D, Q = \g2547_reg.df2.out).
Adding EN signal on $flatten\g2533_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2533_reg.D, Q = \g2533_reg.df2.out).
Adding EN signal on $flatten\g2413_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2413_reg.D, Q = \g2413_reg.df2.out).
Adding EN signal on $flatten\g2399_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2399_reg.D, Q = \g2399_reg.df2.out).
Adding EN signal on $flatten\g2279_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2279_reg.D, Q = \g2279_reg.df2.out).
Adding EN signal on $flatten\g2265_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2265_reg.D, Q = \g2265_reg.df2.out).
Adding EN signal on $flatten\g2122_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2122_reg.D, Q = \g2122_reg.df2.out).
Adding EN signal on $flatten\g2108_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g2108_reg.D, Q = \g2108_reg.df2.out).
Adding EN signal on $flatten\g1988_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g1988_reg.D, Q = \g1988_reg.df2.out).
Adding EN signal on $flatten\g1974_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g1974_reg.D, Q = \g1974_reg.df2.out).
Adding EN signal on $flatten\g1854_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g1854_reg.D, Q = \g1854_reg.df2.out).
Adding EN signal on $flatten\g1840_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g1840_reg.D, Q = \g1840_reg.df2.out).
Adding EN signal on $flatten\g1720_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g1720_reg.D, Q = \g1720_reg.df2.out).
Adding EN signal on $flatten\g1706_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g1706_reg.D, Q = \g1706_reg.df2.out).
Adding EN signal on $flatten\g1687_reg.\df2.$verific$out_reg$GSCLib_3.0.v:67$24589 ($aldff) from module s38584 (D = \g1687_reg.D, Q = \g1687_reg.df2.out).
Setting constant 1-bit at position 0 on $flatten\g1291_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g2130_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g2689_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4727_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4917_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g947_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 11 unused cells and 42 unused wires.
<suppressed ~53 debug messages>

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~50 debug messages>

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~542 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
    New input vector for $reduce_and cell $flatten\g72977.$verific$i5$GSCLib_3.0.v:646$24555: { \g64342.A0 \g72977.B }
    New input vector for $reduce_and cell $flatten\g72959.$verific$i5$GSCLib_3.0.v:646$24555: { \g33.Y \g64340.A0 }
    New input vector for $reduce_and cell $flatten\g70143.$verific$i5$GSCLib_3.0.v:646$24555: { \g70143.A \g64324.A0 }
    New input vector for $reduce_and cell $flatten\g69893.$verific$i5$GSCLib_3.0.v:646$24555: { \g26_dup72995.B \g69893.B }
    New input vector for $reduce_and cell $flatten\g63958.$verific$i5$GSCLib_3.0.v:646$24555: { \g2509_reg.df2.out \g64342.A0 \g72977.B \g35 }
    New input vector for $reduce_and cell $flatten\g63952.$verific$i5$GSCLib_3.0.v:646$24555: { \g2375_reg.df2.out \g33.Y \g64340.A0 \g35 }
    New input vector for $reduce_and cell $flatten\g63932.$verific$i5$GSCLib_3.0.v:646$24555: { \g2084_reg.NET0131 \g70143.A \g64324.A0 \g35 }
    New input vector for $reduce_and cell $flatten\g63928.$verific$i5$GSCLib_3.0.v:646$24555: { \g1950_reg.NET0131 \g26_dup72995.B \g69893.B \g35 }
  Optimizing cells in module \s38584.
Performed a total of 8 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~21 debug messages>
Removed a total of 7 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $flatten\g2138_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g2697_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4732_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4922_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 26 unused cells and 69 unused wires.
<suppressed ~95 debug messages>

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~6 debug messages>

yosys> opt_muxtree

3.49. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~538 debug messages>

yosys> opt_reduce

3.50. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.51. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.52. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.53. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $flatten\g4717_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4907_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.

yosys> opt_clean

3.54. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 4 unused cells and 16 unused wires.
<suppressed ~20 debug messages>

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~10 debug messages>

yosys> opt_muxtree

3.56. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~536 debug messages>

yosys> opt_reduce

3.57. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.58. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.59. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.60. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $flatten\g4722_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.
Setting constant 1-bit at position 0 on $flatten\g4912_reg.\df1.$verific$out_reg$GSCLib_3.0.v:67$24589 ($adff) from module s38584.

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 6 unused cells and 24 unused wires.
<suppressed ~30 debug messages>

yosys> opt_expr

3.62. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~6 debug messages>
MAX OPT ITERATION = 4

yosys> wreduce -keepdc

3.63. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24643 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24646 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24649 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24652 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24655 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24658 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24615 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24618 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24627 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24624 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24639 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24636 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24633 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24630 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24621 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24612 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24609 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24606 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24603 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24600 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24700 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24697 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24694 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24688 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24682 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24676 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24673 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24670 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24597 ($ne).
Removed top 1 bits (of 2) from port B of cell s38584.$auto$opt_dff.cc:195:make_patterns_logic$24664 ($ne).

yosys> peepopt

3.64. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.65. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> bmuxmap

3.66. Executing BMUXMAP pass.

yosys> demuxmap

3.67. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.68. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module s38584:
  created 0 $alu and 0 $macc cells.

yosys> opt_expr

3.69. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.70. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.71. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~534 debug messages>

yosys> opt_reduce

3.72. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.73. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.74. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.75. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.76. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.77. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 1

yosys> stat

3.78. Printing statistics.

=== s38584 ===

   Number of wires:              52669
   Number of wire bits:          52669
   Number of public wires:       52633
   Number of public wire bits:   52633
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10450
     $adff                         914
     $aldff                        210
     $aldffe                        37
     $and                         1921
     $mux                          840
     $ne                            35
     $not                         3874
     $or                          1708
     $reduce_and                   693
     $reduce_or                     41
     $xor                          177


yosys> memory -nomap

3.79. Executing MEMORY pass.

yosys> opt_mem

3.79.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.79.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.79.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.79.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.79.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.79.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> memory_share

3.79.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.79.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.79.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> memory_collect

3.79.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.80. Printing statistics.

=== s38584 ===

   Number of wires:              52669
   Number of wire bits:          52669
   Number of public wires:       52633
   Number of public wire bits:   52633
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10450
     $adff                         914
     $aldff                        210
     $aldffe                        37
     $and                         1921
     $mux                          840
     $ne                            35
     $not                         3874
     $or                          1708
     $reduce_and                   693
     $reduce_or                     41
     $xor                          177


yosys> muxpack

3.81. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~600 debug messages>

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> pmuxtree

3.83. Executing PMUXTREE pass.

yosys> muxpack

3.84. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converted 0 (p)mux cells into 0 pmux cells.
<suppressed ~600 debug messages>

yosys> memory_map

3.85. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.86. Printing statistics.

=== s38584 ===

   Number of wires:              52669
   Number of wire bits:          52669
   Number of public wires:       52633
   Number of public wire bits:   52633
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              10450
     $adff                         914
     $aldff                        210
     $aldffe                        37
     $and                         1921
     $mux                          840
     $ne                            35
     $not                         3874
     $or                          1708
     $reduce_and                   693
     $reduce_or                     41
     $xor                          177


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.87. Executing TECHMAP pass (map to technology primitives).

3.87.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.87.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.87.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $reduce_and.
Using extmapper simplemap for cells of type $aldff.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $aldffe.
No more expansions possible.
<suppressed ~10521 debug messages>

yosys> stat

3.88. Printing statistics.

=== s38584 ===

   Number of wires:              54226
   Number of wire bits:          54620
   Number of public wires:       52633
   Number of public wire bits:   52633
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:              11632
     $_ALDFFE_PPN_                   1
     $_ALDFFE_PPP_                  36
     $_ALDFF_PP_                   210
     $_AND_                       3667
     $_DFF_PP1_                    914
     $_MUX_                        840
     $_NOT_                       3874
     $_OR_                        1843
     $_XOR_                        247


yosys> opt_expr

3.89. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~70 debug messages>

yosys> opt_merge -nomux

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~411 debug messages>
Removed a total of 137 cells.

yosys> opt_muxtree

3.91. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.92. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.93. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.94. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.95. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.96. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 882 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.97. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 1

yosys> opt_expr -full

3.98. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~144 debug messages>

yosys> techmap -map +/techmap.v

3.99. Executing TECHMAP pass (map to technology primitives).

3.99.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.99.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.101. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.102. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.103. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.104. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.105. Executing OPT_DFF pass (perform DFF optimizations).
Setting constant 1-bit at position 0 on $auto$ff.cc:262:slice$36031 ($_DFF_PP1_) from module s38584.
Setting constant 1-bit at position 0 on $auto$ff.cc:262:slice$36101 ($_DFF_PP1_) from module s38584.

yosys> opt_clean

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 4 unused cells and 16 unused wires.
<suppressed ~20 debug messages>

yosys> opt_expr

3.107. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~5 debug messages>

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.111. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.112. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 1 unused cells and 5 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

3.113. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_muxtree

3.114. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.115. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.116. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.117. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.118. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.119. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 3

yosys> abc -dff

3.120. Executing ABC pass (technology mapping using ABC).

3.120.1. Summary of detected clock domains:
  11383 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.120.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 11136 gates and 11390 wires to a netlist network with 254 inputs and 417 outputs.

3.120.2.1. Executing ABC.

yosys> abc -dff

3.121. Executing ABC pass (technology mapping using ABC).

3.121.1. Summary of detected clock domains:
  5022 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.121.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 4775 gates and 5029 wires to a netlist network with 254 inputs and 348 outputs.

3.121.2.1. Executing ABC.

yosys> abc -dff

3.122. Executing ABC pass (technology mapping using ABC).

3.122.1. Summary of detected clock domains:
  4899 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.122.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 4652 gates and 4906 wires to a netlist network with 254 inputs and 348 outputs.

3.122.2.1. Executing ABC.

yosys> abc -dff

3.123. Executing ABC pass (technology mapping using ABC).

3.123.1. Summary of detected clock domains:
  4906 cells in clk=\blif_clk_net, en={ }, arst=\blif_reset_net, srst={ }

3.123.2. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \blif_clk_net, asynchronously reset by \blif_reset_net
Extracted 4659 gates and 4913 wires to a netlist network with 254 inputs and 348 outputs.

3.123.2.1. Executing ABC.

yosys> opt_ffinv

3.124. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.125. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~15 debug messages>

yosys> opt_merge -nomux

3.126. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~60 debug messages>
Removed a total of 20 cells.

yosys> opt_muxtree

3.127. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.128. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.130. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.131. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52866 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g37_reg.df2.out, Q = $abc$52854$lo011).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52864 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li009_li009, Q = $abc$52854$lo009).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53500 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n6481_, Q = $abc$52854$lo645).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53492 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo632, Q = $abc$52854$lo637).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53487 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo633, Q = $abc$52854$lo632).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53485 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li630_li630, Q = $abc$52854$lo630).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53482 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li627_li627, Q = $abc$52854$lo627).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53478 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n6411_, Q = $abc$52854$lo623).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53463 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li608_li608, Q = $abc$52854$lo608).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53461 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li606_li606, Q = $abc$52854$lo606).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53459 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo136, Q = $abc$52854$lo604).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53457 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li602_li602, Q = $abc$52854$lo602).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53455 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li600_li600, Q = $abc$52854$lo600).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53448 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo585, Q = $abc$52854$lo593).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53440 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo586, Q = $abc$52854$lo585).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53435 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li580_li580, Q = $abc$52854$lo580).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53420 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo568, Q = $abc$52854$lo565).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53419 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo567, Q = $abc$52854$lo564).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53416 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo564, Q = $abc$52854$lo561).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53415 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo566, Q = $abc$52854$lo560).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53414 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li559_li559, Q = $abc$52854$lo559).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53413 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo552, Q = $abc$52854$lo558).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53412 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n6164_, Q = $abc$52854$lo557).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53410 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li555_li555, Q = $abc$52854$lo555).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53409 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li554_li554, Q = $abc$52854$lo554).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53407 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo542, Q = $abc$52854$lo552).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53404 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo553, Q = $abc$52854$lo549).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53403 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo551, Q = $abc$52854$lo548).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53401 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo548, Q = $abc$52854$lo546).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53400 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo550, Q = $abc$52854$lo545).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53397 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li542_li542, Q = $abc$52854$lo542).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53395 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n6089_, Q = $abc$52854$lo540).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53394 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li539_li539, Q = $abc$52854$lo539).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53390 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo538, Q = $abc$52854$lo535).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53389 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo537, Q = $abc$52854$lo534).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53386 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo534, Q = $abc$52854$lo531).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53385 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo536, Q = $abc$52854$lo530).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53383 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li528_li528, Q = $abc$52854$lo528).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53380 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n6026_, Q = $abc$52854$lo525).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53379 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li524_li524, Q = $abc$52854$lo524).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53375 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n6010_, Q = $abc$52854$lo520).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53374 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo523, Q = $abc$52854$lo519).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53373 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo521, Q = $abc$52854$lo518).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53371 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo518, Q = $abc$52854$lo516).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53370 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo520, Q = $abc$52854$lo515).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53369 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li514_li514, Q = $abc$52854$lo514).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53367 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5976_, Q = $abc$52854$lo512).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53365 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li510_li510, Q = $abc$52854$lo510).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53364 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5957_, Q = $abc$52854$lo509).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53363 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li508_li508, Q = $abc$52854$lo508).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53357 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo507, Q = $abc$52854$lo502).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53356 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo506, Q = $abc$52854$lo501).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53354 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo501, Q = $abc$52854$lo499).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53353 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo503, Q = $abc$52854$lo498).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53351 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li496_li496, Q = $abc$52854$lo496).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53350 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5912_, Q = $abc$52854$lo495).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53348 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li493_li493, Q = $abc$52854$lo493).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53347 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5896_, Q = $abc$52854$lo492).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53346 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li491_li491, Q = $abc$52854$lo491).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53343 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li488_li488, Q = $abc$52854$lo488).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53341 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo490, Q = $abc$52854$lo486).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53340 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo489, Q = $abc$52854$lo485).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53338 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo485, Q = $abc$52854$lo483).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53337 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo487, Q = $abc$52854$lo482).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53334 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li479_li479, Q = $abc$52854$lo479).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53333 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5841_, Q = $abc$52854$lo478).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53332 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li477_li477, Q = $abc$52854$lo477).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53328 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li473_li473, Q = $abc$52854$lo473).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53327 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo476, Q = $abc$52854$lo472).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53326 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo475, Q = $abc$52854$lo471).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53324 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo471, Q = $abc$52854$lo469).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53323 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo474, Q = $abc$52854$lo468).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53320 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li465_li465, Q = $abc$52854$lo465).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53319 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li464_li464, Q = $abc$52854$lo464).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53317 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li462_li462, Q = $abc$52854$lo462).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53314 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo463, Q = $abc$52854$lo459).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53313 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo461, Q = $abc$52854$lo458).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53311 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo458, Q = $abc$52854$lo456).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53310 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo460, Q = $abc$52854$lo455).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53309 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li454_li454, Q = $abc$52854$lo454).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53308 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li453_li453, Q = $abc$52854$lo453).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53307 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5743_, Q = $abc$52854$lo452).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53305 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li450_li450, Q = $abc$52854$lo450).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53304 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li449_li449, Q = $abc$52854$lo449).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53303 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li448_li448, Q = $abc$52854$lo448).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53292 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li437_li437, Q = $abc$52854$lo437).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53291 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li436_li436, Q = $abc$52854$lo436).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53289 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li434_li434, Q = $abc$52854$lo434).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53288 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li433_li433, Q = $abc$52854$lo433).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53283 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li428_li428, Q = $abc$52854$lo428).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53282 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li427_li427, Q = $abc$52854$lo427).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53280 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li425_li425, Q = $abc$52854$lo425).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53279 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li424_li424, Q = $abc$52854$lo424).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53275 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo412, Q = $abc$52854$lo420).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53273 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo420, Q = $abc$52854$lo418).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53272 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo418, Q = $abc$52854$lo417).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53271 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo394, Q = $abc$52854$lo416).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53270 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo416, Q = $abc$52854$lo415).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53266 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo417, Q = $abc$52854$lo411).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53264 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo395, Q = $abc$52854$lo409).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53263 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo409, Q = $abc$52854$lo408).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53261 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo408, Q = $abc$52854$lo406).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53260 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo406, Q = $abc$52854$lo405).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53256 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo405, Q = $abc$52854$lo401).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53254 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo401, Q = $abc$52854$lo399).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53253 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo399, Q = $abc$52854$lo398).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53249 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo393, Q = $abc$52854$lo394).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53248 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo392, Q = $abc$52854$lo393).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53244 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g3147_reg.df2.out, Q = $abc$52854$lo389).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53243 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5573_, Q = $abc$52854$lo388).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53242 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5570_, Q = $abc$52854$lo387).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53241 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5568_, Q = $abc$52854$lo386).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53240 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5565_, Q = $abc$52854$lo385).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53231 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g3498_reg.df2.out, Q = $abc$52854$lo376).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53230 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5541_, Q = $abc$52854$lo375).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53229 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5538_, Q = $abc$52854$lo374).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53226 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5535_, Q = $abc$52854$lo371).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53225 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5532_, Q = $abc$52854$lo370).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53214 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g3849_reg.df2.out, Q = $abc$52854$lo359).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53213 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5509_, Q = $abc$52854$lo358).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53212 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5506_, Q = $abc$52854$lo357).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53211 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5504_, Q = $abc$52854$lo356).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53210 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5501_, Q = $abc$52854$lo355).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53206 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo296, Q = $abc$52854$lo351).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53202 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo353, Q = $abc$52854$lo347).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53190 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo331, Q = $abc$52854$lo335).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53188 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo335, Q = $abc$52854$lo333).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53165 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo309, Q = $abc$52854$lo310).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53164 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo307, Q = $abc$52854$lo309).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53163 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo338, Q = $abc$52854$lo308).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53162 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo295, Q = $abc$52854$lo307).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53151 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo289, Q = $abc$52854$lo296).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53138 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo273, Q = $abc$52854$lo283).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53128 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo211, Q = $abc$52854$lo273).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53115 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li260_li260, Q = $abc$52854$lo260).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53106 ($_DFF_PP0_) from module s38584 (D = $abc$52854$li251_li251, Q = $abc$52854$lo251).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53102 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo231, Q = $abc$52854$lo247).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53072 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo216, Q = $abc$52854$lo217).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53069 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo213, Q = $abc$52854$lo214).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53067 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo210, Q = $abc$52854$lo212).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53066 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5137_, Q = $abc$52854$lo211).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53064 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo208, Q = $abc$52854$lo209).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53049 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo193, Q = $abc$52854$lo194).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53045 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo189, Q = $abc$52854$lo190).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53043 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo187, Q = $abc$52854$lo188).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53041 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo185, Q = $abc$52854$lo186).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53039 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n5010_, Q = $abc$52854$lo184).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53015 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo154, Q = $abc$52854$lo160).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53014 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4859_, Q = $abc$52854$lo159).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53013 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4856_, Q = $abc$52854$lo158).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$53010 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4843_, Q = $abc$52854$lo155).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52997 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g5503_reg.df2.out, Q = $abc$52854$lo142).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52995 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4788_, Q = $abc$52854$lo140).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52994 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4785_, Q = $abc$52854$lo139).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52993 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4783_, Q = $abc$52854$lo138).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52992 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4780_, Q = $abc$52854$lo137).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52984 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g5849_reg.df2.out, Q = $abc$52854$lo129).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52983 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4751_, Q = $abc$52854$lo128).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52982 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4748_, Q = $abc$52854$lo127).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52980 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4738_, Q = $abc$52854$lo125).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52973 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g6195_reg.df2.out, Q = $abc$52854$lo118).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52972 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4690_, Q = $abc$52854$lo117).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52971 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4687_, Q = $abc$52854$lo116).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52970 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4685_, Q = $abc$52854$lo115).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52969 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4682_, Q = $abc$52854$lo114).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52961 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g6541_reg.df2.out, Q = $abc$52854$lo106).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52960 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4656_, Q = $abc$52854$lo105).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52958 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4647_, Q = $abc$52854$lo103).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52957 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4645_, Q = $abc$52854$lo102).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52956 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4642_, Q = $abc$52854$lo101).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52953 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo104, Q = $abc$52854$lo098).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52939 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo051, Q = $abc$52854$lo084).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52929 ($_DFF_PP0_) from module s38584 (D = $abc$52854$new_n4485_, Q = $abc$52854$lo074).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52928 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo055, Q = $abc$52854$lo073).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52911 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo109, Q = $abc$52854$lo056).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52906 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo098, Q = $abc$52854$lo051).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52904 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo084, Q = $abc$52854$lo049).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52897 ($_DFF_PP0_) from module s38584 (D = $abc$52854$lo048, Q = $abc$52854$lo042).
Adding EN signal on $abc$52854$auto$blifparse.cc:362:parse_blif$52879 ($_DFF_PP0_) from module s38584 (D = $abc$52854$g854_reg.df2.out, Q = $abc$52854$lo024).

yosys> opt_clean

3.132. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 136 unused cells and 46198 unused wires.
<suppressed ~29251 debug messages>

yosys> opt_expr

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~86 debug messages>

yosys> opt_muxtree

3.134. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.135. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~207 debug messages>
Removed a total of 69 cells.

yosys> opt_share

3.137. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.138. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $auto$ff.cc:262:slice$37695 ($_ALDFF_PP_) from module s38584 (D = \g1604_reg.D, Q = \g1604_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37661 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3701_, Q = \g1632_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37563 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$lo543, Q = \g1821_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37562 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3685_, Q = \g1825_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37497 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$lo527, Q = \g1955_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37496 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3676_, Q = \g1959_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37473 ($_ALDFF_PP_) from module s38584 (D = \g2008_reg.D, Q = \g2008_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37461 ($_ALDFF_PP_) from module s38584 (D = \g61924.Y, Q = \g2036_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37434 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$lo513, Q = \g2089_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37363 ($_ALDFF_PP_) from module s38584 (D = \g2241_reg.df2.out, Q = \g2246_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37300 ($_ALDFF_PP_) from module s38584 (D = \g2375_reg.df2.out, Q = \g2380_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37299 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3636_, Q = \g2384_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37274 ($_ALDFF_PP_) from module s38584 (D = \g2433_reg.D, Q = \g2433_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37233 ($_ALDFF_PP_) from module s38584 (D = \g2509_reg.df2.out, Q = \g2514_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37232 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3627_, Q = \g2518_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37209 ($_ALDFF_PP_) from module s38584 (D = \g2567_reg.D, Q = \g2567_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37197 ($_ALDFF_PP_) from module s38584 (D = \g61936.Y, Q = \g2595_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$37169 ($_ALDFF_PP_) from module s38584 (D = \g2643_reg.df2.out, Q = \g2648_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$36781 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3602_, Q = \g3484_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$36623 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3584_, Q = \g3835_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$36467 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$lo336, Q = \g4112_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$35930 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3569_, Q = \g5142_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$35773 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3566_, Q = \g5489_reg.df2.out).
Adding EN signal on $auto$ff.cc:262:slice$33860 ($_ALDFF_PP_) from module s38584 (D = $abc$52854$new_n3847_, Q = \g6181_reg.df2.out).

yosys> opt_clean

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 18 unused cells and 216 unused wires.
<suppressed ~117 debug messages>

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~12 debug messages>

yosys> opt_muxtree

3.141. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.142. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~27 debug messages>
Removed a total of 9 cells.

yosys> opt_share

3.144. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 15 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_muxtree

3.148. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.149. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.151. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.152. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..

yosys> opt_expr

3.154. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 4

yosys> bmuxmap

3.155. Executing BMUXMAP pass.

yosys> demuxmap

3.156. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_VXOJ7l/abc_tmp_1.scr

3.157. Executing ABC pass (technology mapping using ABC).

3.157.1. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Extracted 3861 gates and 4746 wires to a netlist network with 884 inputs and 799 outputs.

3.157.1.1. Executing ABC.
DE:   #PIs = 884  #Luts =  1189  Max Lvl =   4  Avg Lvl =   2.11  [   0.30 sec. at Pass 0]{firstMap}
DE:   #PIs = 884  #Luts =  1167  Max Lvl =   8  Avg Lvl =   2.47  [   4.24 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 884  #Luts =  1152  Max Lvl =   8  Avg Lvl =   2.47  [   0.99 sec. at Pass 2]{map}
DE:   #PIs = 884  #Luts =  1138  Max Lvl =   8  Avg Lvl =   2.55  [   1.74 sec. at Pass 3]{postMap}
DE:   #PIs = 884  #Luts =  1138  Max Lvl =   8  Avg Lvl =   2.55  [   1.67 sec. at Pass 4]{map}
DE:   #PIs = 884  #Luts =  1136  Max Lvl =   8  Avg Lvl =   2.50  [   2.25 sec. at Pass 5]{postMap}
DE:   #PIs = 884  #Luts =  1136  Max Lvl =   8  Avg Lvl =   2.50  [   2.13 sec. at Pass 6]{map}
DE:   #PIs = 884  #Luts =  1135  Max Lvl =   7  Avg Lvl =   2.50  [   2.08 sec. at Pass 7]{postMap}
DE:   #PIs = 884  #Luts =  1135  Max Lvl =   7  Avg Lvl =   2.50  [   1.58 sec. at Pass 8]{map}
DE:   #PIs = 884  #Luts =  1134  Max Lvl =   7  Avg Lvl =   2.58  [   1.36 sec. at Pass 9]{postMap}
DE:   #PIs = 884  #Luts =  1133  Max Lvl =   7  Avg Lvl =   2.57  [   0.97 sec. at Pass 10]{map}
DE:   #PIs = 884  #Luts =  1132  Max Lvl =   9  Avg Lvl =   2.53  [   1.12 sec. at Pass 11]{postMap}
DE:   #PIs = 884  #Luts =  1131  Max Lvl =  10  Avg Lvl =   2.52  [   1.45 sec. at Pass 12]{map}
DE:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.49  [   1.70 sec. at Pass 13]{postMap}
DE:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.49  [   1.54 sec. at Pass 14]{map}
DE:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.49  [   2.08 sec. at Pass 15]{postMap}
DE:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.49  [   1.86 sec. at Pass 16]{map}
DE:   #PIs = 884  #Luts =  1129  Max Lvl =   8  Avg Lvl =   2.49  [   0.38 sec. at Pass 17]{finalMap}

yosys> opt_expr

3.158. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.159. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.160. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.161. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.162. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.163. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.164. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.165. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 4758 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.166. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.167. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.168. Printing statistics.

=== s38584 ===

   Number of wires:              24875
   Number of wire bits:          24875
   Number of public wires:       23400
   Number of public wire bits:   23400
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2011
     $_ALDFFE_PPN_                   1
     $_ALDFFE_PPP_                  60
     $_ALDFF_PP_                   180
     $_DFFE_PP0N_                   68
     $_DFFE_PP0P_                  111
     $_DFF_PP0_                    475
     $lut                         1116


yosys> shregmap -minlen 8 -maxlen 20

3.169. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.170. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.171. Printing statistics.

=== s38584 ===

   Number of wires:              25357
   Number of wire bits:          25357
   Number of public wires:       23400
   Number of public wire bits:   23400
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               2493
     $_ANDNOT_                     241
     $_AND_                        241
     $_DFFE_PP0N_                   68
     $_DFFE_PP0P_                  111
     $_DFFSRE_PPPN_                  1
     $_DFFSRE_PPPP_                 60
     $_DFFSR_PPP_                  180
     $_DFF_PP0_                    475
     $lut                         1116


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.172. Executing TECHMAP pass (map to technology primitives).

3.172.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.172.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.172.3. Continuing TECHMAP pass.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0N_ for cells of type $_DFFE_PP0N_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFSR_PPP_ for cells of type $_DFFSR_PPP_.
Using template \$_DFFSRE_PPPP_ for cells of type $_DFFSRE_PPPP_.
Using template \$_DFFSRE_PPPN_ for cells of type $_DFFSRE_PPPN_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~3352 debug messages>

yosys> opt_expr -mux_undef

3.173. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~25611 debug messages>

yosys> simplemap

3.174. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.175. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge

3.176. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~10107 debug messages>
Removed a total of 3369 cells.

yosys> opt_dff -nodffe -nosdff

3.177. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.178. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 7936 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.179. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
<suppressed ~450 debug messages>

yosys> opt_merge -nomux

3.180. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
<suppressed ~24 debug messages>
Removed a total of 8 cells.

yosys> opt_muxtree

3.181. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.182. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.183. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.184. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.185. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.186. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 199 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.187. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_VXOJ7l/abc_tmp_2.scr

3.188. Executing ABC pass (technology mapping using ABC).

3.188.1. Extracting gate netlist of module `\s38584' to `<abc-temp-dir>/input.blif'..
Extracted 4391 gates and 5277 wires to a netlist network with 884 inputs and 785 outputs.

3.188.1.1. Executing ABC.
DE:   #PIs = 884  #Luts =  1125  Max Lvl =   5  Avg Lvl =   2.16  [   0.30 sec. at Pass 0]{firstMap}
DE:   #PIs = 884  #Luts =  1119  Max Lvl =   8  Avg Lvl =   2.50  [   3.69 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 884  #Luts =  1119  Max Lvl =   8  Avg Lvl =   2.50  [   1.60 sec. at Pass 2]{map}
DE:   #PIs = 884  #Luts =  1111  Max Lvl =   8  Avg Lvl =   2.56  [   1.43 sec. at Pass 3]{postMap}
DE:   #PIs = 884  #Luts =  1111  Max Lvl =   8  Avg Lvl =   2.56  [   2.40 sec. at Pass 4]{map}
DE:   #PIs = 884  #Luts =  1107  Max Lvl =   8  Avg Lvl =   2.49  [   2.08 sec. at Pass 5]{postMap}
DE:   #PIs = 884  #Luts =  1107  Max Lvl =   8  Avg Lvl =   2.49  [   2.40 sec. at Pass 6]{map}
DE:   #PIs = 884  #Luts =  1105  Max Lvl =   7  Avg Lvl =   2.47  [   2.89 sec. at Pass 7]{postMap}
DE:   #PIs = 884  #Luts =  1105  Max Lvl =   7  Avg Lvl =   2.47  [   2.53 sec. at Pass 8]{map}
DE:   #PIs = 884  #Luts =  1105  Max Lvl =   7  Avg Lvl =   2.47  [   2.67 sec. at Pass 9]{postMap}
DE:   #PIs = 884  #Luts =  1105  Max Lvl =   7  Avg Lvl =   2.47  [   1.84 sec. at Pass 10]{map}
DE:   #PIs = 884  #Luts =  1105  Max Lvl =   7  Avg Lvl =   2.47  [   0.69 sec. at Pass 11]{finalMap}

yosys> opt_expr

3.189. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.

yosys> opt_merge -nomux

3.190. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.191. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \s38584..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.192. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \s38584.
Performed a total of 0 changes.

yosys> opt_merge

3.193. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\s38584'.
Removed a total of 0 cells.

yosys> opt_share

3.194. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.195. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.196. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 4478 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.197. Executing OPT_EXPR pass (perform const folding).
Optimizing module s38584.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.198. Executing HIERARCHY pass (managing design hierarchy).

3.198.1. Analyzing design hierarchy..
Top module:  \s38584

3.198.2. Analyzing design hierarchy..
Top module:  \s38584
Removed 0 unused modules.

yosys> stat

3.199. Printing statistics.

=== s38584 ===

   Number of wires:              24863
   Number of wire bits:          24863
   Number of public wires:       23400
   Number of public wire bits:   23400
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1999
     $lut                         1104
     dffsre                        895


yosys> opt_clean -purge

3.200. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \s38584..
Removed 0 unused cells and 22686 unused wires.
<suppressed ~22686 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.201. Executing Verilog backend.
Dumping module `\s38584'.

Warnings: 26 unique messages, 26 total
End of script. Logfile hash: a81d66c1b9, CPU: user 112.35s system 0.22s, MEM: 200.62 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 71% 6x abc (277 sec), 8% 26x opt_clean (32 sec), ...
real 215.51
user 355.85
sys 32.05
