
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -sv prim_mubi_pkg.sv prim_secded_pkg.sv tl_peri_pkg.sv top_pkg.sv tlul_pkg.sv prim_arbiter_ppc.sv prim_arbiter_tree.sv prim_fifo_async.sv prim_fifo_sync.sv prim_flop_2sync.sv tlul_err_resp.sv tlul_fifo_async.sv tlul_fifo_sync.sv tlul_socket_1n.sv tlul_socket_m1.sv xbar_peri.sv

yosys> verific -sv prim_mubi_pkg.sv prim_secded_pkg.sv tl_peri_pkg.sv top_pkg.sv tlul_pkg.sv prim_arbiter_ppc.sv prim_arbiter_tree.sv prim_fifo_async.sv prim_fifo_sync.sv prim_flop_2sync.sv tlul_err_resp.sv tlul_fifo_async.sv tlul_fifo_sync.sv tlul_socket_1n.sv tlul_socket_m1.sv xbar_peri.sv

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_mubi_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:19: parameter 'MuBi4Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:148: parameter 'MuBi8Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:277: parameter 'MuBi12Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_mubi_pkg.sv:406: parameter 'MuBi16Width' declared inside package 'prim_mubi_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_secded_pkg.sv'
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:81: parameter 'Secded2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:82: parameter 'Secded2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:90: parameter 'Secded2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:91: parameter 'Secded2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:99: parameter 'Secded3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:100: parameter 'Secded3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:108: parameter 'Secded6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:109: parameter 'Secded6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:117: parameter 'Secded7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:118: parameter 'Secded7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:126: parameter 'SecdedHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:127: parameter 'SecdedHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:135: parameter 'SecdedHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:136: parameter 'SecdedHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:144: parameter 'SecdedHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:145: parameter 'SecdedHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:153: parameter 'SecdedHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:154: parameter 'SecdedHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:162: parameter 'SecdedInv2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:163: parameter 'SecdedInv2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:171: parameter 'SecdedInv2822ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:172: parameter 'SecdedInv2822ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:180: parameter 'SecdedInv3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:181: parameter 'SecdedInv3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:189: parameter 'SecdedInv6457ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:190: parameter 'SecdedInv6457ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:198: parameter 'SecdedInv7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:199: parameter 'SecdedInv7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:207: parameter 'SecdedInvHamming2216ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:208: parameter 'SecdedInvHamming2216ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:216: parameter 'SecdedInvHamming3932ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:217: parameter 'SecdedInvHamming3932ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:225: parameter 'SecdedInvHamming7264ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:226: parameter 'SecdedInvHamming7264ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:234: parameter 'SecdedInvHamming7668ZeroEcc' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] prim_secded_pkg.sv:235: parameter 'SecdedInvHamming7668ZeroWord' declared inside package 'prim_secded_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tl_peri_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'top_pkg.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_pkg.sv'
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:14: parameter 'ArbiterImpl' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:27: parameter 'H2DCmdMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:28: parameter 'H2DCmdIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:29: parameter 'H2DCmdFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:30: parameter 'D2HRspMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:31: parameter 'D2HRspIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:32: parameter 'D2HRspFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:33: parameter 'DataMaxWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:34: parameter 'DataIntgWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:35: parameter 'DataFullWidth' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:44: parameter 'TL_A_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-WARNING [VERI-2418] tlul_pkg.sv:84: parameter 'TL_D_USER_DEFAULT' declared inside package 'tlul_pkg' shall be treated as localparam
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_arbiter_ppc.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_arbiter_tree.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_fifo_async.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_fifo_sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'prim_flop_2sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_err_resp.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_fifo_async.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_fifo_sync.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_socket_1n.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'tlul_socket_m1.sv'
VERIFIC-COMMENT [VERI-1482] Analyzing Verilog file 'xbar_peri.sv'

yosys> synth_rs -top xbar_peri -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top xbar_peri

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VERI-1018] xbar_peri.sv:40: compiling module 'xbar_peri'
VERIFIC-INFO [VERI-1018] tlul_socket_1n.sv:43: compiling module 'tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01110000,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01000001,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] tlul_fifo_sync.sv:9: compiling module 'tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)'
VERIFIC-INFO [VERI-1018] prim_fifo_sync.sv:6: compiling module 'prim_fifo_sync(Width=32'b01101100,Depth=32'b0)'
VERIFIC-INFO [VERI-1018] tlul_err_resp.sv:9: compiling module 'tlul_err_resp'
Importing module xbar_peri.
Importing module tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0).
Importing module tlul_err_resp.
Importing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Importing module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Importing module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Importing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Importing module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).

3.4.1. Analyzing design hierarchy..
Top module:  \xbar_peri
Used module:     \tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0)
Used module:         \tlul_err_resp
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01000001,Depth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01101100,Depth=32'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01110000,Depth=32'b0)

3.4.2. Analyzing design hierarchy..
Top module:  \xbar_peri
Used module:     \tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0)
Used module:         \tlul_err_resp
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01000001,Depth=32'b0)
Used module:             \prim_fifo_sync(Width=32'b01101100,Depth=32'b0)
Used module:         \tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101)
Used module:             \prim_fifo_sync(Width=32'b01110000,Depth=32'b0)
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).
Optimizing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Optimizing module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Optimizing module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Optimizing module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Optimizing module tlul_err_resp.
<suppressed ~11 debug messages>
Optimizing module tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0).
<suppressed ~7 debug messages>
Optimizing module xbar_peri.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module prim_fifo_sync(Width=32'b01000001,Depth=32'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01101100,Depth=32'b0).
Deleting now unused module prim_fifo_sync(Width=32'b01110000,Depth=32'b0).
Deleting now unused module tlul_err_resp.
Deleting now unused module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0).
Deleting now unused module tlul_fifo_sync(ReqPass=32'b01,RspPass=32'b01,ReqDepth=32'b0,RspDepth=32'b0,SpareReqW=32'b0101).
Deleting now unused module tlul_socket_1n(N=32'b011100,HReqDepth=4'b0,HRspDepth=4'b0,DReqDepth=112'b0,DRspDepth=112'b0).
<suppressed ~35 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 3 unused cells and 26243 unused wires.
<suppressed ~728 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module xbar_peri...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$16553 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$16555 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_rsp_pending_reg$tlul_err_resp.sv:56$16575 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$16552 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$16554 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$5883 ($aldff) from module xbar_peri.
Changing const-value async load to async reset on $flatten\u_s1n_29.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$5884 ($aldff) from module xbar_peri.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 1

yosys> fsm -encoding binary

3.25. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.25.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

3.25.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.25.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.25.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> fsm_opt

3.25.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.25.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.25.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.25.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.26. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.28. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~11 debug messages>

yosys> opt_reduce

3.29. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.30. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.31. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.32. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_source_reg$tlul_err_resp.sv:35$16553 ($adff) from module xbar_peri (D = \tl_main_i.a_source, Q = \u_s1n_29.gen_err_resp.err_resp.err_source).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_size_reg$tlul_err_resp.sv:35$16555 ($adff) from module xbar_peri (D = \tl_main_i.a_size, Q = \u_s1n_29.gen_err_resp.err_resp.err_size).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_req_pending_reg$tlul_err_resp.sv:35$16552 ($adff) from module xbar_peri (D = $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$n45$16516, Q = \u_s1n_29.gen_err_resp.err_resp.err_req_pending).
Adding EN signal on $flatten\u_s1n_29.\gen_err_resp.err_resp.$verific$err_opcode_reg$tlul_err_resp.sv:35$16554 ($adff) from module xbar_peri (D = \tl_main_i.a_opcode, Q = \u_s1n_29.gen_err_resp.err_resp.err_opcode).
Adding EN signal on $flatten\u_s1n_29.$verific$num_req_outstanding_reg$tlul_socket_1n.sv:123$5883 ($adff) from module xbar_peri (D = $flatten\u_s1n_29.$verific$n215$5444, Q = \u_s1n_29.num_req_outstanding).
Adding EN signal on $flatten\u_s1n_29.$verific$dev_select_outstanding_reg$tlul_socket_1n.sv:123$5884 ($adff) from module xbar_peri (D = \u_s1n_29.dev_select_t, Q = \u_s1n_29.dev_select_outstanding).

yosys> opt_clean

3.33. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 6 unused cells and 6 unused wires.
<suppressed ~7 debug messages>

yosys> opt_expr

3.34. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 2

yosys> wreduce -keepdc

3.42. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_63$xbar_peri.sv:220$122 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_64$xbar_peri.sv:224$123 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_65$xbar_peri.sv:228$124 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_66$xbar_peri.sv:232$125 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_67$xbar_peri.sv:236$126 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_68$xbar_peri.sv:240$127 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_69$xbar_peri.sv:244$128 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_70$xbar_peri.sv:248$129 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_71$xbar_peri.sv:252$130 ($eq).
Removed top 1 bits (of 19) from port B of cell xbar_peri.$verific$equal_72$xbar_peri.sv:256$131 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_73$xbar_peri.sv:260$132 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_74$xbar_peri.sv:264$133 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_75$xbar_peri.sv:268$134 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_76$xbar_peri.sv:272$135 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_77$xbar_peri.sv:276$136 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_78$xbar_peri.sv:280$137 ($eq).
Removed top 1 bits (of 19) from port B of cell xbar_peri.$verific$equal_79$xbar_peri.sv:284$138 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_80$xbar_peri.sv:288$139 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_81$xbar_peri.sv:292$140 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_82$xbar_peri.sv:296$141 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_83$xbar_peri.sv:300$142 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_84$xbar_peri.sv:304$143 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_85$xbar_peri.sv:308$144 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_86$xbar_peri.sv:312$145 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_87$xbar_peri.sv:316$146 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_88$xbar_peri.sv:320$147 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_89$xbar_peri.sv:324$148 ($eq).
Removed top 1 bits (of 20) from port B of cell xbar_peri.$verific$equal_90$xbar_peri.sv:328$149 ($eq).
Removed top 1 bits (of 2) from port B of cell xbar_peri.$auto$opt_dff.cc:195:make_patterns_logic$17345 ($ne).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\fifo_h.$verific$equal_3$tlul_fifo_sync.sv:75$17332 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[0].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[10].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[11].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[12].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[13].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[14].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[15].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[16].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[17].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[18].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[19].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[1].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[20].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[21].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[22].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[23].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[24].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[25].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[26].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[27].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[2].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[3].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[4].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[5].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[6].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[7].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[8].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 3) from port B of cell xbar_peri.$flatten\u_s1n_29.\gen_dfifo[9].fifo_d.$verific$equal_3$tlul_fifo_sync.sv:75$16942 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_103$tlul_socket_1n.sv:138$5962 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_116$tlul_socket_1n.sv:138$5974 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_129$tlul_socket_1n.sv:138$5986 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_142$tlul_socket_1n.sv:138$5998 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_155$tlul_socket_1n.sv:138$6010 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_168$tlul_socket_1n.sv:138$6022 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_181$tlul_socket_1n.sv:138$6034 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_194$tlul_socket_1n.sv:138$6046 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_207$tlul_socket_1n.sv:138$6058 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_220$tlul_socket_1n.sv:138$6070 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_38$tlul_socket_1n.sv:138$5902 ($eq).
Removed top 4 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_482$tlul_socket_1n.sv:169$6288 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_485$tlul_socket_1n.sv:169$6291 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_488$tlul_socket_1n.sv:169$6294 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_491$tlul_socket_1n.sv:169$6297 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_494$tlul_socket_1n.sv:169$6300 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_497$tlul_socket_1n.sv:169$6303 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_500$tlul_socket_1n.sv:169$6306 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_503$tlul_socket_1n.sv:169$6309 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_506$tlul_socket_1n.sv:169$6312 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_509$tlul_socket_1n.sv:169$6315 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_51$tlul_socket_1n.sv:138$5914 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_512$tlul_socket_1n.sv:169$6318 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_515$tlul_socket_1n.sv:169$6321 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_518$tlul_socket_1n.sv:169$6324 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_521$tlul_socket_1n.sv:169$6327 ($eq).
Removed top 1 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_524$tlul_socket_1n.sv:169$6330 ($eq).
Removed top 3 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_64$tlul_socket_1n.sv:138$5926 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_77$tlul_socket_1n.sv:138$5938 ($eq).
Removed top 2 bits (of 5) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$equal_90$tlul_socket_1n.sv:138$5950 ($eq).
Removed top 8 bits (of 9) from port B of cell xbar_peri.$flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878 ($sub).

yosys> peepopt

3.43. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.44. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> bmuxmap

3.45. Executing BMUXMAP pass.

yosys> demuxmap

3.46. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.47. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module xbar_peri:
  creating $macc model for $flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878 ($sub).
  creating $alu model for $macc $flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878.
  creating $alu model for $flatten\u_s1n_29.$verific$LessThan_602$tlul_socket_1n.sv:213$16319 ($le): new $alu
  creating $alu cell for $flatten\u_s1n_29.$verific$LessThan_602$tlul_socket_1n.sv:213$16319: $auto$alumacc.cc:485:replace_alu$17354
  creating $alu cell for $flatten\u_s1n_29.$verific$sub_14$tlul_socket_1n.sv:122$5878: $auto$alumacc.cc:485:replace_alu$17363
  created 2 $alu and 0 $macc cells.

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.49. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.50. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~6 debug messages>

yosys> opt_reduce

3.51. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.52. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.53. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.54. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.55. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.56. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 1

yosys> stat

3.57. Printing statistics.

=== xbar_peri ===

   Number of wires:               5318
   Number of wire bits:          43865
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                319
     $adff                           1
     $adffe                          6
     $alu                            2
     $and                           66
     $eq                           112
     $logic_not                      2
     $mux                          116
     $ne                             2
     $not                            7
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1
     $reduce_or                      1


yosys> memory -nomap

3.58. Executing MEMORY pass.

yosys> opt_mem

3.58.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.58.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.58.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.58.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.58.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.58.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> memory_share

3.58.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.58.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.58.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> memory_collect

3.58.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.59. Printing statistics.

=== xbar_peri ===

   Number of wires:               5318
   Number of wire bits:          43865
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                319
     $adff                           1
     $adffe                          6
     $alu                            2
     $and                           66
     $eq                           112
     $logic_not                      2
     $mux                          116
     $ne                             2
     $not                            7
     $or                             1
     $reduce_and                     2
     $reduce_bool                    1
     $reduce_or                      1


yosys> muxpack

3.60. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting xbar_peri.$flatten\u_s1n_29.$verific$i393$tlul_socket_1n.sv:158$6228 ... xbar_peri.$flatten\u_s1n_29.$verific$i474$tlul_socket_1n.sv:158$6282 to a pmux with 28 cases.
Converting xbar_peri.$flatten\u_s1n_29.$verific$mux_481$tlul_socket_1n.sv:169$6287 ... xbar_peri.$flatten\u_s1n_29.$verific$mux_562$tlul_socket_1n.sv:169$6368 to a pmux with 28 cases.
Converting xbar_peri.$verific$mux_103$xbar_peri.sv:330$161 ... xbar_peri.$verific$mux_108$xbar_peri.sv:330$166 to a pmux with 6 cases.
Converting xbar_peri.$verific$mux_110$xbar_peri.sv:330$168 ... xbar_peri.$verific$mux_118$xbar_peri.sv:330$176 to a pmux with 9 cases.
Converting xbar_peri.$verific$mux_92$xbar_peri.sv:330$150 ... xbar_peri.$verific$mux_94$xbar_peri.sv:330$152 to a pmux with 3 cases.
Converting xbar_peri.$verific$mux_95$xbar_peri.sv:330$153 ... xbar_peri.$verific$mux_101$xbar_peri.sv:330$159 to a pmux with 7 cases.
Converted 81 (p)mux cells into 6 pmux cells.
<suppressed ~115 debug messages>

yosys> opt_clean

3.61. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 75 unused wires.
<suppressed ~1 debug messages>

yosys> pmuxtree

3.62. Executing PMUXTREE pass.

yosys> muxpack

3.63. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17570 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17572 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17560 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17562 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17538 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17540 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17490 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17492 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17470 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17472 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17454 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17456 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17406 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17408 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17386 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17388 to a pmux with 2 cases.
Converting xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17370 ... xbar_peri.$auto$pmuxtree.cc:65:recursive_mux_generator$17372 to a pmux with 2 cases.
Converted 18 (p)mux cells into 9 pmux cells.
<suppressed ~115 debug messages>

yosys> memory_map

3.64. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.65. Printing statistics.

=== xbar_peri ===

   Number of wires:               5369
   Number of wire bits:          43994
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                355
     $adff                           1
     $adffe                          6
     $alu                            2
     $and                           66
     $eq                           112
     $logic_not                      2
     $mux                           98
     $ne                             2
     $not                           13
     $or                            17
     $pmux                           9
     $reduce_and                     2
     $reduce_bool                    1
     $reduce_or                     24


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.66. Executing TECHMAP pass (map to technology primitives).

3.66.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.66.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.66.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $adffe.
Using extmapper simplemap for cells of type $ne.
Using extmapper simplemap for cells of type $reduce_and.
Using template $paramod$70d30c21ff772b34d0d1da2801fbd781dc3c70e4\_90_pmux for cells of type $pmux.
Using template $paramod$b18e16801adf491a64caa0542270798e5d4ac6b6\_90_alu for cells of type $alu.
Using template $paramod$c5c783b17ab1d780abfad8cfe6563a0a7b47a3b0\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $adff.
Using template $paramod$6f67705c43e5e94c02b6ebb52209ce5aa5ade4c1\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $logic_not.
Using template $paramod$e00d7decf912c444ede09e4fab78590edb66181b\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $reduce_bool.
Using extmapper simplemap for cells of type $xor.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000001001 for cells of type $lcu.
No more expansions possible.
<suppressed ~1216 debug messages>

yosys> stat

3.67. Printing statistics.

=== xbar_peri ===

   Number of wires:               6860
   Number of wire bits:          51513
   Number of public wires:        5070
   Number of public wire bits:   41734
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               5600
     $_AND_                        541
     $_DFFE_PN0P_                   27
     $_DFFE_PN1P_                    1
     $_DFF_PN0_                      1
     $_MUX_                       2727
     $_NOT_                        141
     $_OR_                        1207
     $_XOR_                        955


yosys> opt_expr

3.68. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~2708 debug messages>

yosys> opt_merge -nomux

3.69. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~2253 debug messages>
Removed a total of 751 cells.

yosys> opt_muxtree

3.70. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.71. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.72. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.73. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.74. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.75. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 140 unused cells and 1459 unused wires.
<suppressed ~142 debug messages>

yosys> opt_expr

3.76. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.84. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~119 debug messages>

yosys> techmap -map +/techmap.v

3.85. Executing TECHMAP pass (map to technology primitives).

3.85.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.85.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.86. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.87. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.88. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.89. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.90. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.91. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.92. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 3 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 1

yosys> abc -dff

3.94. Executing ABC pass (technology mapping using ABC).

3.94.1. Summary of detected clock domains:
  472 cells in clk=\clk_peri_i, en=\u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  3342 cells in clk=\clk_peri_i, en=$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  4 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  4 cells in clk=\clk_peri_i, en=$auto$opt_dff.cc:194:make_patterns_logic$17344, arst=!\rst_peri_ni, srst={ }
  84 cells in clk=\clk_peri_i, en=$auto$simplemap.cc:251:simplemap_eqne$19690 [1], arst=!\rst_peri_ni, srst={ }

3.94.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by \u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 472 gates and 530 wires to a netlist network with 56 inputs and 69 outputs.

3.94.2.1. Executing ABC.

3.94.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 3342 gates and 5196 wires to a netlist network with 1853 inputs and 67 outputs.

3.94.3.1. Executing ABC.

3.94.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 4 gates and 6 wires to a netlist network with 2 inputs and 2 outputs.

3.94.4.1. Executing ABC.

3.94.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $auto$opt_dff.cc:194:make_patterns_logic$17344, asynchronously reset by !\rst_peri_ni
Extracted 4 gates and 7 wires to a netlist network with 3 inputs and 4 outputs.

3.94.5.1. Executing ABC.

3.94.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $auto$simplemap.cc:251:simplemap_eqne$19690 [1], asynchronously reset by !\rst_peri_ni
Extracted 84 gates and 151 wires to a netlist network with 67 inputs and 48 outputs.

3.94.6.1. Executing ABC.

yosys> abc -dff

3.95. Executing ABC pass (technology mapping using ABC).

3.95.1. Summary of detected clock domains:
  5 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  17 cells in clk=\clk_peri_i, en=$abc$30141$auto$opt_dff.cc:194:make_patterns_logic$17344, arst=!\rst_peri_ni, srst={ }
  372 cells in clk=\clk_peri_i, en=$abc$25292$u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  4502 cells in clk=\clk_peri_i, en=$abc$25644$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  25 cells in clk=\clk_peri_i, en=$abc$30148$auto$simplemap.cc:251:simplemap_eqne$19690[1], arst=!\rst_peri_ni, srst={ }

3.95.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 5 gates and 7 wires to a netlist network with 2 inputs and 2 outputs.

3.95.2.1. Executing ABC.

3.95.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$30141$auto$opt_dff.cc:194:make_patterns_logic$17344, asynchronously reset by !\rst_peri_ni
Extracted 17 gates and 29 wires to a netlist network with 12 inputs and 8 outputs.

3.95.3.1. Executing ABC.

3.95.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$25292$u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 372 gates and 426 wires to a netlist network with 54 inputs and 65 outputs.

3.95.4.1. Executing ABC.

3.95.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$25644$auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 4502 gates and 6353 wires to a netlist network with 1851 inputs and 67 outputs.

3.95.5.1. Executing ABC.

3.95.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$30236$abc$30148$auto$simplemap.cc:251:simplemap_eqne$19690[1], asynchronously reset by !\rst_peri_ni
Extracted 25 gates and 50 wires to a netlist network with 25 inputs and 12 outputs.

3.95.6.1. Executing ABC.

yosys> abc -dff

3.96. Executing ABC pass (technology mapping using ABC).

3.96.1. Summary of detected clock domains:
  5 cells in clk=\clk_peri_i, en=$abc$30230$abc$30136$auto$rtlil.cc:2549:NotGate$25164, arst=!\rst_peri_ni, srst={ }
  3 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  4567 cells in clk=\clk_peri_i, en=$abc$30580$abc$25644$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  325 cells in clk=\clk_peri_i, en=$abc$30256$abc$25292$u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  37 cells in clk=\clk_peri_i, en=$abc$30236$abc$30148$auto$simplemap.cc:251:simplemap_eqne$19690[1], arst=!\rst_peri_ni, srst={ }

3.96.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$30230$abc$30136$auto$rtlil.cc:2549:NotGate$25164, asynchronously reset by !\rst_peri_ni
Extracted 5 gates and 9 wires to a netlist network with 4 inputs and 3 outputs.

3.96.2.1. Executing ABC.

3.96.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 3 gates and 5 wires to a netlist network with 2 inputs and 1 outputs.

3.96.3.1. Executing ABC.

3.96.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$30580$abc$25644$auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 4567 gates and 6418 wires to a netlist network with 1851 inputs and 67 outputs.

3.96.4.1. Executing ABC.

3.96.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$30256$abc$25292$u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 325 gates and 377 wires to a netlist network with 52 inputs and 65 outputs.

3.96.5.1. Executing ABC.

3.96.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$30236$abc$30148$auto$simplemap.cc:251:simplemap_eqne$19690[1], asynchronously reset by !\rst_peri_ni
Extracted 37 gates and 74 wires to a netlist network with 37 inputs and 17 outputs.

3.96.6.1. Executing ABC.

yosys> abc -dff

3.97. Executing ABC pass (technology mapping using ABC).

3.97.1. Summary of detected clock domains:
  5 cells in clk=\clk_peri_i, en=$abc$35184$abc$30230$abc$30136$auto$rtlil.cc:2549:NotGate$25164, arst=!\rst_peri_ni, srst={ }
  298 cells in clk=\clk_peri_i, en=$abc$39750$abc$30256$abc$25292$u_s1n_29.accept_t_req, arst=!\rst_peri_ni, srst={ }
  2 cells in clk=\clk_peri_i, en={ }, arst=!\rst_peri_ni, srst={ }
  4555 cells in clk=\clk_peri_i, en=$abc$35194$abc$30580$abc$25644$auto$opt_dff.cc:219:make_patterns_logic$17350, arst=!\rst_peri_ni, srst={ }
  38 cells in clk=\clk_peri_i, en=$abc$40050$abc$30236$abc$30148$auto$simplemap.cc:251:simplemap_eqne$19690[1], arst=!\rst_peri_ni, srst={ }

3.97.2. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$35184$abc$30230$abc$30136$auto$rtlil.cc:2549:NotGate$25164, asynchronously reset by !\rst_peri_ni
Extracted 5 gates and 9 wires to a netlist network with 4 inputs and 3 outputs.

3.97.2.1. Executing ABC.

3.97.3. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$39750$abc$30256$abc$25292$u_s1n_29.accept_t_req, asynchronously reset by !\rst_peri_ni
Extracted 298 gates and 351 wires to a netlist network with 53 inputs and 65 outputs.

3.97.3.1. Executing ABC.

3.97.4. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, asynchronously reset by !\rst_peri_ni
Extracted 2 gates and 4 wires to a netlist network with 2 inputs and 1 outputs.

3.97.4.1. Executing ABC.

3.97.5. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$35194$abc$30580$abc$25644$auto$opt_dff.cc:219:make_patterns_logic$17350, asynchronously reset by !\rst_peri_ni
Extracted 4555 gates and 6406 wires to a netlist network with 1851 inputs and 67 outputs.

3.97.5.1. Executing ABC.

3.97.6. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk_peri_i, enabled by $abc$40050$abc$30236$abc$30148$auto$simplemap.cc:251:simplemap_eqne$19690[1], asynchronously reset by !\rst_peri_ni
Extracted 38 gates and 75 wires to a netlist network with 37 inputs and 18 outputs.

3.97.6.1. Executing ABC.

yosys> opt_ffinv

3.98. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.99. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~1 debug messages>

yosys> opt_merge -nomux

3.100. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_muxtree

3.101. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.102. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.103. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.104. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.105. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.106. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 23327 unused wires.
<suppressed ~20 debug messages>

yosys> opt_expr

3.107. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.108. Executing BMUXMAP pass.

yosys> demuxmap

3.109. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_CKDTDQ/abc_tmp_1.scr

3.110. Executing ABC pass (technology mapping using ABC).

3.110.1. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Extracted 4954 gates and 6854 wires to a netlist network with 1900 inputs and 112 outputs.

3.110.1.1. Executing ABC.
DE:   #PIs = 1900  #Luts =  1277  Max Lvl =   8  Avg Lvl =   5.49  [   0.18 sec. at Pass 0]{firstMap}
DE:   #PIs = 1900  #Luts =  1171  Max Lvl =  12  Avg Lvl =   7.87  [   7.71 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 1900  #Luts =  1134  Max Lvl =  12  Avg Lvl =   7.69  [   4.20 sec. at Pass 2]{map}
DE:   #PIs = 1900  #Luts =  1125  Max Lvl =  12  Avg Lvl =   7.49  [   6.23 sec. at Pass 3]{postMap}
DE:   #PIs = 1900  #Luts =  1096  Max Lvl =  12  Avg Lvl =   8.04  [   5.70 sec. at Pass 4]{map}
DE:   #PIs = 1900  #Luts =  1096  Max Lvl =  12  Avg Lvl =   8.04  [   8.18 sec. at Pass 5]{postMap}
DE:   #PIs = 1900  #Luts =  1089  Max Lvl =  14  Avg Lvl =   8.64  [   4.41 sec. at Pass 6]{map}
DE:   #PIs = 1900  #Luts =  1085  Max Lvl =  12  Avg Lvl =   7.69  [   7.47 sec. at Pass 7]{postMap}
DE:   #PIs = 1900  #Luts =  1085  Max Lvl =  12  Avg Lvl =   7.69  [   5.44 sec. at Pass 8]{map}
DE:   #PIs = 1900  #Luts =  1063  Max Lvl =  12  Avg Lvl =   7.69  [   6.54 sec. at Pass 9]{postMap}
DE:   #PIs = 1900  #Luts =  1063  Max Lvl =  12  Avg Lvl =   7.69  [   7.41 sec. at Pass 10]{map}
DE:   #PIs = 1900  #Luts =  1063  Max Lvl =  12  Avg Lvl =   7.69  [   7.29 sec. at Pass 11]{postMap}
DE:   #PIs = 1900  #Luts =  1063  Max Lvl =  12  Avg Lvl =   7.69  [   5.12 sec. at Pass 12]{map}
DE:   #PIs = 1900  #Luts =  1063  Max Lvl =  12  Avg Lvl =   7.69  [   1.38 sec. at Pass 13]{finalMap}

yosys> opt_expr

3.111. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.112. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.113. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.114. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.115. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.116. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.117. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.118. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 6856 unused wires.
<suppressed ~5 debug messages>

yosys> opt_expr

3.119. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.120. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.121. Printing statistics.

=== xbar_peri ===

   Number of wires:               6041
   Number of wire bits:          42574
   Number of public wires:        5046
   Number of public wire bits:   41579
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1089
     $_DFFE_PN0N_                    1
     $_DFFE_PN0P_                   25
     $_DFF_PN0_                      1
     $lut                         1062


yosys> shregmap -minlen 8 -maxlen 20

3.122. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.123. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.124. Printing statistics.

=== xbar_peri ===

   Number of wires:               6041
   Number of wire bits:          42574
   Number of public wires:        5046
   Number of public wire bits:   41579
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1089
     $_DFFE_PN0N_                    1
     $_DFFE_PN0P_                   25
     $_DFF_PN0_                      1
     $lut                         1062


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.125. Executing TECHMAP pass (map to technology primitives).

3.125.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.125.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.125.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFFE_PN0P_ for cells of type $_DFFE_PN0P_.
Using template \$_DFF_PN0_ for cells of type $_DFF_PN0_.
Using template \$_DFFE_PN0N_ for cells of type $_DFFE_PN0N_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~1226 debug messages>

yosys> opt_expr -mux_undef

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~37287 debug messages>

yosys> simplemap

3.127. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.128. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge

3.129. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~11067 debug messages>
Removed a total of 3689 cells.

yosys> opt_dff -nodffe -nosdff

3.130. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.131. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 2194 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.132. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
<suppressed ~1231 debug messages>

yosys> opt_merge -nomux

3.133. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.134. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.135. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.137. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.138. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.139. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 79 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.140. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_CKDTDQ/abc_tmp_2.scr

3.141. Executing ABC pass (technology mapping using ABC).

3.141.1. Extracting gate netlist of module `\xbar_peri' to `<abc-temp-dir>/input.blif'..
Extracted 5370 gates and 7272 wires to a netlist network with 1900 inputs and 113 outputs.

3.141.1.1. Executing ABC.
DE:   #PIs = 1900  #Luts =  1095  Max Lvl =   7  Avg Lvl =   5.42  [   0.32 sec. at Pass 0]{firstMap}
DE:   #PIs = 1900  #Luts =  1083  Max Lvl =  12  Avg Lvl =   7.57  [   9.68 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 1900  #Luts =  1083  Max Lvl =  12  Avg Lvl =   7.57  [   1.81 sec. at Pass 2]{map}
DE:   #PIs = 1900  #Luts =  1079  Max Lvl =  13  Avg Lvl =   8.45  [   2.59 sec. at Pass 3]{postMap}
DE:   #PIs = 1900  #Luts =  1068  Max Lvl =  12  Avg Lvl =   7.92  [   4.08 sec. at Pass 4]{map}
DE:   #PIs = 1900  #Luts =  1068  Max Lvl =  12  Avg Lvl =   7.92  [   5.10 sec. at Pass 5]{postMap}
DE:   #PIs = 1900  #Luts =  1066  Max Lvl =  11  Avg Lvl =   7.60  [   3.50 sec. at Pass 6]{map}
DE:   #PIs = 1900  #Luts =  1066  Max Lvl =  11  Avg Lvl =   7.60  [   5.26 sec. at Pass 7]{postMap}
DE:   #PIs = 1900  #Luts =  1059  Max Lvl =  12  Avg Lvl =   7.77  [   4.44 sec. at Pass 8]{map}
DE:   #PIs = 1900  #Luts =  1059  Max Lvl =  12  Avg Lvl =   7.77  [   6.11 sec. at Pass 9]{postMap}
DE:   #PIs = 1900  #Luts =  1059  Max Lvl =  12  Avg Lvl =   7.77  [   4.40 sec. at Pass 10]{map}
DE:   #PIs = 1900  #Luts =  1057  Max Lvl =  11  Avg Lvl =   8.02  [   6.61 sec. at Pass 11]{postMap}
DE:   #PIs = 1900  #Luts =  1053  Max Lvl =  12  Avg Lvl =   7.91  [   2.86 sec. at Pass 12]{map}
DE:   #PIs = 1900  #Luts =  1053  Max Lvl =  12  Avg Lvl =   7.91  [   4.34 sec. at Pass 13]{postMap}
DE:   #PIs = 1900  #Luts =  1045  Max Lvl =  14  Avg Lvl =   8.63  [   4.25 sec. at Pass 14]{map}
DE:   #PIs = 1900  #Luts =  1040  Max Lvl =  13  Avg Lvl =   8.25  [   5.00 sec. at Pass 15]{postMap}
DE:   #PIs = 1900  #Luts =  1040  Max Lvl =  13  Avg Lvl =   8.25  [   4.07 sec. at Pass 16]{map}
DE:   #PIs = 1900  #Luts =  1039  Max Lvl =  12  Avg Lvl =   8.09  [   5.52 sec. at Pass 17]{postMap}
DE:   #PIs = 1900  #Luts =  1036  Max Lvl =  11  Avg Lvl =   7.63  [   3.81 sec. at Pass 18]{map}
DE:   #PIs = 1900  #Luts =  1036  Max Lvl =  11  Avg Lvl =   7.63  [   4.78 sec. at Pass 19]{postMap}
DE:   #PIs = 1900  #Luts =  1036  Max Lvl =  11  Avg Lvl =   7.63  [   3.75 sec. at Pass 20]{map}
DE:   #PIs = 1900  #Luts =  1036  Max Lvl =  11  Avg Lvl =   7.63  [   4.90 sec. at Pass 21]{postMap}
DE:   #PIs = 1900  #Luts =  1034  Max Lvl =  12  Avg Lvl =   7.64  [   1.24 sec. at Pass 22]{finalMap}

yosys> opt_expr

3.142. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.

yosys> opt_merge -nomux

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.144. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \xbar_peri..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.145. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \xbar_peri.
Performed a total of 0 changes.

yosys> opt_merge

3.146. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\xbar_peri'.
Removed a total of 0 cells.

yosys> opt_share

3.147. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.148. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.149. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 6415 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.150. Executing OPT_EXPR pass (perform const folding).
Optimizing module xbar_peri.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.151. Executing HIERARCHY pass (managing design hierarchy).

3.151.1. Analyzing design hierarchy..
Top module:  \xbar_peri

3.151.2. Analyzing design hierarchy..
Top module:  \xbar_peri
Removed 0 unused modules.

yosys> stat

3.152. Printing statistics.

=== xbar_peri ===

   Number of wires:               6012
   Number of wire bits:          42545
   Number of public wires:        5046
   Number of public wire bits:   41579
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1060
     $lut                         1033
     dffsre                         27


yosys> opt_clean -purge

3.153. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \xbar_peri..
Removed 0 unused cells and 4347 unused wires.
<suppressed ~4347 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.154. Executing Verilog backend.
Dumping module `\xbar_peri'.

Warnings: 52 unique messages, 52 total
End of script. Logfile hash: f75dfbe063, CPU: user 16.55s system 0.14s, MEM: 145.47 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 98% 6x abc (828 sec), 0% 29x opt_expr (4 sec), ...
real 220.43
user 794.13
sys 49.80
