
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys-Verific 0.0.92
 Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)


-- Executing script file `yosys.ys' --
echo on

yosys> plugin -i synth-rs

yosys> read -verific

yosys> read -incdir .

yosys> verific -vlog-incdir .

1. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.

yosys> verilog_defaults -add -I.

yosys> read -vhdl AsyncMux.vhd counter.vhd keyupd.vhd kody.vhd pLayer.vhd Reg.vhd slayer.vhd PresentEnc.vhd PresentStateMachine.vhd

yosys> verific -vhdl AsyncMux.vhd counter.vhd keyupd.vhd kody.vhd pLayer.vhd Reg.vhd slayer.vhd PresentEnc.vhd PresentStateMachine.vhd

2. Executing VERIFIC (loading SystemVerilog and VHDL designs using Verific).
Built with Verific May22_SW_Release, released at Wed Jun  1 05:39:28 2022.
VERIFIC-INFO [VHDL-1504] default VHDL library search path is now "/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008"
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'AsyncMux.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_1164' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_1164.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.standard' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/standard.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'std.textio' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/std/textio.vdb'
VERIFIC-INFO [VHDL-1012] AsyncMux.vhd:55: analyzing entity 'asyncmux'
VERIFIC-INFO [VHDL-1010] AsyncMux.vhd:67: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'counter.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_unsigned' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_unsigned.vdb'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.std_logic_arith' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/std_logic_arith.vdb'
VERIFIC-INFO [VHDL-1012] counter.vhd:48: analyzing entity 'counter'
VERIFIC-INFO [VHDL-1010] counter.vhd:58: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'keyupd.vhd'
VERIFIC-INFO [VHDL-1012] keyupd.vhd:52: analyzing entity 'keyupd'
VERIFIC-INFO [VHDL-1010] keyupd.vhd:64: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'kody.vhd'
VERIFIC-INFO [VHDL-1014] kody.vhd:52: analyzing package 'kody'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'pLayer.vhd'
VERIFIC-INFO [VHDL-1012] pLayer.vhd:51: analyzing entity 'player'
VERIFIC-INFO [VHDL-1010] pLayer.vhd:59: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'Reg.vhd'
VERIFIC-INFO [VHDL-1012] Reg.vhd:55: analyzing entity 'reg'
VERIFIC-INFO [VHDL-1010] Reg.vhd:66: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'slayer.vhd'
VERIFIC-INFO [VHDL-1012] slayer.vhd:51: analyzing entity 'slayer'
VERIFIC-INFO [VHDL-1010] slayer.vhd:61: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'PresentEnc.vhd'
VERIFIC-COMMENT [VHDL-1493] Restoring VHDL unit 'ieee.numeric_std' from file '/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/share/yosys/verific/vhdl_vdbs_2008/ieee/numeric_std.vdb'
VERIFIC-INFO [VHDL-1012] PresentEnc.vhd:51: analyzing entity 'presentenc'
VERIFIC-INFO [VHDL-1010] PresentEnc.vhd:69: analyzing architecture 'behavioral'
VERIFIC-COMMENT [VHDL-1481] Analyzing VHDL file 'PresentStateMachine.vhd'
VERIFIC-INFO [VHDL-1012] PresentStateMachine.vhd:51: analyzing entity 'presentstatemachine'
VERIFIC-INFO [VHDL-1010] PresentStateMachine.vhd:62: analyzing architecture 'behavioral'

yosys> synth_rs -top PresentEnc -tech genesis -goal area -de -no_dsp -no_bram -verilog synthesized.v

3. Executing synth_rs pass: v0.4.79

yosys> read_verilog -lib -specify -nomem2reg +/rapidsilicon/common/cells_sim.v +/rapidsilicon/genesis/cells_sim.v +/rapidsilicon/genesis/dsp_sim.v

3.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/common/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\inv'.
Generating RTLIL representation for module `\buff'.
Generating RTLIL representation for module `\logic_0'.
Generating RTLIL representation for module `\logic_1'.
Generating RTLIL representation for module `\gclkbuff'.
Successfully finished Verilog frontend.

3.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/cells_sim.v' to AST representation.
Generating RTLIL representation for module `\dffsre'.
Generating RTLIL representation for module `\dffnsre'.
Generating RTLIL representation for module `\latchsre'.
Generating RTLIL representation for module `\latchnsre'.
Generating RTLIL representation for module `\io_scff'.
Generating RTLIL representation for module `\scff'.
Generating RTLIL representation for module `\sh_dff'.
Generating RTLIL representation for module `\adder_carry'.
Generating RTLIL representation for module `\sdffr'.
Generating RTLIL representation for module `\sdffs'.
Generating RTLIL representation for module `\TDP_BRAM18'.
Generating RTLIL representation for module `\TDP36K'.
Generating RTLIL representation for module `\BRAM2x18_TDP'.
Generating RTLIL representation for module `\BRAM2x18_SDP'.
Generating RTLIL representation for module `\_$_mem_v2_asymmetric'.
Successfully finished Verilog frontend.

3.3. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/dsp_sim.v' to AST representation.
Generating RTLIL representation for module `\RS_DSP1'.
Generating RTLIL representation for module `\RS_DSP2'.
Generating RTLIL representation for module `\RS_DSP2_MULT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP2_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_ports'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_ports'.
Generating RTLIL representation for module `\RS_DSP3'.
Generating RTLIL representation for module `\RS_DSP3_MULT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULT_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTADD_REGIN_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGOUT'.
Generating RTLIL representation for module `\RS_DSP3_MULTACC_REGIN_REGOUT'.
Generating RTLIL representation for module `\dsp_t1_20x18x64_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_10x9x32_cfg_params'.
Generating RTLIL representation for module `\dsp_t1_sim_cfg_params'.
Successfully finished Verilog frontend.

yosys> hierarchy -check -top PresentEnc

3.4. Executing HIERARCHY pass (managing design hierarchy).
VERIFIC-INFO [VHDL-1067] PresentEnc.vhd:51: processing 'PresentEnc(Behavioral)'
VERIFIC-INFO [VHDL-1067] AsyncMux.vhd:55: processing 'AsyncMux(Behavioral)'
VERIFIC-INFO [VHDL-1067] Reg.vhd:55: processing 'Reg(Behavioral)'
VERIFIC-INFO [VHDL-1067] AsyncMux.vhd:55: processing 'AsyncMux(width=80)(Behavioral)'
VERIFIC-INFO [VHDL-1067] Reg.vhd:55: processing 'Reg(width=80)(Behavioral)'
VERIFIC-INFO [VHDL-1067] slayer.vhd:51: processing 'slayer(Behavioral)'
VERIFIC-INFO [VHDL-1067] pLayer.vhd:51: processing 'pLayer(Behavioral)'
VERIFIC-INFO [VHDL-1067] keyupd.vhd:52: processing 'keyupd(Behavioral)'
VERIFIC-INFO [VHDL-1067] PresentStateMachine.vhd:51: processing 'PresentStateMachine(Behavioral)'
VERIFIC-INFO [VHDL-1067] counter.vhd:48: processing 'counter(Behavioral)'
Importing module PresentEnc.
Importing module AsyncMux(Behavioral).
Importing module AsyncMux(width=80)(Behavioral).
Importing module PresentStateMachine(Behavioral).
Importing module Reg(Behavioral).
Importing module Reg(width=80)(Behavioral).
Importing module counter(Behavioral).
Importing module keyupd(Behavioral).
Importing module pLayer(Behavioral).
Importing module slayer(Behavioral).

3.4.1. Analyzing design hierarchy..
Top module:  \PresentEnc
Used module:     \counter(Behavioral)
Used module:     \PresentStateMachine(Behavioral)
Used module:     \keyupd(Behavioral)
Used module:         \slayer(Behavioral)
Used module:     \pLayer(Behavioral)
Used module:     \Reg(width=80)(Behavioral)
Used module:     \AsyncMux(width=80)(Behavioral)
Used module:     \Reg(Behavioral)
Used module:     \AsyncMux(Behavioral)

3.4.2. Analyzing design hierarchy..
Top module:  \PresentEnc
Used module:     \counter(Behavioral)
Used module:     \PresentStateMachine(Behavioral)
Used module:     \keyupd(Behavioral)
Used module:         \slayer(Behavioral)
Used module:     \pLayer(Behavioral)
Used module:     \Reg(width=80)(Behavioral)
Used module:     \AsyncMux(width=80)(Behavioral)
Used module:     \Reg(Behavioral)
Used module:     \AsyncMux(Behavioral)
Removed 0 unused modules.

yosys> proc

3.5. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

3.5.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> proc_rmdead

3.5.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

3.5.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 0 assignments to connections.

yosys> proc_init

3.5.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

3.5.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

3.5.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.

yosys> proc_mux

3.5.7. Executing PROC_MUX pass (convert decision trees to multiplexers).

yosys> proc_dlatch

3.5.8. Executing PROC_DLATCH pass (convert process syncs to latches).

yosys> proc_dff

3.5.9. Executing PROC_DFF pass (convert process syncs to FFs).

yosys> proc_memwr

3.5.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

3.5.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Cleaned up 0 empty switches.

yosys> opt_expr -keepdc

3.5.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module slayer(Behavioral).
<suppressed ~1 debug messages>
Optimizing module pLayer(Behavioral).
Optimizing module keyupd(Behavioral).
Optimizing module counter(Behavioral).
<suppressed ~1 debug messages>
Optimizing module Reg(width=80)(Behavioral).
<suppressed ~1 debug messages>
Optimizing module Reg(Behavioral).
<suppressed ~1 debug messages>
Optimizing module PresentStateMachine(Behavioral).
<suppressed ~5 debug messages>
Optimizing module AsyncMux(width=80)(Behavioral).
Optimizing module AsyncMux(Behavioral).
Optimizing module PresentEnc.

yosys> bmuxmap

3.6. Executing BMUXMAP pass.

yosys> demuxmap

3.7. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> flatten

3.8. Executing FLATTEN pass (flatten design).
Deleting now unused module AsyncMux(Behavioral).
Deleting now unused module AsyncMux(width=80)(Behavioral).
Deleting now unused module PresentStateMachine(Behavioral).
Deleting now unused module Reg(Behavioral).
Deleting now unused module Reg(width=80)(Behavioral).
Deleting now unused module counter(Behavioral).
Deleting now unused module keyupd(Behavioral).
Deleting now unused module pLayer(Behavioral).
Deleting now unused module slayer(Behavioral).
<suppressed ~25 debug messages>

yosys> bmuxmap

3.9. Executing BMUXMAP pass.

yosys> demuxmap

3.10. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> tribuf -logic -formal

3.11. Executing TRIBUF pass.

yosys> deminout

3.12. Executing DEMINOUT pass (demote inout ports to input or output).

yosys> opt_expr

3.13. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~1 debug messages>

yosys> opt_clean

3.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 272 unused cells and 545 unused wires.
<suppressed ~359 debug messages>

yosys> check

3.15. Executing CHECK pass (checking for obvious problems).
Checking module PresentEnc...
Found and reported 0 problems.

yosys> opt_expr

3.16. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.17. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.18. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~9 debug messages>

yosys> opt_reduce

3.19. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.20. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~9 debug messages>
Removed a total of 3 cells.

yosys> opt_share

3.21. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.22. Executing OPT_DFF pass (perform DFF optimizations).
Changing const-value async load to async reset on $flatten\regText.$verific$reg_reg$Reg.vhd:79$136 ($aldff) from module PresentEnc.
Changing const-value async load to async reset on $flatten\regKey.$verific$reg_reg$Reg.vhd:79$146 ($aldff) from module PresentEnc.
Changing const-value async load to async reset on $flatten\count.$verific$cnt_reg$counter.vhd:69$160 ($aldff) from module PresentEnc.
Changing const-value async load to async reset on $flatten\SM.$verific$state_reg$PresentStateMachine.vhd:126$126 ($aldff) from module PresentEnc.

yosys> opt_clean

3.23. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.24. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_muxtree

3.25. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.26. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.27. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.28. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.29. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.30. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.31. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 2

yosys> fsm -encoding binary

3.32. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

3.32.1. Executing FSM_DETECT pass (finding FSMs in design).
Not marking PresentEnc.SM.state as FSM state register:
    Users of register don't seem to benefit from recoding.

yosys> fsm_extract

3.32.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

3.32.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

3.32.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> fsm_opt

3.32.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode -encoding binary

3.32.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

3.32.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

3.32.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt_expr

3.33. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.34. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.35. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~8 debug messages>

yosys> opt_reduce

3.36. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.37. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.38. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.39. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\regText.$verific$reg_reg$Reg.vhd:79$136 ($adff) from module PresentEnc (D = \mux_64.output, Q = \regText.reg).
Adding EN signal on $flatten\regKey.$verific$reg_reg$Reg.vhd:79$146 ($adff) from module PresentEnc (D = \mux_80.output, Q = \regKey.reg).
Adding EN signal on $flatten\count.$verific$cnt_reg$counter.vhd:69$160 ($adff) from module PresentEnc (D = $flatten\count.$verific$n11$151, Q = \count.cnt).

yosys> opt_clean

3.40. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 3 unused cells and 3 unused wires.
<suppressed ~4 debug messages>

yosys> opt_expr

3.41. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_muxtree

3.42. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.43. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.44. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.45. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.46. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.47. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.48. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 2

yosys> wreduce -keepdc

3.49. Executing WREDUCE pass (reducing word size of cells).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[9].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[8].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[7].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[6].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[5].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[4].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[3].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[2].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[1].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[15].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[14].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[13].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[12].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[11].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[10].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\slayers[0].s_x.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_9$slayer.vhd:70$268 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_8$slayer.vhd:69$267 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_7$slayer.vhd:68$266 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_6$slayer.vhd:67$265 ($eq).
Removed top 2 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_5$slayer.vhd:66$264 ($eq).
Removed top 3 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_4$slayer.vhd:65$263 ($eq).
Removed top 1 bits (of 4) from port B of cell PresentEnc.$flatten\mixer.\s1.$verific$equal_10$slayer.vhd:71$269 ($eq).
Removed top 4 bits (of 5) from port B of cell PresentEnc.$flatten\count.$verific$add_4$counter.vhd:67$157 ($add).

yosys> peepopt

3.50. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

3.51. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> bmuxmap

3.52. Executing BMUXMAP pass.

yosys> demuxmap

3.53. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> alumacc

3.54. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module PresentEnc:
  creating $macc model for $flatten\count.$verific$add_4$counter.vhd:67$157 ($add).
  creating $alu model for $macc $flatten\count.$verific$add_4$counter.vhd:67$157.
  creating $alu cell for $flatten\count.$verific$add_4$counter.vhd:67$157: $auto$alumacc.cc:485:replace_alu$379
  created 1 $alu and 0 $macc cells.

yosys> opt_expr

3.55. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.56. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.57. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~7 debug messages>

yosys> opt_reduce

3.58. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.59. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.60. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.61. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.62. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.63. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> stat

3.64. Printing statistics.

=== PresentEnc ===

   Number of wires:               1202
   Number of wire bits:           3327
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1184
     $adff                           1
     $adffe                          3
     $alu                            1
     $eq                           239
     $logic_not                     18
     $mux                          903
     $not                           17
     $xor                            2


yosys> memory -nomap

3.65. Executing MEMORY pass.

yosys> opt_mem

3.65.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

3.65.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

3.65.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

3.65.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

3.65.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

3.65.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> memory_share

3.65.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

3.65.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

3.65.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> memory_collect

3.65.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> stat

3.66. Printing statistics.

=== PresentEnc ===

   Number of wires:               1202
   Number of wire bits:           3327
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1184
     $adff                           1
     $adffe                          3
     $alu                            1
     $eq                           239
     $logic_not                     18
     $mux                          903
     $not                           17
     $xor                            2


yosys> muxpack

3.67. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting PresentEnc.$flatten\SM.$verific$mux_23$PresentStateMachine.vhd:100$113 ... PresentEnc.$flatten\SM.$verific$mux_24$PresentStateMachine.vhd:100$114 to a pmux with 2 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\mixer.\s1.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\mixer.\s1.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\mixer.\s1.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\mixer.\s1.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\mixer.\s1.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[0].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[0].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[10].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[10].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[11].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[11].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[12].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[12].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[13].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[13].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[14].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[14].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[15].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[15].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[1].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[1].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[2].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[2].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[3].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[3].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[4].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[4].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[5].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[5].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[6].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[6].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[7].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[7].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[8].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[8].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i112$slayer.vhd:77$320 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i138$slayer.vhd:80$333 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i147$slayer.vhd:77$335 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i173$slayer.vhd:80$348 to a pmux with 14 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i48$slayer.vhd:74$282 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i68$slayer.vhd:80$302 to a pmux with 11 cases.
Converting PresentEnc.$flatten\slayers[9].s_x.$verific$i79$slayer.vhd:76$306 ... PresentEnc.$flatten\slayers[9].s_x.$verific$i103$slayer.vhd:80$318 to a pmux with 13 cases.
Converted 886 (p)mux cells into 69 pmux cells.
<suppressed ~900 debug messages>

yosys> opt_clean

3.68. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 817 unused wires.
<suppressed ~1 debug messages>

yosys> pmuxtree

3.69. Executing PMUXTREE pass.

yosys> muxpack

3.70. Executing MUXPACK pass ($mux cell cascades to $pmux).
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$3058 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$3060 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2898 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2900 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2738 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2740 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2578 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2580 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2418 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2420 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2258 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2260 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2098 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$2100 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1938 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1940 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1778 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1780 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1618 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1620 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1458 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1460 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1298 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1300 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1138 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$1140 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$978 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$980 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$818 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$820 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$658 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$660 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$498 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$500 to a pmux with 2 cases.
Converting PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$386 ... PresentEnc.$auto$pmuxtree.cc:65:recursive_mux_generator$388 to a pmux with 2 cases.
Converted 36 (p)mux cells into 18 pmux cells.
<suppressed ~559 debug messages>

yosys> memory_map

3.71. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> stat

3.72. Printing statistics.

=== PresentEnc ===

   Number of wires:               1749
   Number of wire bits:           3875
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               1644
     $adff                           1
     $adffe                          3
     $alu                            1
     $eq                           239
     $logic_not                     18
     $mux                          867
     $not                           86
     $or                           136
     $pmux                          18
     $reduce_or                    273
     $xor                            2


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/arith_map.v

3.73. Executing TECHMAP pass (map to technology primitives).

3.73.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.73.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/arith_map.v' to AST representation.
Generating RTLIL representation for module `\_80_rs_alu'.
Successfully finished Verilog frontend.

3.73.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $not.
Using template $paramod$c5c783b17ab1d780abfad8cfe6563a0a7b47a3b0\_90_pmux for cells of type $pmux.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $adffe.
Using template $paramod$521ce43182eecb9f60c72393a788160d2c356bf5\_90_pmux for cells of type $pmux.
Using template $paramod$672a140277c71df8314410f22acc08d55222c3c7\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $adff.
Using extmapper simplemap for cells of type $and.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000101 for cells of type $lcu.
Using extmapper simplemap for cells of type $pos.
No more expansions possible.
<suppressed ~2069 debug messages>

yosys> stat

3.74. Printing statistics.

=== PresentEnc ===

   Number of wires:               3712
   Number of wire bits:           8666
   Number of public wires:          97
   Number of public wire bits:    2199
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:               4872
     $_AND_                         50
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $_MUX_                       1041
     $_NOT_                        348
     $_OR_                        2245
     $_XOR_                       1037


yosys> opt_expr

3.75. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~1778 debug messages>

yosys> opt_merge -nomux

3.76. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~5229 debug messages>
Removed a total of 1743 cells.

yosys> opt_muxtree

3.77. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.78. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.79. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.80. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.81. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.82. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 359 unused cells and 2641 unused wires.
<suppressed ~360 debug messages>

yosys> opt_expr

3.83. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_muxtree

3.84. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.85. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.86. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.87. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.88. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.89. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.90. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 2

yosys> opt_expr -full

3.91. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~78 debug messages>

yosys> techmap -map +/techmap.v

3.92. Executing TECHMAP pass (map to technology primitives).

3.92.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.92.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~71 debug messages>

yosys> opt_expr

3.93. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.94. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.95. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.96. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.97. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_dff -nosdff -nodffe -sat

3.98. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.99. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.100. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> abc -dff

3.101. Executing ABC pass (technology mapping using ABC).

3.101.1. Summary of detected clock domains:
  20 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  1961 cells in clk=\clk, en=\count.cnt_res, arst=\reset, srst={ }

3.101.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 20 gates and 29 wires to a netlist network with 7 inputs and 3 outputs.

3.101.2.1. Executing ABC.

3.101.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by \count.cnt_res, asynchronously reset by \reset
Extracted 1961 gates and 2110 wires to a netlist network with 147 inputs and 71 outputs.

3.101.3.1. Executing ABC.

yosys> abc -dff

3.102. Executing ABC pass (technology mapping using ABC).

3.102.1. Summary of detected clock domains:
  17 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  952 cells in clk=\clk, en=$abc$11595$count.cnt_res, arst=\reset, srst={ }

3.102.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 17 gates and 25 wires to a netlist network with 8 inputs and 3 outputs.

3.102.2.1. Executing ABC.

3.102.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$12550$lo0, asynchronously reset by \reset
Extracted 952 gates and 1098 wires to a netlist network with 146 inputs and 71 outputs.

3.102.3.1. Executing ABC.

yosys> abc -dff

3.103. Executing ABC pass (technology mapping using ABC).

3.103.1. Summary of detected clock domains:
  14 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  938 cells in clk=\clk, en=$abc$12550$lo0, arst=\reset, srst={ }

3.103.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 14 gates and 22 wires to a netlist network with 8 inputs and 3 outputs.

3.103.2.1. Executing ABC.

3.103.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$13506$lo1, asynchronously reset by \reset
Extracted 938 gates and 1084 wires to a netlist network with 146 inputs and 71 outputs.

3.103.3.1. Executing ABC.

yosys> abc -dff

3.104. Executing ABC pass (technology mapping using ABC).

3.104.1. Summary of detected clock domains:
  14 cells in clk=\clk, en={ }, arst=\reset, srst={ }
  930 cells in clk=\clk, en=$abc$13506$lo1, arst=\reset, srst={ }

3.104.2. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, asynchronously reset by \reset
Extracted 14 gates and 22 wires to a netlist network with 8 inputs and 3 outputs.

3.104.2.1. Executing ABC.

3.104.3. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Found matching posedge clock domain: \clk, enabled by $abc$14454$lo1, asynchronously reset by \reset
Extracted 930 gates and 1076 wires to a netlist network with 146 inputs and 71 outputs.

3.104.3.1. Executing ABC.

yosys> opt_ffinv

3.105. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> opt_expr

3.106. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~13 debug messages>

yosys> opt_merge -nomux

3.107. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~3 debug messages>
Removed a total of 1 cells.

yosys> opt_muxtree

3.108. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.109. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.110. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.111. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -sat

3.112. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.113. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 5022 unused wires.
<suppressed ~12 debug messages>

yosys> opt_expr

3.114. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> bmuxmap

3.115. Executing BMUXMAP pass.

yosys> demuxmap

3.116. Executing DEMUXMAP pass.

yosys> clean_zerowidth

yosys> abc -script /tmp/yosys_0TJ7b0/abc_tmp_1.scr

3.117. Executing ABC pass (technology mapping using ABC).

3.117.1. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Extracted 780 gates and 1076 wires to a netlist network with 296 inputs and 215 outputs.

3.117.1.1. Executing ABC.
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.15 sec. at Pass 0]{firstMap}
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   1.34 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.69 sec. at Pass 2]{map}
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.64 sec. at Pass 3]{postMap}
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   1.09 sec. at Pass 4]{map}
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.89 sec. at Pass 5]{postMap}
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   1.20 sec. at Pass 6]{pushMap}
DE:   #PIs = 296  #Luts =   218  Max Lvl =   3  Avg Lvl =   1.99  [   0.50 sec. at Pass 7]{finalMap}

yosys> opt_expr

3.118. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.119. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.120. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.121. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.122. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.123. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.124. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.125. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1076 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.126. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> opt_ffinv

3.127. Executing OPT_FFINV pass (push inverters through FFs).
Discovering LUTs.
Pushed 0 inverters.

yosys> stat

3.128. Printing statistics.

=== PresentEnc ===

   Number of wires:                389
   Number of wire bits:           2116
   Number of public wires:          86
   Number of public wire bits:    1809
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                369
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $lut                          218


yosys> shregmap -minlen 8 -maxlen 20

3.129. Executing SHREGMAP pass (map shift registers).
Converted 0 dff cells into 0 shift registers.

yosys> dfflegalize -cell $_DFF_?_ 0 -cell $_DFF_???_ 0 -cell $_DFFE_????_ 0 -cell $_DFFSR_???_ 0 -cell $_DFFSRE_????_ 0 -cell $_DLATCHSR_PPP_ 0

3.130. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).

yosys> stat

3.131. Printing statistics.

=== PresentEnc ===

   Number of wires:                389
   Number of wire bits:           2116
   Number of public wires:          86
   Number of public wire bits:    1809
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                369
     $_DFFE_PP0P_                  149
     $_DFF_PP0_                      2
     $lut                          218


yosys> techmap -map +/techmap.v -map +/rapidsilicon/genesis/ffs_map.v

3.132. Executing TECHMAP pass (map to technology primitives).

3.132.1. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

3.132.2. Executing Verilog-2005 frontend: /nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v
Parsing Verilog input from `/nfs_scratch/scratch/Vorak/aram/Workspace/Raptor/yosys_verific_rs/yosys/install/bin/../share/yosys/rapidsilicon/genesis/ffs_map.v' to AST representation.
Generating RTLIL representation for module `\$_DFF_P_'.
Generating RTLIL representation for module `\$_DFF_PP0_'.
Generating RTLIL representation for module `\$_DFF_PN0_'.
Generating RTLIL representation for module `\$_DFF_PP1_'.
Generating RTLIL representation for module `\$_DFF_PN1_'.
Generating RTLIL representation for module `\$_DFFE_PP_'.
Generating RTLIL representation for module `\$_DFFE_PN_'.
Generating RTLIL representation for module `\$_DFFE_PP0P_'.
Generating RTLIL representation for module `\$_DFFE_PP0N_'.
Generating RTLIL representation for module `\$_DFFE_PN0P_'.
Generating RTLIL representation for module `\$_DFFE_PN0N_'.
Generating RTLIL representation for module `\$_DFFE_PP1P_'.
Generating RTLIL representation for module `\$_DFFE_PP1N_'.
Generating RTLIL representation for module `\$_DFFE_PN1P_'.
Generating RTLIL representation for module `\$_DFFE_PN1N_'.
Generating RTLIL representation for module `\$_DFFSR_PPP_'.
Generating RTLIL representation for module `\$_DFFSR_PNP_'.
Generating RTLIL representation for module `\$_DFFSR_PNN_'.
Generating RTLIL representation for module `\$_DFFSR_PPN_'.
Generating RTLIL representation for module `\$_DFFSR_NPP_'.
Generating RTLIL representation for module `\$_DFFSR_NNP_'.
Generating RTLIL representation for module `\$_DFFSR_NNN_'.
Generating RTLIL representation for module `\$_DFFSR_NPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_PPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_PPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_PNNN_'.
Generating RTLIL representation for module `\$_DLATCHSR_PPP_'.
Generating RTLIL representation for module `\$_DLATCHSR_NPP_'.
Generating RTLIL representation for module `\$_DFF_N_'.
Generating RTLIL representation for module `\$_DFF_NP0_'.
Generating RTLIL representation for module `\$_DFF_NN0_'.
Generating RTLIL representation for module `\$_DFF_NP1_'.
Generating RTLIL representation for module `\$_DFF_NN1_'.
Generating RTLIL representation for module `\$_DFFE_NP_'.
Generating RTLIL representation for module `\$_DFFE_NN_'.
Generating RTLIL representation for module `\$_DFFE_NP0P_'.
Generating RTLIL representation for module `\$_DFFE_NP0N_'.
Generating RTLIL representation for module `\$_DFFE_NN0P_'.
Generating RTLIL representation for module `\$_DFFE_NN0N_'.
Generating RTLIL representation for module `\$_DFFE_NP1P_'.
Generating RTLIL representation for module `\$_DFFE_NP1N_'.
Generating RTLIL representation for module `\$_DFFE_NN1P_'.
Generating RTLIL representation for module `\$_DFFE_NN1N_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNP_'.
Generating RTLIL representation for module `\$_DFFSRE_NPPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNPN_'.
Generating RTLIL representation for module `\$_DFFSRE_NPNN_'.
Generating RTLIL representation for module `\$_DFFSRE_NNNN_'.
Generating RTLIL representation for module `\$__SHREG_DFF_P_'.
Generating RTLIL representation for module `\$_SDFF_PP0_'.
Generating RTLIL representation for module `\$_SDFF_PN0_'.
Generating RTLIL representation for module `\$_SDFF_NP0_'.
Generating RTLIL representation for module `\$_SDFF_NN0_'.
Generating RTLIL representation for module `\$_SDFF_PP1_'.
Generating RTLIL representation for module `\$_SDFF_PN1_'.
Generating RTLIL representation for module `\$_SDFF_NP1_'.
Generating RTLIL representation for module `\$_SDFF_NN1_'.
Successfully finished Verilog frontend.

3.132.3. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $lut.
Using template \$_DFF_PP0_ for cells of type $_DFF_PP0_.
Using template \$_DFFE_PP0P_ for cells of type $_DFFE_PP0P_.
Using extmapper simplemap for cells of type $logic_not.
No more expansions possible.
<suppressed ~656 debug messages>

yosys> opt_expr -mux_undef

3.133. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~5887 debug messages>

yosys> simplemap

3.134. Executing SIMPLEMAP pass (map simple cells to gate primitives).

yosys> opt_expr

3.135. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge

3.136. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
<suppressed ~975 debug messages>
Removed a total of 325 cells.

yosys> opt_dff -nodffe -nosdff

3.137. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.138. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1298 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.139. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
<suppressed ~22 debug messages>

yosys> opt_merge -nomux

3.140. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.141. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.142. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.143. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.144. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.145. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.146. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..

yosys> opt_expr

3.147. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> abc -script /tmp/yosys_0TJ7b0/abc_tmp_2.scr

3.148. Executing ABC pass (technology mapping using ABC).

3.148.1. Extracting gate netlist of module `\PresentEnc' to `<abc-temp-dir>/input.blif'..
Extracted 1113 gates and 1412 wires to a netlist network with 297 inputs and 216 outputs.

3.148.1.1. Executing ABC.
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   0.13 sec. at Pass 0]{firstMap}
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   3.97 sec. at Pass 1]{initMapFlow}
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   0.93 sec. at Pass 2]{map}
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   0.86 sec. at Pass 3]{postMap}
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   0.98 sec. at Pass 4]{map}
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   0.90 sec. at Pass 5]{postMap}
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   0.92 sec. at Pass 6]{pushMap}
DE:   #PIs = 297  #Luts =   219  Max Lvl =   3  Avg Lvl =   1.98  [   0.45 sec. at Pass 7]{finalMap}

yosys> opt_expr

3.149. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.

yosys> opt_merge -nomux

3.150. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_muxtree

3.151. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \PresentEnc..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

3.152. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \PresentEnc.
Performed a total of 0 changes.

yosys> opt_merge

3.153. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\PresentEnc'.
Removed a total of 0 cells.

yosys> opt_share

3.154. Executing OPT_SHARE pass.

yosys> opt_dff -nosdff -nodffe

3.155. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

3.156. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 1078 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

3.157. Executing OPT_EXPR pass (perform const folding).
Optimizing module PresentEnc.
MAX OPT ITERATION = 1

yosys> hierarchy -check

3.158. Executing HIERARCHY pass (managing design hierarchy).

3.158.1. Analyzing design hierarchy..
Top module:  \PresentEnc

3.158.2. Analyzing design hierarchy..
Top module:  \PresentEnc
Removed 0 unused modules.

yosys> stat

3.159. Printing statistics.

=== PresentEnc ===

   Number of wires:                390
   Number of wire bits:           2117
   Number of public wires:          86
   Number of public wire bits:    1809
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                370
     $lut                          219
     dffsre                        151


yosys> opt_clean -purge

3.160. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \PresentEnc..
Removed 0 unused cells and 78 unused wires.
<suppressed ~78 debug messages>

yosys> write_verilog -noattr -nohex synthesized.v

3.161. Executing Verilog backend.
Dumping module `\PresentEnc'.

End of script. Logfile hash: a69f5ff5a1, CPU: user 4.70s system 0.04s, MEM: 51.91 MB peak
Yosys 0.18+10 (git sha1 7361c89db, gcc 9.4.0-1ubuntu1~20.04.1 -fPIC -Os)
Time spent: 84% 6x abc (24 sec), 4% 28x opt_expr (1 sec), ...
real 30.23
user 25.14
sys 4.31
